# Product: NAGIOS
# Category: NETWORK MONITORING
# Supported Format: CSV
# Reference: NA
# Last Updated: 2024-08-22
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "network" => ""
      "security_result" => ""
      "column1" => ""
      "column2" => ""
      "column3" => ""
      "column4" => ""
      "error_msg" => ""
      "msg_ip" => ""
      "port" => ""
      "jobid" => ""
      "ent" => ""
      "pid" => ""
      "csv_data" => ""
      "description" => ""
      "src_ip" => ""
      "date" => ""
      "has_principal_user" => ""
      "has_target" => ""
      "has_principal" => ""
    }
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:date} %{IP:src_ip} %{DATA}: %{DATA:ent}: %{GREEDYDATA:csv_data};%{GREEDYDATA:description}",
        "<%{INT}>%{SYSLOGTIMESTAMP:date} %{IP:src_ip} %{DATA}: job %{INT:jobid} \\(pid=%{INT:pid}\\): %{GREEDYDATA:description}",
        "<%{INT}>%{SYSLOGTIMESTAMP:date} %{IP:src_ip} %{DATA}: %{GREEDYDATA:description}"
      ]
    }
    overwrite => ["date", "ent", "csv_data", "description", "src_ip", "jobid","pid"]
    on_error => "invalid_grok"
  }
  if [date] != "" {
    date {
      match => ["date", "MMM dd HH:mm:ss"]
      rebase => true
      on_error => "format_error1"
    }
  }
  if [src_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "src_ip"
        "principal.asset.ip" => "src_ip"
      }
      on_error => "invalid_principal_ip"
    }
    if ![invalid_principal_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [jobid] != "" {
    mutate {
      replace => {
        "jobid_label.key" => "Jobid"
        "jobid_label.value" => "%{jobid}"
      }
      on_error => "invalid_jobid"
    }
    if ![invalid_jobid] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "jobid_label"
        }
        on_error => "jobid_merge_failed"
      }
    }
  }
  if [pid] != "" {
    mutate {
      replace => {
        "principal.process.pid" => "%{pid}"
      }
      on_error => "invalid_pid"
    }
  }
  if [ent] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{ent}"
      }
      on_error => "invalid_event"
    }
  }
  if [description] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{description}"
      }
      on_error => "invalid_description"
    }
  }
  if [description] != "" {
    grok {
      match => {
        "description" => [
            "%{GREEDYDATA} %{IP:msg_ip}:%{GREEDYDATA}",
            "%{GREEDYDATA} %{IP:msg_ip} and port %{INT:port}:%{GREEDYDATA}"
        ]
      }
      overwrite => ["msg_ip","port"]
      on_error => "invalid_description_grok"
    }
  }
  if [msg_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "msg_ip"
        "target.asset.ip" => "msg_ip"
      }
      on_error => "invalid_target_ip"
    }
    if ![invalid_target_ip] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [port] != "" {
    mutate {
      replace => {
        "target.port" => "%{port}"
      }
      on_error => "invalid_port"
    }
    mutate {
      convert => {
        "target.port" => "integer"
      }
      on_error => "conversion_failed"
    }
  }
  if [csv_data] != "" {
    csv {
      source => "csv_data"
      separator => ";"
      on_error => "invalid_csv"
    }
  }
  if [ent] =~ "SERVICE NOTIFICATION" {
    if [column1] != "" {
      mutate {
        replace => {
          "principal.user.user_display_name" => "%{column1}"
        }
        on_error => "invalid_column1"
      }
    }
    if [column2] != "" {
      mutate {
        replace => {
          "principal.hostname" => "%{column2}"
          "principal.asset.hostname" => "%{column2}"
        }
        on_error => "invalid_column2"
      }
    }
    if [column3] != "" {
      mutate {
        replace => {
          "security_result.summary" => "%{column3}"
        }
        on_error => "invalid_column3"
      }
    }
    if [column4] in ["LOW", "MEDIUM", "HIGH", "CRITICAL"] {
      mutate {
        replace => {
          "security_result.severity" => "%{column4}"
        }
        on_error => "invalid_column4"
      }
    }
    else {
      mutate {
        replace => {
          "security_result.severity_details" => "%{column4}"
        }
        on_error => "invalid_ent"
      }
    }
  }
  if [ent] =~ "SERVICE ALERT" {
    if [column1] != "" {
      mutate {
        replace => {
          "principal.hostname" => "%{column1}"
          "principal.asset.hostname" => "%{column1}"
        }
        on_error => "invalid_column1"
      }
    }
    if [column2] != "" {
      mutate {
        replace => {
          "security_result.summary" => "%{column3}"
        }
        on_error => "invalid_column2"
      }
    }
    if [column3] != "" {
      mutate {
        replace => {
          "security_result.summary" => "%{column3}"
        }
        on_error => "invalid_column3"
      }
    }
    if [column4] in ["LOW", "MEDIUM", "HIGH", "CRITICAL"] {
      mutate {
        replace => {
          "security_result.severity" => "%{column4}"
        }
      }
    }
    else {
      mutate {
        replace => {
          "security_result.severity_details" => "%{column4}"
        }
      }
    }
  }
  mutate {
    replace => {
      "metadata.product_name" => "NAGIOS"
      "metadata.vendor_name" => "NAGIOS"
    }
  }
  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if  [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else if [has_principal_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "merge_failed"
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
