# Product: FORCEPOINT CASB
# Category: CASB
# Supported Format: SYSLOG + CEF
# Reference: https://www.websense.com/content/support/library/casb/admin_guide/casb_admin_guide.pdf
# Last Updated: 2022-08-23
# Copyright 2022 Chronicle LLC


filter {
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "network" => ""
      "target" => ""
      "src_label" => ""
      "extensions" => ""
      "intermediary" => ""
      "ts_event" => ""
      "inter_host" => ""
      "product" => ""
      "value" => ""
      "version" => ""
      "event_type" => ""
      "event_name" => ""
      "kv_data" => ""
      "msg" => ""
      "agt" => ""
      "ahost" => ""
      "amac" => ""
      "aid" => ""
      "cs1" => ""
      "suid" => ""
      "atz" => ""
      "av" => ""
      "sourceServiceName" => ""
      "agentZoneURI" => ""
      "at" => ""
      "request" => ""
      "requestClientApplication" => ""
      "sourceZoneURI" => ""
      "src" => ""
      "shost" => ""
      "spriv" => ""
      "sproc" => ""
      "smb_host" => ""
      "smb_uid" => ""
      "dvc" => ""
      "dvchost" => ""
      "deviceZoneURI" => ""
      "deviceProcessName" => ""
      "act" => ""
    }
  }

  # pattern to match each log message and setting variable values
  grok {
      match => {
          "message" => [
              "%{SYSLOGTIMESTAMP:ts_event} %{IPORHOST:inter_host} CEF: 0\\|%{WORD:product}\\|%{WORD:value}\\|(%{DATA:version}|)\\|%{WORD:event_type}\\|(?P<event_name>[^\|]+)\\|%{DATA}\\| %{GREEDYDATA:kv_data}",
          ]
      }
      on_error => "grok_failure"
      overwrite => [ "kv_data", "ts_event", "inter_host",
      "product", "value", "version", "event_type", "event_name"
      ]
  }
  if [kv_data] != "" {
    mutate {
      gsub => ["kv_data", "\\s(\\w+)=", "#$1="]
    }
    kv {
        source => "kv_data"
        field_split => "#"
        value_split => "="
    }

    if [ts_event] != "" {
      date {
        match => ["ts_event", "MMM d HH:mm:ss", "MMM dd HH:mm:ss"]
        rebase => true
        target => "metadata.collected_timestamp"
      }
    }
    if [msg] != "" {
      mutate {
        replace => {
          "metadata.description" => "%{msg}"
          "security_result.summary" => "%{msg}"
        }
      }
    }
    if [agt] != "" {
      mutate {
        merge => {
          "principal.ip" => "agt"
        }
      }
    }
    if [ahost] != "" {
      mutate {
        replace => {
          "principal.hostname" => "%{ahost}"
        }
      }
    }
    if [amac] != "" {
      mutate { gsub => ["amac", "-", ":"] }
      mutate { lowercase => ["amac"] }
      mutate {
        merge => {
          "principal.mac" => "amac"
        }
      }
    }
    if [aid] != "" {
      mutate {
        replace => {
          "principal.resource.id" => "%{aid}"
        }
      }
    }
    if [cs1] != "" {
      mutate {
        merge => {
          "principal.user.email_addresses" => "cs1"
        }
      }
    }
    if [suid] != "" {
      mutate {
        replace => {
          "principal.user.userid" => "%{suid}"
        }
      }
    }
    if [atz] != "" {
      mutate {
        replace => {
          "principal.location.country_or_region" => "%{atz}"
        }
      }
    }
    if [av] != "" {
      mutate {
        replace => {
          "av_label.key" => "av"
          "av_label.value" => "%{av}"
        }
        merge => {
          "principal.resource.attribute.labels" => "av_label"
        }
      }
    }
    if [sourceServiceName] != "" {
      mutate {
        replace => {
          "principal.platform_version" => "%{sourceServiceName}"
        }
      }
      if [sourceServiceName] =~ "(?i)(Window)" {
        mutate {
          replace => {
            "principal.platform" => "WINDOWS"
          }
        }
      }
      else if [sourceServiceName] =~ "(?i)(Linux)" {
        mutate {
          replace => {
            "principal.platform" => "LINUX"
          }
        }
      }
      else if [sourceServiceName] =~ "(?i)(mac|iPhone)" {
        mutate {
          replace => {
            "principal.platform" => "MAC"
          }
        }
      }
    }
    if [agentZoneURI] != "" {
      mutate {
        replace => {
          "principal.url" => "%{agentZoneURI}"
        }
      }
    }
    if [at] != "" {
      mutate {
        replace => {
          "principal.resource.name" => "%{at}"
        }
      }
    }
    if [request] != "" {
      mutate {
        replace => {
          "extensions.auth.type" => "SSO"
          "extensions.auth.auth_details" => "%{request}"
        }
      }
    }
    if [requestClientApplication] != "" {
      mutate {
        replace => {
          "network.http.user_agent" => "%{requestClientApplication}"
        }
      }
    }
    if [sourceZoneURI] != "" {
      mutate {
        replace => {
          "src_label.url" => "%{sourceZoneURI}"
        }
      }
    }
    if [src] != "" {
      mutate {
        merge => {
          "src_label.ip" => "src"
        }
      }
    }
    if [shost] != "" {
      mutate {
        replace => {
          "src_label.hostname" => "%{shost}"
        }
      }
    }
    if [spriv] != "" {
      mutate {
        merge => {
          "src_label.user.department" => "spriv"
        }
      }
    }
    if [sproc] != "" {
      mutate {
        replace => {
          "sproc_label.key" => "sproc"
          "sproc_label.value" => "%{sproc}"
        }
        merge => {
          "src_label.resource.attribute.labels" => "sproc_label"
        }
      }
    }
    if [smb_host] != "" {
      mutate {
        replace => {
          "intermediary.hostname" => "%{smb_host}"
        }
      }
    }
    if [smb_uid] != "" {
      mutate {
        replace => {
          "intermediary.user.userid" => "%{smb_uid}"
        }
      }
    }
    if [dvc] != "" {
      mutate {
        merge => {
          "target.ip" => "dvc"
        }
      }
    }
    if [dvchost] != "" {
      mutate {
        replace => {
          "target.hostname" => "%{dvchost}"
        }
      }
    }
    if [deviceZoneURI] != "" {
      mutate {
        replace => {
          "target.url" => "%{deviceZoneURI}"
        }
      }
    }
    if [deviceProcessName] != "" {
      mutate {
        replace => {
          "target.resource.name" => "%{deviceProcessName}"
        }
      }
    }
    if [act] != "" {
      if [act] =~ "(?i)(ALLOW)" {
        mutate {
          replace => {
            "action" => "ALLOW"
          }
        }
      }
      else {
        mutate {
          replace => {
            "action" => "BLOCK"
          }
        }
      }
      mutate {
        merge => {
          "security_result.action" => "action"
        }
      }
    }
    mutate {
      replace => {
        "metadata.vendor_name" => "%{product}"
        "metadata.product_name" => "Frocepoint %{value}"
        "metadata.product_event_type" => "%{event_name} %{event_type}"
        "metadata.event_type" => "USER_RESOURCE_ACCESS"
      }
    }

    if [event_name] =~ "(?i)(Login)" {
      mutate {
        replace => {
          "metadata.event_type" => "USER_LOGIN"
        }
      }
    }
    else if [event_name] =~ "(?i)(Logout)" {
      mutate {
        replace => {
          "metadata.event_type" => "USER_LOGOUT"
        }
      }
    }
    else if [event_name] =~ "(?i)(access event)" {
      mutate {
        replace => {
          "metadata.event_type" => "USER_UNCATEGORIZED"
        }
      }
    }
    else if [agt] != "" {
      mutate {
        replace => {
          "metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }

    if [principal] != "" {
      mutate {
        rename => {
          "principal" => "event.idm.read_only_udm.principal"
        }
      }
    }

    if [target] != "" {
      mutate {
        rename => {
          "target" => "event.idm.read_only_udm.target"
        }
      }
    }

    if [metadata] != "" {
      mutate {
        rename => {
          "metadata" => "event.idm.read_only_udm.metadata"
        }
      }
    }

    if [network] != "" {
      mutate {
        rename => {
          "network" => "event.idm.read_only_udm.network"
        }
      }
    }

    if [src_label] != "" {
      mutate {
        rename => {
          "src_label" => "event.idm.read_only_udm.src"
        }
      }
    }

    if [intermediary] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.intermediary" => "intermediary"
        }
      }
    }

    if [extensions] != "" {
      mutate {
        rename => {
          "extensions" => "event.idm.read_only_udm.extensions"
        }
      }
    }

    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
      }
    }
  }
  else {
    drop {
      tag => "TAG_UNSPECIFIED"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
