# Product: Netskope_Client
# Category: CASB
# Supported Format: JSON
# References: N/A
# Last Updated: 2024-10-16
# Copyright 2024 Chronicle LLC

filter{
  mutate {
    replace => {
      "event" => ""
      "principal" => ""
      "target" => ""
      "security_result" => ""
      "metadata" => ""
      "network" => ""
      "suser" => ""
      "clientBytes" => ""
      "serverBytes" => ""
      "action" => ""
      "action_value" => ""
      "cci" => ""
      "ccl" => ""
      "networkSessionId" => ""
      "os" => ""
      "osVersion" => ""
      "dpt" => ""
      "dst" => ""
      "clientPackets" => ""
      "policy" => ""
      "proto" => ""
      "requestClientApplication" => ""
      "sourceServiceName" => ""
      "requestMethod" => ""
      "sessionDuration" => ""
      "shost" => ""
      "spt" => ""
      "trafficType" => ""
      "tunnelId" => ""
      "tunnelType" => ""
      "tunnelUpTime" => ""
      "timestamp" => ""
      "start" => ""
      "end" => ""
      "has_principal" => "false"
      "has_target" => "false"
    }
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "json_failed"
  }
  if [suser] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{suser}"
      }
      on_error => "suser_invalid_for_principal_user_userid"
    }
  }
  if [os] != "" {
    if [os] == "Windows" {
      mutate {
        replace => {
          "principal.platform" => "WINDOWS"
        }
        on_error => "os_invalid"
      }
    }
    else if [os] == "macOS" {
      mutate {
        replace => {
          "principal.platform" => "MAC"
        }
        on_error => "os_invalid"
      }
    }
    else if [os] == "Linux" {
      mutate {
        replace => {
          "principal.platform" => "LINUX"
        }
        on_error => "os_invalid"
      }
    }
  }
  if [osVersion] != "" {
    mutate {
      replace => {
        "principal.platform_version" => "%{osVersion}"
      }
      on_error => "osVersion_invalid"
    }
  }
  if [requestClientApplication] != "" {
    mutate {
      replace => {
        "principal.application" => "%{requestClientApplication}"
      }
      on_error => "requestClientApplication_invalid"
    }
  }
  if [sourceServiceName] != "" {
    mutate {
      replace =>{
        has_principal => "true"
      }
    }
    grok {
      match => {
        "sourceServiceName" => "%{IP:sourceServiceName}"
      }
      overwrite => ["sourceServiceName"]
      on_error => "sourceServiceName_empty"
    }
    if ![sourceServiceName_empty] {
      mutate {
        merge => {
          "principal.ip" => "sourceServiceName"
        }
        on_error => "sourceServiceName_invalid"
      }
    }
    else{
      mutate {
        replace => {
          "principal.hostname" => "%{sourceServiceName}"
        }
        on_error => "sourceServiceName_invalid"
      }
    }
  }
  if [spt] != "" {
    mutate {
      convert => {
        "spt" => "integer"
      }
      on_error => "spt_already_integer"
    }
    if ![spt_already_integer] {
      mutate {
        rename => {
          "spt" => "principal.port"
        }
      }
    }
  }
  if [shost] not in ["null",""] {
    mutate {
      replace => {
        "principal.hostname" => "%{shost}"
        "principal.asset.hostname" => "%{shost}"
      }
      on_error => "shost_invalid"
    }
  }
  mutate {
    uppercase => [ "action" ]
  }
  if [action] in ["ALLOW","BLOCK","QUARANTINE"] {
    mutate {
      merge => {
        "security_result.action" => "action"
      }
      on_error => "no_action_value"
    }
  }
  if [cci] != "" {
    mutate {
      convert => {
        "cci" => "string"
      }
      on_error => "cci_already_string"
    }
    mutate {
      replace => {
        "cci_field.key" => "cci"
        "cci_field.value" => "%{cci}"
      }
      on_error => "cci_field_invalid"
    }
    if ![cci_field_invalid] {
      mutate {
        merge => {
          "security_result.detection_fields" => "cci_field"
        }
        on_error => "cci_field_merge_failed"
      }
    }
  }
  if [clientBytes] != "" {
    mutate {
      convert => {
        "clientBytes" => "uinteger"
      }
      on_error => "client_bytes_already_integer"
    }
    if not [client_bytes_already_integer] {
      mutate {
        rename => {
          "clientBytes" => "network.sent_bytes"
        }
      }
    }
  }
  if [networkSessionId] != "" {
    mutate {
      replace => {
        "network.session_id" => "%{networkSessionId}"
      }
      on_error => "networkSessionId_empty"
    }
  }
  if [clientPackets] != "" {
    mutate {
      convert => {
        "clientPackets" => "integer"
      }
      on_error => "client_packets_already_integer"
    }
    if ![client_packets_already_integer] {
      mutate {
        rename => {
          "clientPackets" => "network.sent_packets"
        }
      }
    }
  }
  if [dpt] != "" {
    mutate {
      replace => {
        "target.port" => "%{dpt}"
      }
      on_error => "dpt_empty"
    }
    mutate {
      convert => {
        "target.port" => "integer"
      }
      on_error => "dpt_not_integer"
    }
  }
  if [dst] != "" {
    grok {
      match => {
        "dst" => "%{IP:dst}"
      }
      overwrite => ["dst"]
      on_error => "dst_empty"
    }
    if ![dst_empty] {
      mutate {
        merge => {
          "target.ip" => "dst"
        }
        on_error => "dst_merge_failed"
      }
      if ![dst_merge_failed] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }
  }
  if [ccl] != "" {
    mutate {
      replace => {
        "security_result.confidence_details" => "%{ccl}"
      }
      on_error => "ccl_invalid_for_confidence_details"
    }
  }
  if [serverBytes] != "" {
    mutate {
      convert => {
        "serverBytes" => "uinteger"
      }
      on_error => "server_bytes_already_integer"
    }
    if not [server_bytes_already_integer] {
      mutate {
        rename => {
          "serverBytes" => "network.received_bytes"
        }
      }
    }
  }
  if [policy] != "" {
    mutate {
      replace => {
        "policy_field.key" => "policy"
        "policy_field.value" => "%{policy}"
      }
      on_error => "policy_invalid"
    }
    if ![policy_invalid] {
      mutate {
        merge => {
          "security_result.detection_fields" => "policy_field"
        }
        on_error => "policy_merge_failed"
      }
    }
  }
  if [proto] != "" {
    mutate {
      replace => {
        "app_protocol_src" => "%{proto}"
      }
    }
    # This file contains application protocol parsing logic

    # Interface:
    # app_protocol_src (required): string that contains application protocol or a
    #                              port number
    # app_protocol_output: string that is either empty or contains application
    #                      protocol compatible to ApplicationProtocol enum in
    #                      udm.proto

    mutate {
      uppercase => [ "app_protocol_src" ]
    }

    if [app_protocol_src] in [ "22", "SSH", "SSHD" ] {
      mutate {
        replace => {
          "app_protocol_output" => "SSH"
        }
      }
    }
    else if [app_protocol_src] in [ "25", "SMTP" ] {
      mutate {
        replace => {
          "app_protocol_output" => "SMTP"
        }
      }
    }
    else if [app_protocol_src] in [ "53", "DNS" ] {
      mutate {
        replace => {
          "app_protocol_output" => "DNS"
        }
      }
    }
    else if [app_protocol_src] in [ "80", "8080", "HTTP" ] {
      mutate {
        replace => {
          "app_protocol_output" => "HTTP"
        }
      }
    }
    else if [app_protocol_src] in [ "443", "HTTPS", "TLS" ] {
      mutate {
        replace => {
          "app_protocol_output" => "HTTPS"
        }
      }
    }
    else if [app_protocol_src] in [ "7400", "7401", "7402", "DDS" ] {
      mutate {
        replace => {
          "app_protocol_output" => "DDS"
        }
      }
    }
    else if [app_protocol_src] in [ "SMB", "SMBV1" ] {
      mutate {
        replace => {
          "app_protocol_output" => "SMB"
        }
      }
    }
    else if [app_protocol_src] in [
      "UNKNOWN_APPLICATION_PROTOCOL", "AFP", "APPC", "AMQP", "ATOM", "BEEP",
      "BITCOIN", "BIT_TORRENT", "CFDP", "COAP", "DEVICE_NET", "DHCP", "E_DONKEY",
      "ENRP", "FAST_TRACK", "FINGER", "FREENET", "FTAM", "GOPHER", "HL7", "H323",
      "IRCP", "KADEMLIA", "LDAP", "LPD", "MIME", "MODBUS", "MQTT", "NETCONF",
      "NFS", "NIS", "NNTP", "NTCIP", "NTP", "OSCAR", "PNRP", "QUIC", "RDP", "RELP",
      "RIP", "RLOGIN", "RPC", "RTMP", "RTP", "RTPS", "RTSP", "SAP", "SDP", "SIP",
      "SLP", "SNTP", "SSMS", "STYX", "TCAP", "TDS", "TOR", "TSP", "VTP", "WHOIS",
      "WEB_DAV", "X400", "X500", "XMPP", "IEC104", "DCERPC"
    ] {
      mutate {
        replace => {
          "app_protocol_output" => "%{app_protocol_src}"
        }
      }

    } else {
      mutate {
        replace => {
          "app_protocol_output" => ""
        }
      }
    }
    if [app_protocol_output] != "" {
      mutate {
        replace => {
          "network.application_protocol" => "%{app_protocol_output}"
        }
        on_error => "app_protocol_output_invalid"
      }
    }
    else {
      mutate {
        replace => {
          "proto_field.key" => "proto"
          "proto_field.value" => "%{proto}"
        }
        on_error => "proto_invalid"
      }
      if ![proto_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "proto_field"
          }
          on_error => "proto_merge_failed"
        }
      }
    }
  }
  if [requestMethod] != "" {
    mutate {
      replace => {
        "method_label.key" => "requestMethod"
        "method_label.value" => "%{requestMethod}"
      }
      on_error => "no_method"
    }
    if ![no_method] {
      mutate {
        merge => {
          "security_result.detection_fields" => "method_label"
        }
        on_error => "method_merge_failed"
      }
    }
  }
  if [sessionDuration] != "" {
    mutate {
      convert => {
        "sessionDuration" => "integer"
      }
      on_error => "sessionDuration_already_integer"
    }
    if ![sessionDuration_already_integer] {
      mutate {
        rename => {
          "sessionDuration" => "network.session_duration.seconds"
        }
      }
    }
  }
  if [trafficType] != "" {
    mutate {
      replace => {
        "trafficType_field.key" => "trafficType"
        "trafficType_field.value" => "%{trafficType}"
      }
      on_error => "trafficType_invalid"
    }
    if ![trafficType_invalid] {
      mutate {
        merge => {
          "security_result.detection_fields" => "trafficType_field"
        }
        on_error => "trafficType_merge_failed"
      }
    }
  }
  if[tunnelId] != "" {
    mutate {
      replace => {
        "tunnelId_field.key" => "tunnelId"
        "tunnelId_field.value" => "%{tunnelId}"
      }
      on_error => "tunnelId_invalid"
    }
    if ![tunnelId_invalid] {
      mutate {
        merge => {
          "security_result.detection_fields" => "tunnelId_field"
        }
        on_error => "tunnelId_merge_error"
      }
    }
  }
  if[tunnelType] != "" {
    mutate {
      replace => {
        "tunnelType_field.key" => "tunnelType"
        "tunnelType_field.value" => "%{tunnelType}"
      }
      on_error => "tunnelType_invalid"
    }
    if ![tunnelType_invalid] {
      mutate {
        merge => {
          "security_result.detection_fields" => "tunnelType_field"
        }
        on_error => "tunnelType_merge_error"
      }
    }
  }
  if [tunnelUpTime] != "" {
    mutate {
      replace => {
        "tunnelUpTime_field.key" => "tunnelUpTime"
        "tunnelUpTime_field.value" => "%{tunnelUpTime}"
      }
      on_error => "tunnelUpTime_invalid"
    }
    if ![tunnelUpTime_invalid] {
      mutate {
        merge => {
          "security_result.detection_fields" => "tunnelUpTime_field"
        }
        on_error => "tunnelUpTime_merge_error"
      }
    }
  }
  if [timestamp] != "" {
    date {
      match => ["timestamp", "UNIX"],
      target => "metadata.event_timestamp"
      on_error => "timestamp_invalid_for_event_timestamp"
    }
  }
  if[start] != "" {
    mutate {
      replace => {
        "start_field.key" => "start"
        "start_field.value" => "%{start}"
      }
      on_error => "start_invalid"
    }
    if ![start_invalid] {
      mutate {
        merge => {
          "security_result.detection_fields" => "start_field"
        }
        on_error => "start_merge_error"
      }
    }
  }
  if [end] != "" {
    mutate {
      replace => {
        "end_field.key" => "end"
        "end_field.value" => "%{end}"
      }
      on_error => "end_invalid"
    }
    if ![end_invalid] {
      mutate {
        merge => {
          "security_result.detection_fields" => "end_field"
        }
        on_error => "end_merge_error"
      }
    }
  }
  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
   mutate {
      replace =>{
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate{
    replace => {
      "metadata.vendor_name" => "Netscope"
      "metadata.product_name" => "Netscope Client"
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
