
# Product: CENSYS
# Category: NDR
# Supported Format: SYSLOG + KV
# Reference: N/A
# Last Updated: 2024-02-03
# Copyright 2024 Chronicle LLC
filter {
  mutate {
    replace => {
      "type" => ""
      "ip" => ""
      "data_protocols" => ""
      "data.ipAddress" => ""
      "data.nameServers" => ""
      "data.mailServers" => ""
      "data.names.forwardDns" => ""
      "assetId" => ""
      "risks" => ""
      "risk_names" => ""
      "http.response.body" => ""
      "banner" => ""
      "data.protocol.transportProtocol" => ""
      "http.request.uri" => ""
      "port" => ""
      "protocol_value" => ""
      "id" => ""
      "timestamp" => ""
      "operation" => ""
      "entity.hostname" => ""
      "entity.ipAddress" => ""
      "security_result" => ""
      "data.cve" => ""
      "data.cvss" => ""
      "associatedAt" => ""
      "location.city" => ""
      "data.location.city" => ""
      "location.continent" => ""
      "location.coordinates.latitude" => ""
      "data.location.latitude"=> ""
      "data.location.longitude" => ""
      "location.coordinates.longitude"=> ""
      "location_geo_latitude" => ""
      "location_geo_longitude" => ""
      "properties.location.geoCoordinates.latitude" => ""
      "properties.location.geoCoordinates.longitude" => ""
      "location.country" => ""
      "data.location.countryCode" => ""
      "location.province" => ""
      "data_ip_protocol" => ""
      "data.location.province" =>""
      "location.postalCode" => ""
      "perspectiveId" => ""
      "serviceName" => ""
      "autonomousSystem.asn" => ""
      "autonomousSystem.bgpPrefix" => ""
      "cloud" => ""
      "bgpPrefix"=>""
      "transportProtocol" => ""
      "sourceIp" => ""
      "isSeed" => ""
      "transportFingerprint.raw" => ""
      "transportFingerprint.id" => ""
      "http.request.headers" => ""
      "http.response.headers" => ""
      "status_code" => ""
      "http.response.statusCode" => ""
      "has_princ_machine_id" => "false"
      "has_network_flow" => "false"
      "has_target_machine" => "false"
      "has_hostname" => "false"
      "user_agent" => ""
      "comments.refUrl" => ""
      "ApplicationProtocol" => ""
    }
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "CENSYS_ASM"
      "event.idm.read_only_udm.metadata.vendor_name" => "CENSYS"
    }
  }
  if [type] != "" {
    if [type] in ["HOST","ASSET","DOMAIN"] {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.product_event_type" => "%{type}"
        }
        on_error => "host_type_not_found"
      }
      if [assetId] != "" {
        grok {
          match => {
            "assetId" => "%{IP:valid_ip}"
          }
          on_error => "assetId_not_ip"
        }
        if ![assetId_not_ip] {
          mutate {
            merge => {
              "event.idm.read_only_udm.principal.ip" => "valid_ip"
              "event.idm.read_only_udm.principal.asset.ip" => "valid_ip"
            }
            on_error => "no_assetId"
          }
        }
        else {
          mutate {
            replace => {
              "event.idm.read_only_udm.principal.hostname" => "%{assetId}"
              "event.idm.read_only_udm.principal.asset.hostname" => "%{assetId}"
            }
            on_error => "no_assetId_3"
          }
        }
        mutate {
          replace => {
            "has_princ_machine_id" => "true"
          }
        }
      }
      if [risks] != "" {
        for risk in risks {
          mutate {
            replace => {
              "tmp_risk" => "%{risk.title}: %{risk.severity}"
            }
            on_error => "no_tmp_risk"
          }
          mutate {
            merge => {
              "risk_names.category_details" => "tmp_risk"
            }
            on_error => "no_risk_name"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.security_result" => "risk_names"
          }
          on_error => "no_risk_name"
        }
      }
    }
  }
  if [banner] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "WEB_ENTITY"
      }
      on_error => "no_web_entity"
    }
    mutate {
      replace => {
        "banner_labels.key" => "banner"
        "banner_labels.value" => "%{banner}"
      }
      on_error => "no_banner"
    }
    if ![no_banner] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.resource.attribute.labels" => "banner_labels"
        }
        on_error => "no_banner_lanbels"
      }
    }
  }
  if [http][response][body] != "" {
    mutate {
      replace => {
        "http_response_body_labels.key" => "http_response_body"
        "http_response_body_labels.value" => "%{http.response.body}"
      }
      on_error =>"no_http_response_body"
    }
    if ![no_http_response_body] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.resource.attribute.labels" => "http_response_body_labels"
        }
        on_error=> "no_response_body_labels"
      }
    }
  }
  if [http][request][uri] != "" and [port] != "" {
    grok {
      match => {
        "http.request.uri" => "(https?://)?%{IPORHOST:uri_match}"
      }
      on_error => "invalid_uri_match"
    }
    mutate {
      convert => {
        "port" => "string"
      }
      on_error ="already_a_string_1"
    }
    mutate {
      replace => {
        "entity_name" => "%{uri_match}:%{port}"
      }
      on_error =>"invalid_port"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{uri_match}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{uri_match}"
      }
      on_error => "no_uri_match"
    }
    mutate {
      replace => {
        "has_princ_machine_id" => "true"
      }
    }
  }
  if [type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{type}"
      }
      on_error => "no_type"
    }
  }
  if [transportFingerprint][id] != "" {
    mutate {
      convert => {
        "transportFingerprint.id" => "string"
      }
      on_error => "conversion_error"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{transportFingerprint.id}"
      }
    }
  }
  if [timestamp] != "" {
    date {
      match => ["timestamp", "TIMESTAMP_ISO8601"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "invalid_timestamp"
    }
  }
  if [operation] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{operation}"
      }
      on_error => "no_operation"
    }
  }
  if [entity][hostname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{entity.hostname}"
      }
      on_error => "no_entity_hostname"
    }
    mutate {
      replace => {
        "has_princ_machine_id" => "true"
      }
    }
  }
  if [entity][ipAddress] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "entity.ipAddress"
        "event.idm.read_only_udm.principal.asset.ip" => "entity.ipAddress"
      }
      on_error => "no_entity_ipAddress"
    }
    mutate {
      replace => {
        "has_princ_machine_id" => "true"
      }
    }
  }
  if [ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "ip"
        "event.idm.read_only_udm.target.asset.ip" => "ip"
      }
      on_error => "no_target_ipAddress"
    }
    mutate {
      replace => {
        "has_target_machine" => "true"
      }
    }
  }
  if [associatedAt] != "" {
    mutate {
      replace => {
        "associatedAt_label.key" => "associatedAt"
        "associatedAt_label.value" => "%{associatedAt}"
      }
      on_error => "invalid_associatedAt"
    }
    if ![invalid_associatedAt] {
      mutate {
       merge => {
         "security_result.detection_fields" => "associatedAt_label"
        }
        on_error => "no_associatedAt"
      }
    }
  }
  for index, dataname in data.names.forwardDns {
    mutate {
      replace => {
        "token_question" => ""
      }
    }
    mutate {
      replace => {
        "token_question.name" => "%{dataname.name}"
        "has_network_flow" => "true"
      }
      on_error => "query_not_found"
    }
    if ![query_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.network.dns.questions" => "token_question"
        }
        on_error => "token_question_not_found"
      }
    }
  }
  if [location][continent]  != "" {
    mutate {
      replace => {
        "additional_location_continent.key" => "location_continent"
        "additional_location_continent.value.string_value" => "%{location.continent}"
      }
      on_error => "no_location_continent"
    }
    if not [no_location_continent] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_location_continent"
        }
        on_error => "no_location_continent"
      }
    }
  }
  if [data][ipAddress] != "" and [data][ipAddress] != [assetId] {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "data.ipAddress"
        "event.idm.read_only_udm.principal.asset.ip" => "data.ipAddress"
      }
      on_error => "no_data_ipAdress"
    }
    mutate {
      replace => {
        "has_princ_machine_id" => "true"
      }
    }
  }
  if [location][city] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.city" => "%{location.city}"
      }
      on_error => "city_notfound"
    }
  }
  else if [data][location][city] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.city" => "%{data.location.city}"
      }
      on_error => "data_city_notfound"
    }
  }
  mutate {
    convert => {
      "location.geoCoordinates.latitude" => "string"
    }
    on_error => "already_a_string"
  }
  mutate {
    replace => {
      "location_geo_latitude" => "%{location.geoCoordinates.latitude}"
    }
    on_error => "no_location_geo_latitude"
  }
  if [location][coordinates][latitude] != "" {
    mutate {
      convert => {
        "location.coordinates.latitude" => "float"
      }
      on_error => "conversion_failed"
    }
    mutate {
      rename => {
        "location.coordinates.latitude" => "event.idm.read_only_udm.principal.location.region_coordinates.latitude"
      }
      on_error => "no_location_coordinates_latitude"
    }
  }
  else if ![no_location_geo_latitude] and [location_geo_latitude] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.region_coordinates.latitude" => "%{location_geo_latitude}"
      }
      convert => {
        "event.idm.read_only_udm.principal.location.region_coordinates.latitude" => "float"
      }
      on_error => "conversion_failed"
    }
    mutate {
      rename => {
        "location_geo_latitude" => "event.idm.read_only_udm.principal.location.region_latitude"
      }
    }
  }
  mutate {
    convert => {
      "data.location.latitude" => "string"
    }
    on_error => "already_a_string"
  }
  mutate {
    replace => {
      "location_geo_latitude" => "%{data.location.latitude}"
    }
    on_error => "no_location_geo_latitude"
  }
  if [data][location][latitude] != "" {
    mutate {
      convert => {
        "data.location.latitude" => "float"
      }
      on_error => "conversion_failed"
    }
    mutate {
      rename => {
        "data.location.latitude" => "event.idm.read_only_udm.principal.location.region_coordinates.latitude"
      }
      on_error => "no_location_coordinates_latitude"
    }
  }
  else if ![no_location_geo_latitude] and [location_geo_latitude] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.region_coordinates.latitude" => "%{location_geo_latitude}"
      }
      convert => {
        "event.idm.read_only_udm.principal.location.region_coordinates.latitude" => "float"
      }
      on_error => "conversion_failed"
    }
  }
  mutate {
    convert => {
      "location.geoCoordinates.longitude" => "string"
    }
    on_error => "already_a_string"
  }
  mutate {
    replace => {
      "location_geo_longitude" => "%{location.geoCoordinates.longitude}"
    }
    on_error => "no_location_geo_longitude"
  }
  if [location][coordinates][longitude] != "" {
    mutate {
      convert => {
        "location.coordinates.longitude" => "string"
      }
      on_error => "already_a_string"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.region_coordinates.longitude" => "%{location.coordinates.longitude}"
      }
      convert => {
        "event.idm.read_only_udm.principal.location.region_coordinates.longitude" => "float"
      }
      on_error => "conversion_failed"
    }
    mutate {
      convert => {
        "location.coordinates.longitude" => "float"
      }
      on_error => "conversion_failed"
    }
  }
  else if ![no_location_geo_longitude] and [location_geo_longitude] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.region_coordinates.longitude" => "%{location_geo_longitude}"
      }
      convert => {
        "event.idm.read_only_udm.principal.location.region_coordinates.longitude" => "float"
      }
      on_error => "conversion_failed"
    }
    mutate {
      rename => {
        "location_geo_longitude" => "event.idm.read_only_udm.principal.location.region_longitude"
      }
    }
  }
  mutate {
    convert => {
      "data.location.longitude" => "string"
    }
    on_error => "already_a_string"
  }
  mutate {
    replace => {
      "location_geo_longitude" => "%{data.location.longitude}"
    }
    on_error => "no_location_geo_longitude"
  }
  if [data][location][longitude] != "" {
    mutate {
      convert => {
        "data.location.longitude" => "float"
      }
      on_error => "conversion_failed"
    }
    mutate {
      rename => {
        "data.location.longitude" => "event.idm.read_only_udm.principal.location.region_coordinates.longitude"
      }
      on_error => "no_location_coordinates_longitude"
    }
  }
  else if ![no_location_geo_longitude] and [location_geo_longitude] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.region_coordinates.longitude" => "%{location_geo_longitude}"
      }
      convert => {
        "event.idm.read_only_udm.principal.location.region_coordinates.longitude" => "float"
      }
      on_error => "conversion_failed"
    }
    mutate {
      rename => {
        "location_geo_longitude" => "event.idm.read_only_udm.principal.location.region_longitude"
      }
    }
  }
  if [location][country] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.country_or_region" => "%{location.country}"
      }
      on_error => "country_notfound"
    }
  }
  else if [data][location][countryCode] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.country_or_region" => "%{data.location.countryCode}"
      }
      on_error => "country_notfound"
    }
  }
  if [location][province] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.state" => "%{location.province}"
      }
      on_error => "province_notfound"
    }
  }
  else if [data][location][province] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.state" => "%{data.location.province}"
      }
      on_error => "province_notfound"
    }
  }
  if [location][postalCode] != "" {
    mutate {
      replace => {
        "postal_code_label.value.string_value" => "%{location.postalCode}"
      }
      on_error => "no_postal_code"
    }
    if ![no_postal_code] {
      mutate {
        replace => {
          "postal_code_label.key" => "Postal code"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "postal_code_label"
        }
        on_error => "postal_code_not_present"
      }
    }
  }
  if [port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.port" => "%{port}"
      }
      on_error => "port_notfound"
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.principal.port" => "integer"
      }
      on_error => "already_integer"
    }
  }
  if [perspectiveId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.group.product_object_id" => "%{perspectiveId}"
      }
    on_error => "perspectiveId_notfound"
    }
  }
  if [serviceName] in ["HTTP","HTTPS"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "%{serviceName}"
      }
      on_error => "application_protocol_error"
    }
  }
  if [isSeed] != "" {
    mutate{
      convert => {
        "isSeed" => "string"
      }
      on_error => "conversion_failed_4"
    }
    mutate {
      replace => {
        "isSeed_label.key" => "isSeed"
        "isSeed_label.value.string_value" => "%{isSeed}"
      }
      on_error => "isSeed_value_invalid"
    }
    if ![isSeed_value_invalid] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "isSeed_label"
        }
        on_error => "isSeed_label_merge_failed"
      }
    }
  }
  if [autonomousSystem][asn] != "" {
    mutate{
      convert => {
        "autonomousSystem.asn" => "string"
      }
      on_error = "string_conversion_failed"
    }
    if [autonomousSystem][bgpPrefix] != "" {
      grok {
        match => {
          "bgpPrefix" => ["%{IP:client_ip}:%{NUMBER:client_port}"]
        }
        overwrite => [ "client_ip","client_port"]
        on_error => "grok_pattern_failure_1"
      }
    }
    mutate {
      replace => {
        "autonomousSystem_asn.key" => "autonomousSystem_asn"
        "autonomousSystem_asn.value.string_value" => "%{autonomousSystem.asn}"
      }
      on_error => "autonomousSystem_asn_invalid"
    }
    if [autonomousSystem_asn_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "autonomousSystem_asn"
        }
        on_error => "autonomousSystem_asn_not_found"
      }
    }
    if [autonomousSystem][bgpPrefix] != "" {
      mutate {
        replace => {
          "autonomousSystem_bgpPrefix.key" => "autonomousSystem_bgpPrefix"
          "autonomousSystem_bgpPrefix.value.string_value" => "%{autonomousSystem.bgpPrefix}"
        }
        on_error => "no_autonmoussystem_bgpprefix"
      }
    }
    if ![no_autonmoussystem_bgpprefix] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "autonomousSystem_bgpPrefix"
        }
        on_error => "autonomousSystem_bgpPrefix_not_found"
      }
    }
  }
  if [cloud] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.vendor_name" => "%{cloud}"
      }
      on_error => "no_vendor_name"
    }
  }
  if [transportFingerprint][raw] != "" {
    mutate {
      replace => {
        "transportFingerprint_raw.key" => "transportFingerprint_raw"
        "transportFingerprint_raw.value.string_value" => "%{transportFingerprint.raw}"
      }
      on_error => "no_transport_fingerprint"
    }
    if ![no_transport_fingerprint] != "" {
      mutate {
        merge => {
        "event.idm.read_only_udm.additional.fields" => "transportFingerprint_raw"
        }
        on_error => "transportFingerprint_raw_not_found"
      }
    }
  }
  for header in http.request.headers {
    mutate {
      replace => {
        "header_map_label" => ""
      }
    }
    if [header][key] =~ "User-Agent" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.http.user_agent" => "%{header.value.headers.0}"
        }
        on_error => "user_agent_value_invalid"
      }
      mutate {
        convert => {
          "header.value.headers.0" => "parseduseragent"
        }
        on_error => "conversion_failed"
      }
      mutate {
        rename => {
          "header.value.headers.0" => "event.idm.read_only_udm.network.http.parsed_user_agent"
        }
        on_error => "renaming_failed"
      }
    }
    else {
      mutate {
        replace => {
          "header_map_label.key" => "%{header.key}"
          "header_map_label.value" => "%{header.value.headers.0}"
        }
        on_error => "header_value_invalid"
      }
      if ![header_value_invalid] {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.resource.attribute.labels" => "header_map_label"
          }
          on_error => "header_map_label_merge_failed"
        }
      }
    }
  }
  for header in http.response.headers {
    mutate {
      replace => {
        "header_map_label" => ""
      }
    }
    if [header][key] =~ "Server" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "%{header.value.headers.0}"
        }
        on_error => "user_agent_value_invalid"
      }
      mutate {
        replace => {
          "has_target_machine" => "true"
        }
      }
    }
    else {
      mutate {
        replace => {
          "header_map_label.key" => "%{header.key}"
          "header_map_label.value" => "%{header.value.headers.0}"
        }
        on_error => "header_response_value_invalid"
      }
      if ![header_response_value_invalid] {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.resource.attribute.labels" => "header_map_label"
          }
          on_error => "header_response_map_label_merge_failed"
        }
      }
    }
  }
  if [http][response][statusCode] != "" {
    mutate {
      convert => {
        "http.response.statusCode" => "string"
      }
      on_error ="string_conversion_failedt"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.response_code" => "%{http.response.statusCode}"
      }
      convert => {
        "event.idm.read_only_udm.network.http.response_code" => "integer"
      }
      on_error => "status_code_not_found"
    }
  }
  for index, protocol in data.protocols {
    mutate {
      convert => {
        "index" => "string"
      }
      on_error => "index_already_string"
    }
    mutate {
      replace => {
        "protocol_value_label" => ""
        "transportProtocol_label" =>""
        "protocol_port_label" => ""
      }
      on_error => "no_protocol_transportprotocol"
    }
    mutate {
      replace => {
        "transportProtocol_label.key" => "data_protocols %{index}"
        "transportProtocol_label.value" => "%{protocol.transportProtocol}"
      }
      on_error => "transportProtocol_value_invalid"
    }
    if ![transportProtocol_value_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.resource.attribute.labels" => "transportProtocol_label"
        }
        on_error => "transportProtocol_label_merge_failed"
      }
    }
    mutate {
      uppercase => ["protocol.transportProtocol"]
    }
    mutate {
      replace => {
        "data_ip_protocol" => "%{protocol.transportProtocol}"
      }
      on_error => "protocol_assign_error"
    }
    if [data_ip_protocol] in ["TCP","EIGRP","ESP","ETHERIP","GRE","ICMP","IGMP","IP6IN4","PIM","UDP","VRRP"] {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.ip_protocol" => "%{data_ip_protocol}"
        }
        on_error => "ip_protocol_error1"
      }
    }
  }
  if [sourceIp] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "sourceIp"
        "event.idm.read_only_udm.principal.asset.ip" => "sourceIp"
      }
      on_error => "no_sourceIp"
    }
    mutate {
      replace => {
        "has_princ_machine_id" => "true"
      }
    }
  }
  if [data][cve] != "" {
    mutate {
      replace => {
        "data_cve.key" => "data_cve"
        "data_cve.value.string_value" => "%{data_cve}"
      }
      on_error => "no_data_cve"
    }
    if ![no_data_cve] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "data_cve"
        }
        on_error => "data_cve_not_found"
      }
    }
  }
  if [comments][refUrl] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.referral_url" => "%{comments.refUrl}"
      }
      on_error => "no_comments"
    }
  }
  if [data][cvss] != "" {
    mutate {
      replace => {
        "data_cvss.key" => "data_cvss"
        "data_cvss.value.string_value" => "%{data_cvss}"
      }
      on_error => "no_data_cvss"
    }
    if ![no_data_cvss] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "data_cvss"
        }
        on_error => "data_cvss_not_found"
      }
    }
  }
  for mailServer in data.mailServers {
    mutate {
      replace => {
        "value_array" => ""
      }
    }
    mutate {
      replace => {
        "value_array.string_value" => "%{mailServer}"
      }
      on_error => "additional_mailServer_empty"
    }
    mutate {
      merge => {
        "additional_mailServer.value.list_value.values" => "value_array"
      }
      on_error => "additional_mailServer_not_found"
    }
  }
  if [data][mailServers] != "" {
    mutate {
      replace => {
        "additional_mailServer.key" => "Mail Servers"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_mailServer"
      }
      on_error => "additional_mailServer_field_not_found"
    }
  }
  for nameServer in data.nameServers {
    mutate {
      replace => {
        "value_array" => ""
      }
    }
    mutate {
      replace => {
        "value_array.string_value" => "%{nameServer}"
      }
      on_error => "additional_nameServer_empty"
    }
    mutate {
      merge => {
        "additional_nameServer.value.list_value.values" => "value_array"
      }
      on_error => "additional_nameServer_not_found"
    }
  }
  if [data][nameServers] != "" {
    mutate {
      replace => {
        "additional_nameServer.key" => "Name nameServers"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_nameServer"
      }
      on_error => "additional_nameServer_field_not_found"
    }
  }
  if ([has_princ_machine_id] == "true") and ([has_target_machine] == "true")  and ([has_network_flow] == "false") {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_network_flow] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DNS"
        "event.idm.read_only_udm.network.application_protocol" => "DNS"
      }
    }
  }
  else if [has_princ_machine_id] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else  {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
