# Product: Cyber 2.0 IDS
# Category: IDS
# Supported Format: SYSLOG+JSON
# Reference: N/A
# Last Updated: 2025-09-04
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "event" => ""
      "principal" => ""
      "target" => ""
      "intermediary" => ""
      "network" => ""
      "security_result" => ""
      "additional" => ""
      "metadata" => ""
      "has_principal" => "false"
      "has_user" => "false"
      "has_target" => "false"
      "timestamp" => ""
      "inter_host" => ""
      "pid" => ""
      "severity" => ""
      "json_data" => ""
      "StartTime" => ""
      "Protocol" => ""
      "Direction" => ""
      "Source" => ""
      "Destination" => ""
      "SourceIP" => ""
      "DestinationIP" => ""
      "MACAddress" => ""
      "HostName" => ""
      "UserName" => ""
      "State" => ""
      "Status" => ""
      "ColorInState" => ""
      "IsColorInStatusRed" => ""
      "IsColorInStatusGreen" => ""
      "ApplicationName" => ""
      "FullPath" => ""
      "IsXCast" => ""
      "FlowHandle" => ""
      "FlowState" => ""
      "DLLMode" => ""
      "ClientZValue" => ""
      "SeqNumber" => ""
      "SubSeqNumber" => ""
      "description" => ""
      "src_application" => ""
      "time" => ""
      "hostname" => ""
      "kv_data" => ""
      "DB" => ""
      "prod_event_type" => ""
      "Apps" => ""
      "Groups" => ""
      "app_version" => ""
      "about" => ""
      "time1" => ""
      "monthnum" => ""
      "day" => ""
      "time2" => ""
    }
  }
  mutate {
    gsub => ["message","ינו׳","01"]
  }
  mutate {
    gsub => ["message","פבר׳","02"]
  }
  mutate {
    gsub => ["message","מרץ","03"]
  }
  mutate {
    gsub => ["message","אפר׳","04"]
  }
  mutate {
    gsub => ["message","מאי","05"]
  }
  mutate {
    gsub => ["message","יוני","06"]
  }
  mutate {
    gsub => ["message","יולי","07"]
  }
  mutate {
    gsub => ["message","אוג׳","08"]
  }
  mutate {
    gsub => ["message","ספט׳","09"]
  }
  mutate {
    gsub => ["message","אוק׳","10"]
  }
  mutate {
    gsub => ["message","נוב׳","11"]
  }
  mutate {
    gsub => ["message","דצמ׳","12"]
  }

  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP} %{DATA:inter_host} %{DATA:src_application}\\[%{INT:pid}\\] %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{INT} %{WORD:severity} (?<json_data>\\{%{GREEDYDATA}\\})%{GREEDYDATA}",
        "<%{INT}>%{SYSLOGTIMESTAMP} %{DATA:inter_host} %{DATA:src_application}\\[%{INT:pid}\\] %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{INT} %{WORD:severity} (#%{INT}|%{GREEDYDATA:description})",
        "%{TIMESTAMP_ISO8601:timestamp} %{DATA} %{INT} %{WORD:severity} (?<json_data>\\{%{GREEDYDATA}\\})%{GREEDYDATA}",
        "%{TIMESTAMP_ISO8601:timestamp} %{DATA} %{INT} %{WORD:severity}%{GREEDYDATA}",
        "<%{INT}>(%{MONTHNUM:monthnum} %{MONTHDAY:day} %{TIME:time2}|%{DATA:time}) ((?P<inter_host>CYBER2022)|%{DATA:inter_host}) %{DATA:prod_event_type}: %{DATA:description} Version=%{DATA:app_version} Time=%{TIMESTAMP_ISO8601:time1}",
        "<%{INT}>(%{MONTHNUM:monthnum} %{MONTHDAY:day} %{TIME:time2}|%{DATA:time}) ((?P<inter_host>CYBER2022)|%{DATA:inter_host}) %{DATA:prod_event_type}:(\\s+)?%{GREEDYDATA:kv_data}",
        "%{GREEDYDATA}"
      ]
    }
    overwrite => ["inter_host","pid","timestamp","severity","json_data","description","src_application","time","kv_data","prod_event_type","app_version","time1","monthnum","day","time2"]
    on_error => "grok_failed"
  }

  mutate {
    gsub => ["kv_data", " (\\\w+?)=","#$1="]
  }
  kv {
    source => "kv_data"
    field_split => "#"
    value_split => "="
    on_error => "invalid_kv_data"
  }
  if [time1] != "" {
    mutate {
      gsub => ["time1", "Z", ""]
    }
    date {
      match => ["time1", "ISO8601","yyyy-MM-dd HH:mm:ss"]
      target => "metadata.event_timestamp"
      on_error => "time1_not_parsed"
    }
  }
  else if [monthnum] != "" and [day] != "" and [time2] != "" {
    mutate {
      replace => {
        "time" => "%{monthnum} %{day} %{time2}"
      }
      on_error => "no_time"
    }
    date {
      match => ["time", "MM dd HH:mm:ss"]
      target => "metadata.event_timestamp"
      rebase => true
      on_error => "time_failed_1"
    }
  }
  else if [time] != "" {
    date {
      match => ["time", "MM dd HH:mm:ss"]
      target => "metadata.event_timestamp"
      rebase => true
      on_error => "time_failed_2"
    }
  }
  if [app_version] != "" {
    mutate {
      replace => {
        "app_version_label.value" => "%{app_version}"
      }
      on_error => "no_app_version_value_replaced"
    }
    if ![no_app_version_value_replaced] {
      mutate {
        replace => {
          "app_version_label.key" => "AppVersion"
        }
      }
      mutate {
        merge => {
          "about.resource.attribute.labels" => "app_version_label"
        }
        on_error => "no_app_version_label_not_merged"
      }
    }
  }
  if [prod_event_type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{prod_event_type}"
      }
      on_error => "no_prod_event_type"
    }
  }
  if [Groups] != "" {
    mutate {
      replace => {
        "principal.group.group_display_name" => "%{Groups}"
      }
      on_error => "no_groups"
    }
  }
  if [Apps] != "" {
    grok {
      match => {
        "Apps" => ["\\[%{GREEDYDATA:Apps}\\]"]
      }
      overwrite => ["Apps"]
      on_error => "grok_failed_apps"
    }
    mutate {
      split => {
        source => "Apps"
        separator => ";"
        target => "temp_arrays"
        on_error => "no_temp_arrays_split"
      }
    }
    for index, item in temp_arrays {
      mutate {
        convert => {
          "index" => "string"
        }
        on_error => "no_index"
      }
      mutate {
        replace => {
          "app_name" => ""
          "app_version" => ""
          "hostname" => ""
          "principal_ip" => ""
          "md5_value" => ""
          "about1" => ""
          "md5_label" => ""
          "app_version_label" => ""
          "hostname_label" => ""
        }
      }
      grok {
        match => {
          "item" => [
            "(\\s+)?%{DATA:app_name}\\|%{DATA:app_version}\\|%{DATA:hostname}\\|%{IP:principal_ip}\\|MD5:%{DATA:md5_value}$"
          ]
        }
        overwrite => ["app_name","app_version","hostname","principal_ip","md5_value"]
        on_error => "grok_failed_apps"
      }
      if [app_name] != "" {
        mutate {
          replace => {
            "about1.application" => "%{app_name}"
          }
          on_error => "no_app_name"
        }
      }
      if [app_version] != "" {
        mutate {
          replace => {
            "app_version_label.value" => "%{app_version}"
          }
          on_error => "no_app_version_value"
        }
        if ![no_app_version_value] {
          mutate {
            replace => {
              "app_version_label.key" => "AppVersion"
            }
          }
          mutate {
            merge => {
              "about1.resource.attribute.labels" => "app_version_label"
            }
            on_error => "no_app_version_label"
          }
        }
      }
      if [index] == "0" and [hostname] != "" {
        mutate {
          replace => {
            "principal.hostname" => "%{hostname}"
            "principal.asset.hostname" => "%{hostname}"
            "has_principal" => "true"
          }
          on_error => "no_host_name"
        }
      }
      else if [hostname] != "" {
        mutate {
          replace => {
            "hostname_label.value" => "%{hostname}"
          }
          on_error => "no_hostname_value"
        }
        if ![no_hostname_value] {
          mutate {
            replace => {
              "hostname_label.key" => "computer_name_%{index}"
            }
          }
          mutate {
            merge => {
              "principal.resource.attribute.labels" => "hostname_label"
            }
            on_error => "no_hostname_label"
          }
        }
      }
      if [principal_ip] != "" {
        mutate {
          merge => {
            "principal.ip" => "principal_ip"
            "principal.asset.ip" => "principal_ip"
          }
          on_error => "no_prin_ip_merge"
        }
        if ![no_prin_ip_merge] {
          mutate {
            replace => {
              "has_principal" => "true"
            }
          }
        }
      }
      mutate {
        lowercase => ["md5_value"]
        on_error => "no_md5_value_lowercase"
      }
      if [md5_value] != "" and [md5_value] =~ "^[0-9a-f]+$" {
        mutate {
          replace => {
            "about1.file.md5" => "%{md5_value}"
          }
          on_error => "no_md5_value"
        }
      }
      else if [md5_value] != "" {
        mutate {
          replace => {
            "md5_label.value" => "%{md5_value}"
          }
          on_error => "no_md5_value"
        }
        if ![no_md5_value] {
          mutate {
            replace => {
              "md5_label.key" => "MD5"
            }
          }
          mutate {
            merge => {
              "about1.resource.attribute.labels" => "md5_label"
            }
            on_error => "no_md5_label"
          }
        }
      }
      if [about1] != "" {
        mutate {
          merge => {
            "event.idm.read_only_udm.about" => "about1"
          }
          on_error => "no_about1"
        }
      }
    }
  }

  if [json_data] != "" {
    json {
      source => "json_data"
      array_function => "split_columns"
      on_error => "invalid_json"
    }
  }

  if [inter_host] != "" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{inter_host}"
      }
      on_error => "no_inter_host"
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{description}"
      }
      on_error => "no_description"
    }
  }

  if [Protocol] in ["EIGRP","ESP","ETHERIP","GRE","ICMP","IGMP","IP6IN4","PIM","TCP","UDP","VRRP"] {
    mutate {
      replace => {
        "network.ip_protocol" => "%{Protocol}"
      }
      on_error => "no_protocol"
    }
  }

  if [Direction] == "Inbound" {
    mutate {
      replace => {
        "network.direction" => "INBOUND"
      }
    }
  }
  else if [Direction] == "Outbound" {
    mutate {
      replace => {
        "network.direction" => "OUTBOUND"
      }
    }
  }

  if [Source] != "" {
    mutate {
      convert => {
        "Source" => "integer"
      }
      on_error => "no_source"
    }
    mutate {
      rename => {
        "Source" => "principal.port"
      }
    }
  }

  if [Destination] != "" {
    mutate {
      convert => {
        "Destination" => "integer"
      }
      on_error => "no_destination"
    }
    mutate {
      rename => {
        "Destination" => "target.port"
      }
    }
  }

  if [SourceIP] != "" {
    mutate {
      merge => {
        "principal.ip" => "SourceIP"
        "principal.asset.ip" => "SourceIP"
      }
      on_error => "no_source_ip"
    }
    if ![no_source_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [DestinationIP] != "" {
    mutate {
      merge => {
        "target.ip" => "DestinationIP"
        "target.asset.ip" => "DestinationIP"
      }
      on_error => "no_destination_ip"
    }
    if ![no_destination_ip] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }


  if [HostName] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{HostName}"
        "principal.asset.hostname" => "%{HostName}"
        "has_principal" => "true"
      }
      on_error => "no_host_name"
    }
  }

  if [ApplicationName] != "" {
    mutate {
      replace => {
        "target.application" => "%{ApplicationName}"
      }
      on_error => "no_application_name"
    }
  }

  if [UserName] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{UserName}"
        "has_user" => "true"
      }
      on_error => "no_user_name"
    }
  }

  if [FullPath] != "" {
    mutate {
      replace => {
        "target.file.full_path" => "%{FullPath}"
      }
      on_error => "no_full_path"
    }
  }


  if [Status] == "OK" {
    mutate {
      replace => {
        "action" => "ALLOW"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "action"
      }
      on_error => "no_action"
    }
  }

  if [pid] != "" {
    mutate {
      replace => {
        "principal.process.pid" => "%{pid}"
      }
      on_error => "no_full_path"
    }
  }

  if [src_application] != "" {
    mutate {
      replace => {
        "principal.application" => "%{src_application}"
      }
      on_error => "no_src_application"
    }
  }

  if [SubSeqNumber] != "" {
    mutate {
      convert => {
        "SubSeqNumber" => "string"
      }
      on_error => "no_sub_seq_number"
    }
    mutate {
      replace => {
        "SubSeqNumber_label.value" => "%{SubSeqNumber}"
        "SubSeqNumber_label.key" => "SubSeqNumber"
      }
      on_error => "no_sub_seq_number"
    }
    if ![no_sub_seq_number] {
      mutate {
        merge => {
          "security_result.detection_fields" => "SubSeqNumber_label"
        }
        on_error => "no_sub_seq_number_label"
      }
    }
  }

  if [severity] == "Critical" {
    mutate {
      replace => {
        "security_result.severity" => "CRITICAL"
      }
    }
  }
  else if [severity] == "Info" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  }

  mutate {
    rename => {
      # additional fields
      "DB" => "addition.DB"
      "NewApps" => "addition.NewApps"
      "UniqueApps" => "addition.UniqueApps"
      "Computers" => "addition.Computers"
      "Duration" => "addition.Duration"
      # detection fields
      "DLLMode" => "addition.DLLMode"
      "FlowHandle" => "addition.FlowHandle"
      "ClientZValue" => "addition.ClientZValue"
      "MACAddress" => "addition.MACAddress"
      "State" => "addition.State"
      "IsXCast" => "addition.IsXCast"
      "FlowState" => "addition.FlowState"
    }
  }
  for key, value in addition map {
    mutate {
      replace => {
        "check" => ""
        "field1" => ""
      }
    }
    mutate {
      replace => {
        "check" => "%{value}"
      }
      on_error => "check_failed"
    }
    if ![check_failed] and [check] != "" {
      mutate {
        replace => {
          "field1.key" => "%{key}"
        }
        on_error => "no_key"
      }
      if [key] in ["FlowHandle","ClientZValue","MACAddress","State","IsXCast","FlowState","DLLMode"] {
        mutate {
          replace => {
            "field1.value" => "%{value}"
          }
          on_error => "no_value"
        }
        mutate {
          merge => {
            "security_result.detection_fields" => "field1"
          }
          on_error => "no_detection_fields"
        }
      }
      else {
        mutate {
          replace => {
            "field1.value.string_value" => "%{value}"
          }
          on_error => "no_value_2"
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "field1"
          }
          on_error => "no_additional_fields"
        }
      }
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "Cyber 2.0"
      "metadata.product_name" => "Cyber 2.0 IDS"
      "metadata.event_type" => "GENERIC_EVENT"
    }
  }

  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
      on_error => "no_intermediary"
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  if [about] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.about" => "about"
      }
      on_error => "no_about"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
