# Product: HCNET_ACCOUNT_ADAPTER
# Category: DHCP
# Supported Format: SYSLOG
# Reference: https://docs.cyderes.cloud/parser-knowledge-base/hcnet_account_adapter/
# Last Updated:  2024-11-04
# Copyright 2022 Chronicle LLC

filter {
  mutate {
    replace => {
      "observer_host" => ""
      "app" => ""
      "principal_ip" => ""
      "client_mac" => ""
      "client_host" => ""
      "desc" => ""
      "intermediary_ip" => ""
      "dhcp_type" => ""
      "security_result" => ""
      "metadata.event_type" => "GENERIC_EVENT"
      "metadata.vendor_name" => "HCNET"
      "metadata.product_name" => "Account Adapter Plus"
      "date" => ""
      "datetime" => ""
    }
  }
  grok {
    match => {
      "message" => [
                    "%{SYSLOGTIMESTAMP:date} %{HOSTNAME:observer_host} %{DATA:app}: (?P<dhcp_type>DHCPACK) on %{IP:principal_ip} to %{MAC:client_mac} \\(%{HOSTNAME:client_host}\\) via %{DATA:interface}",
                    "%{SYSLOGTIMESTAMP:datetime} %{GREEDYDATA:hostname1} %{WORD:application}\\: %{DATA:dhcp_type} to %{IP:principal_ip} \\(%{MAC:client_mac}\\)",
                    "%{SYSLOGTIMESTAMP:datetime} %{GREEDYDATA:hostname1} %{WORD:application}\\: %{DATA:dhcp_type} from %{MAC:client_mac} %{DATA}: %{GREEDYDATA:desc}",
                    "%{SYSLOGTIMESTAMP:date} %{HOSTNAME:observer_host} %{DATA:app}: (?P<dhcp_type>DHCPREQUEST) for %{IP:principal_ip} from %{MAC:client_mac} \\(%{HOSTNAME:client_host}\\) via %{IP:intermediary_ip}",
                    "%{SYSLOGTIMESTAMP:date} %{HOSTNAME:observer_host} %{DATA:app}: (?P<dhcp_type>DHCPOFFER) on %{IP:principal_ip} to %{MAC:client_mac} \\(%{HOSTNAME:client_host}\\) via %{IP:intermediary_ip}",
                    "%{SYSLOGTIMESTAMP:date} %{HOSTNAME:observer_host} %{DATA:app}: %{GREEDYDATA:desc}",
                    "%{SYSLOGTIMESTAMP:date} %{HOSTNAME:observer_name} %{DATA:app}: (?P<dhcp_type>DHCPACK) on %{IP:Principal_IP} to %{MAC:mac_address} \\(%{HOSTNAME:client_host}\\) via %{IP:Intermediary_IP}"
                   ]
    }
    overwrite => ["date","datetime","observer_host", "app", "dhcp_type", "principal_ip", "client_mac", "client_host", "desc", "intermediary_ip"]
    on_error => "grok_fail"
  }
  if [date] != "" {
    date {
      match => ["date", "MMM  dd HH:mm:ss", "MMM d HH:mm:ss"]
      rebase => true
      on_error => "date_fail"
    }
  }
  else if [datetime] != "" {
    date {
      match => ["datetime", "MMM  dd HH:mm:ss", "MMM d HH:mm:ss"]
      rebase => true
      on_error => "date_fail"
    }
  }
  if [observer_host] != "" {
    mutate {
      replace => {
        "observer.hostname" => "%{observer_host}"
      }
    }
  }

  if [client_host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{client_host}"
      }
    }
    mutate {
      replace => {
        "network.dhcp.client_hostname" => "%{client_host}"
      }
    }
  }

  if [app] != "" {
    mutate {
      replace => {
        "principal.application" => "%{app}"
      }
    }
  }

  if [principal_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "principal_ip"
      }
    }
    mutate {
      replace => {
        "network.dhcp.yiaddr" => "%{principal_ip}"
      }
    }
  }

  if [intermediary_ip] != "" {
    mutate {
      replace => {
        "network.dhcp.giaddr" => "%{intermediary_ip}"
      }
    }
  }

  if [client_mac] != "" {
    mutate {
      merge => {
        "principal.mac" => "client_mac"
      }
    }
    mutate {
      replace => {
        "network.dhcp.chaddr" => "%{client_mac}"
      }
    }
  }

  if [desc] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{desc}"
      }
    }
  }

  if [desc] != "" and [app] =~ "radiusd" {
    mutate {
      replace => {
        "action" => ""
      }
    }
    grok {
      match => {
        "desc" => "%{INT:pid}\\)[\\s]+%{DATA:action_detail}\\: \\[%{HOSTNAME:user_id}\\] %{DATA} client %{DATA:src_name}\\[%{IP:src_ip}%{DATA} port %{INT:src_port}"
      }
      on_error => "grok_fail1"
    }

    if [desc] =~ "ERROR" {
      mutate {
        replace => {
          "action" => "FAIL"
        }
      }
    }

    if ![grok_fail1] {
      mutate {
        replace => {
          "principal.process.pid" => "%{pid}"
          "target.user.userid" => "%{user_id}"
          "principal.user.user_display_name" => "%{src_name}"
        }
      }

      mutate {
        replace => {
          "principal.port" => "%{src_port}"
        }
      }
      mutate{
        convert => {
          "principal.port" => "integer"
        }
      }

      mutate {
        merge => {
          "principal.ip" => "src_ip"
        }
      }

      if [action_detail] =~ "Login OK" {
        mutate {
          replace => {
            "action" => "ALLOW"
            "security_result.action_details" => "%{action_detail}"
          }
        }
        mutate {
          replace => {
            "extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
            "metadata.event_type" => "USER_LOGIN"
          }
        }
      }
    }
    if [action] != "" {
      mutate {
        merge => {
          "security_result.action" => "action"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
      }
    }
  }



  if [dhcp_type] != "" {
    if [dhcp_type] == "DHCPACK" {
      mutate {
        replace => {
          "network.dhcp.type" => "ACK"
          "network.dhcp.opcode" => "BOOTREPLY"
        }
      }
    }
    if [dhcp_type] == "DHCPDISCOVER" {
      mutate {
        replace => {
          "network.dhcp.type" => "DISCOVER"
          "network.dhcp.opcode" => "BOOTREQUEST"
        }
      }
    }
    if [dhcp_type] == "DHCPREQUEST" {
      mutate {
        replace => {
          "network.dhcp.type" => "REQUEST"
          "network.dhcp.opcode" => "BOOTREQUEST"
        }
      }
    }
    if [dhcp_type] == "DHCPOFFER" {
      mutate {
        replace => {
          "network.dhcp.type" => "OFFER"
          "network.dhcp.opcode" => "BOOTREPLY"
        }
      }
    }
  }

  if [dhcp_type] in ["DHCPOFFER", "DHCPDISCOVER", "DHCPACK"] {
    mutate {
      replace => {
        "network.application_protocol" => "DHCP"
        "metadata.event_type" => "NETWORK_DHCP"
      }
    }
  }
  else if [dhcp_type] == "DHCPREQUEST" {
    mutate {
      replace => {
        "network.application_protocol" => "DHCP"
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }

  mutate {
    rename => {
      "metadata" => "event.idm.read_only_udm.metadata"
      "principal" => "event.idm.read_only_udm.principal"
      "target" => "event.idm.read_only_udm.target"
      "observer" => "event.idm.read_only_udm.observer"
      "network" => "event.idm.read_only_udm.network"
      "extensions" => "event.idm.read_only_udm.extensions"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
