# Product: AWS_ECS_METRICS
# Category:Security
# Supported Format: SYSLOG + KV
# Last Updated:2025-02-06
# Copyright 2025 Google SecOps
filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "security_result" => ""
      "extensions" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "user_login" => "false"
      "user_logout" => "false"
      "cluster_rtt_ClusterId" => ""
      "cluster_rtt_description" => ""
      "hostname" => ""
      "port" => ""
      "severity" => ""
      "msg" => ""
      "kv_data" => ""
      "kv_data1" => ""
      "source" => ""
      "url" => ""
      "description" => ""
      "principal_ip" => ""
      "action" => ""
      "principal_port" => ""
      "target_port" => ""
      "timestamp" => ""
      "Time" => ""
      "request_ID" => ""
      "connectionID_localvalue" => ""
      "connectionID_serverValue" => ""
      "compressed" => ""
      "sent_bytes" => ""
      "connection" => ""
    }
  }
  grok {
    match => {
      "message" => [
        "%{TIMESTAMP_ISO8601:Time}\\s+\\[%{DATA}='%{DATA:cluster_rtt_ClusterId}\\',\\s+description=\\'%{DATA:cluster_rtt_description}\\'\\}\\-%{DATA:hostname}:%{INT:principal_port}\\]\\s+%{DATA:severity}\\s+%{DATA}\\:\\s+%{GREEDYDATA:msg}\\[%{GREEDYDATA:kv_data}\\]",
        "%{TIMESTAMP_ISO8601:Time}\\s+%{DATA:severity}\\s+%{DATA}:\\s+%{DATA:source}:\\s+%{DATA}:\\s+%{DATA:url}\\s+%{DATA}:\\s+%{DATA}\\(%{GREEDYDATA:kv_data}\\)\\s+\\[%{GREEDYDATA:kv_data1}\\]",
        "%{TIMESTAMP_ISO8601:Time}\\s+%{DATA}\\|\\s+%{DATA}\\|\\s+%{DATA:severity}\\s+\\|%{GREEDYDATA}\\|\\s+%{GREEDYDATA:description}",
        "%{DATA:Time}\\s+%{INT}\\s+%{IP:principal_ip}\\s+%{DATA:action}\\/%{INT}\\s+%{INT:principal_port}\\s+%{DATA:connection}\\s+%{DATA:hostname}:%{INT:target_port}\\s+%{DATA}\\s+%{DATA}\\/%{IP:target_ip}\\s+%{GREEDYDATA}"
      ]
    }
    overwrite => ["Time","cluster_rtt_ClusterId", "cluster_rtt_description", "hostname","severity", "msg", "kv_data", "kv_data1", "source", "url", "description", "principal_ip", "action", "principal_port", "target_port", "target_ip", "connection"]
    on_error => "no_grok"
  }
  if [kv_data] != "" {
    kv {
      source => "kv_data"
      field_split => ", "
      value_split => "="
      on_error => "no_kv_data"
    }
  }
  if [kv_data1] != "" {
    kv {
      source => "kv_data1"
      field_split => ", "
      value_split => "="
      on_error => "no_kv_data1"
    }
  }
  if [msg] != "" {
    grok {
      match => {
        "msg" => [
          "%{DATA}\\s+%{INT:request_ID}\\s+%{DATA}\\[%{DATA}\\{%{DATA}:%{INT:connectionID_localvalue},%{DATA}:%{INT:connectionID_serverValue}\\}\\]\\s+%{GREEDYDATA}"
        ]
      }
      overwrite => ["request_ID", "connectionID_localvalue", "connectionID_serverValue"]
      on_error => "no_grok_msg"
    }
  }
  if [description] != "" {
    grok {
      match => {
        "description" => [
          "%{DATA}:\\s+%{INT:sent_bytes}\\/%{INT:compressed}\\s+bytes."
        ]
      }
      overwrite => ["sent_bytes", "compressed"]
      on_error => "no_grok_description"
    }
  }
  if [Time] != "" {
    date {
      match => ["Time","RFC3339","ISO8601", "yyyy-MM-dd HH:mm:ss", "yyyy-MM-dd HH:mm:ss.SSS", "UNIX", "UNIX_MS"]
      on_error =>"no_created_timestamp"
    }
  }
  if [cluster_rtt_ClusterId] != "" {
    mutate {
      replace => {
        "cluster_rtt_ClusterId_label.key" => "cluster_rtt_ClusterId"
        "cluster_rtt_ClusterId_label.value.string_value" => "%{cluster_rtt_ClusterId}"
      }
      on_error => "no_cluster_rtt_ClusterId"
    }
    if ![no_cluster_rtt_ClusterId] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "cluster_rtt_ClusterId_label"
        }
        on_error => "no_cluster_rtt_ClusterId"
      }
    }
  }
  if [cluster_rtt_description] not in ["null", "0", ""] {
    mutate {
      replace => {
        "cluster_rtt_description_label.key" => "cluster_rtt_description"
        "cluster_rtt_description_label.value.string_value" => "%{cluster_rtt_description}"
      }
      on_error => "no_cluster_rtt_description"
    }
    if ![no_cluster_rtt_description] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "cluster_rtt_description_label"
        }
        on_error => "no_cluster_rtt_description"
      }
    }
  }
  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
        "principal.asset.hostname" => "%{hostname}"
      }
      on_error => "no_hostname"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
      on_error => "no_has_principal"
    }
  }
  if [connection] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{connection}"
      }
    }
  }
  if [principal_port] != "" {
    mutate {
      replace => {
        "principal.port" => "%{principal_port}"
      }
      on_error => "no_principal_port"
    }
    mutate {
      convert => {
        "principal.port" => "integer"
      }
      on_error => "no_principal_port"
    }
  }
  if [target_port] != "" {
    mutate {
      replace => {
        "target.port" => "%{target_port}"
      }
      on_error => "no_target_port"
    }
    mutate {
      convert => {
        "target.port" => "integer"
      }
      on_error => "no_target_port"
    }
  }
  if [source] != "" {
    mutate {
      replace => {
        "source_label.key" => "source"
        "source_label.value.string_value" => "%{source}"
      }
      on_error => "no_source"
    }
    if ![no_source] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "source_label"
        }
        on_error => "no_source"
      }
    }
  }
  if [url] != "" {
    mutate {
      replace => {
        "target.url" => "%{url}"
      }
      on_error => "no_url"
    }
  }
  if [principal_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "principal_ip"
        "principal.asset.ip" => "principal_ip"
      }
      on_error => "no_principal_ip"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
      on_error => "no_has_principal"
    }
  }
  if [action] != "" {
    if ([action] in ["TCP_DENIED", "TCP_MISS", "Denied", "denied", "Dropped", "ABORTED"]) {
      mutate {
        replace => {
          "action" => "BLOCK"
        }
        on_error => "no_action"
      }
    }
    else if ([action] in ["TCP_TUNNEL", "Accessed", "Built", "Retrieved", "Stored"]) {
      mutate {
          replace => {
            "action" => "ALLOW"
          }
          on_error => "no_action"
      }
    }
    else {
      mutate {
        replace => {
          "action" => "UNKNOWN_ACTION"
        }
        on_error => "no_action"
      }
    }
    if ![no_action]{
      mutate {
        merge => {
          "security_result.action" => "action"
        }
        on_error => "no_action"
      }
    }
  }
  if [severity] != "" {
    if [severity] == "CRITICAL" {
      mutate {
        replace => {
          "security_result.severity" => "CRITICAL"
        }
        on_error => "no_severity"
      }
    }
    else if [severity] == "ERROR" {
      mutate {
        replace => {
          "security_result.severity" => "ERROR"
        }
        on_error => "no_severity"
      }
    }
    else if [severity] in ["ALERT", "EMERGENCY"] {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
        on_error => "no_severity"
      }
    }
    else if [severity] in ["INFO", "NOTICE"] {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
        on_error => "no_severity"
      }
    }
    else if [severity] == "DEBUG" {
      mutate {
        replace => {
          "security_result.severity" => "LOW"
        }
      }
    }
    else if [severity] == "WARNING" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    else {
      mutate {
        replace => {
          "security_result.severity" => "UNKNOWN_SEVERITY"
        }
      }
    }
  }
  if [request_ID] != "" {
    mutate {
      replace => {
        "request_id_label.key" => "request_ID"
        "request_id_label.value.string_value" => "%{request_ID}"
      }
      on_error => "no_request_ID"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "request_id_label"
      }
      on_error => "no_request_ID"
    }
  }
  if [connectionID_localvalue] != "" {
    mutate {
      replace => {
        "connectionID_localvalue_label.key" => "connectionID_localvalue"
        "connectionID_localvalue_label.value.string_value" => "%{connectionID_localvalue}"
      }
      on_error => "no_connectionID_localvalue"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "connectionID_localvalue_label"
      }
      on_error => "no_connectionID_localvalue"
    }
  }
  if [connectionID_serverValue] != "" {
    mutate {
      replace => {
        "connectionID_serverValue_label.key" => "connectionID_serverValue"
        "connectionID_serverValue_label.value.string_value" => "%{connectionID_serverValue}"
      }
      on_error => "no_connectionID_serverValue"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "connectionID_serverValue_label"
      }
      on_error => "no_connectionID_serverValue"
    }
  }
  if [compressed] != "" {
    mutate {
      replace => {
        "compressed_label.key" => "compressed"
        "compressed_label.value.string_value" => "%{compressed}"
      }
      on_error => "no_compressed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "compressed_label"
      }
      on_error => "no_compressed"
    }
  }
  if [sent_bytes] != "" {
    mutate {
      convert => {
        "sent_bytes" => "string"
      }
      on_error => "no_sent_bytes"
    }
    mutate {
      replace => {
        "network.sent_bytes" => "%{sent_bytes}"
      }
      on_error => "no_sent_bytes"
    }
    mutate {
      convert => {
        "network.sent_bytes" => "uinteger"
      }
      on_error => "no_sent_bytes"
    }
  }
  if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
