# Product: SOPHOS DHCP
# Category: DHCP
# Supported Format: SYSLOG + KV
# Reference: https://docs.sophos.com/nsg/sophos-firewall/17.5/PDF/SFOS_Logfile_Guide_17.5.pdf
# Last Updated: 2022-02-10
# Copyright 2022 Chronicle LLC

filter {
  mutate {
    replace => {
      "msg" => ""
      "msg2" => ""
      "id" => ""
      "sub" => ""
      "severity" => ""
      "action" => ""
      "name" => ""
      "call" => ""
      "fwrule" => ""
      "initf" => ""
      "outitf" => ""
      "proto" => ""
      "srcmac" => ""
      "dstmac" => ""
      "srcip" => ""
      "sid" => ""
      "user" => ""
      "client" => ""
      "objname" => ""
      "dstip" => ""
      "srcport" => ""
      "dstport" => ""
      "tcpflags" => ""
      "info" => ""
      "src_host" => ""
      "oldattr_address" => ""
      "oldattr_addresses" => ""
      "attr_address" => ""
      "attr_addresses" => ""
      "pid" => ""
      "process_type" => ""
      "dhcp_type" => ""
      "security_result" => ""
      "event_type" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "<%{INT}>(?P<log_date>%{YEAR}:%{MONTHNUM}:%{MONTHDAY}-%{HOUR}:%{MINUTE}:%{SECOND}) %{DATA} %{DATA:process_type}(?:\\[%{INT}\\]\\:|:) %{GREEDYDATA:msg}"
        "<%{INT}>(?P<log_date>%{YEAR}:%{MONTHNUM}:%{MONTHDAY}-%{HOUR}:%{MINUTE}:%{SECOND}) %{DATA} %{GREEDYDATA:msg}"
      ]
    }
    overwrite => ["process_type","msg"]
    on_error => "grok_fail"
  }
  if [process_type] in ["confd","ulogd"] {
    mutate {
      gsub => ["msg",'\"',""]
    }
    if [msg] =~ "call=new"{
      grok {
        match => {
          "msg" => "%{GREEDYDATA:msg}call=new<%{INT}>(?P<log_date_inner>%{MONTH}%{SPACE}%{MONTHDAY} %{HOUR}:%{MINUTE}:%{SECOND}) %{DATA:process_type}(?:\\[%{INT}\\]\\:|:) %{GREEDYDATA:msg2}"
        }
        overwrite => ["msg","msg2","process_type"]
      }
      mutate {
        gsub => ["msg2", "(\\w+)=", "#$1="]
      }
      kv {
        source => "msg2"
        field_split => "#"
        value_split => "="
      }
      if [severity] in ["info","debug"] {
        mutate {
          replace => {
            "sec_result.severity" => "INFORMATIONAL"
          }
        }
      } else if [severity] == "warn" {
        mutate {
          replace => {
            "sec_result.severity" => "MEDIUM"
          }
        }
      }
      if [id] != "" {
        mutate {
          replace => {
            "event1.idm.read_only_udm.metadata.product_event_type" => "ID - %{id}"
          }
        }
      }
      if [name] != "" {
        mutate {
          replace => {
            "sec_result.description" => "%{name}"
          }
        }
      }
      if [sub] != "" {
        mutate {
          replace => {
            "event1.idm.read_only_udm.metadata.description" => "%{sub}"
          }
        }
      }
      if [user] != "" {
        mutate {
          replace => {
            "event1.idm.read_only_udm.principal.user.userid" => "%{user}"
          }
        }
      }
      if [client] != "" {
        mutate {
          replace => {
            "event1.idm.read_only_udm.principal.hostname" => "%{client}"
          }
        }
      }
      if [srcip] != "" {
        mutate {
          merge => {
            "event1.idm.read_only_udm.principal.ip" => "srcip"
          }
        }
      }
      if [sec_result] != "" {
        mutate {
          merge => {
            "event1.idm.read_only_udm.security_result" => "sec_result"
          }
        }
      }
      date {
        match => ["log_date_inner","MMM dd HH:mm:ss","MMM  d HH:mm:ss"]
        rebase => true
      }
      mutate {
        replace => {
          "event1.idm.read_only_udm.metadata.product_name" => "SOPHOS_DHCP"
          "event1.idm.read_only_udm.metadata.vendor_name" => "SOPHOS"
          "event1.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        }
      }
      mutate {
        merge => {
          "@output" => "event1"
        }
      }
    }
    mutate {
      gsub => ["msg", "(\\w+)=", "#$1="]
    }
    kv {
      source => "msg"
      field_split => "#"
      value_split => "="
    }
    if [severity] in ["info","debug"] {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    } else if [severity] == "warn" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    if [id] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.product_event_type" => "%{process_type} - %{id}"
        }
      }
    }
    if [sub] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.description" => "%{sub}"
        }
      }
    }
    if [name] != "" {
      if [name] == "object changed" {
        mutate {
          replace => {
            "event_type" => "RESOURCE_WRITTEN"
          }
        }
      }
      mutate {
        replace => {
          "security_result.description" => "%{name}"
        }
      }
    }
    if [call] != "" {
      mutate {
        replace => {
          "security_result.summary" => "%{call}"
        }
      }
    }
    if [action] != "" {
      mutate {
        replace => {
          "security_result.action_details" => "%{action}"
        }
      }
      if [action] == "portscan" {
        mutate {
          replace => {
            "category" => "NETWORK_RECON"
          }
        }
        mutate {
          merge => {
            "security_result.category" => "category"
          }
        }
      }
    }
    if [fwrule] != "" {
      mutate {
        replace => {
          "security_result.rule_id" => "%{fwrule}"
        }
      }
    }
    if [initf] != "" {
      mutate {
        replace => {
         "initf_label.key" => "In Interface"
         "initf_label.value" => "%{initf}"
        }
      }
      mutate {
        merge => {
          "security_result.about.labels" => "initf_label"
        }
      }
    }
    if [outitf] != "" {
      mutate {
        replace => {
         "outitf_label.key" => "Out Interface"
         "outitf_label.value" => "%{outitf}"
        }
      }
      mutate {
        merge => {
          "security_result.about.labels" => "outitf_label"
        }
      }
    }
    if [tcpflags] != "" {
      mutate {
        replace => {
         "tcpflags_label.key" => "TCP Flags"
         "tcpflags_label.value" => "%{tcpflags}"
        }
      }
      mutate {
        merge => {
          "security_result.about.labels" => "tcpflags_label"
        }
      }
    }
    if [sid] != "" {
      mutate {
        replace => {
         "sid_label.key" => "sid"
         "sid_label.value" => "%{sid}"
        }
      }
      mutate {
        merge => {
          "security_result.about.labels" => "sid_label"
        }
      }
    }
    if [proto] != "" {
      mutate {
        replace => {
          "protocol_number_src" => "%{proto}"
        }
      }
      mutate {
        convert => {
          "protocol_number_src" => "integer"
        }
      }
      # This file contains the ip protocol convertor
# Document:
#   - https://www.iana.org/assignments/protocol-numbers/protocol-numbers.xhtml

# Interface:
# protocol_number_src (required): number with the value which represents the protocol
# ip_protocol_out: string that is either empty or contains ip protocol
#                  compatible to IpProtocol enum in udm.proto

mutate {
  replace => {
    "ip_protocol_out" => "UNKNOWN_IP_PROTOCOL"
  }
}


if [protocol_number_src] in [ 1, "ICMP", "ICMPV6", 58 ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ICMP"
    }
  }
} else if [protocol_number_src] in [ 2, "IGMP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "IGMP"
    }
  }
} else if [protocol_number_src] in [ 6, "TCP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "TCP"
    }
  }
} else if [protocol_number_src] in [ 17, "UDP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "UDP"
    }
  }
} else if [protocol_number_src] in [ 41, "IP6IN4" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "IP6IN4"
    }
  }
} else if [protocol_number_src] in [ 47, "GRE" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "GRE"
    }
  }
} else if [protocol_number_src] in [ 50, "ESP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ESP"
    }
  }
} else if [protocol_number_src] in [ 88, "EIGRP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "EIGRP"
    }
  }
}  else if [protocol_number_src] in [ 97, "ETHERIP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ETHERIP"
    }
  }
} else if [protocol_number_src] in [ 103, "PIM" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "PIM"
    }
  }
} else if [protocol_number_src] in [ 112, "VRRP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "VRRP"
    }
  }
}

      mutate {
        replace => {
          "event.idm.read_only_udm.network.ip_protocol" => "%{ip_protocol_out}"
        }
      }
    }
    if [info] != "" {
      mutate {
        replace => {
          "security_result.description" => "%{info}"
        }
      }
    }
    if [user] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{user}"
        }
      }
    }
    if [srcmac] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.mac" => "srcmac"
        }
      }
    }
    if [dstmac] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.mac" => "dstmac"
        }
      }
    }
    if [srcip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "srcip"
        }
      }
    }
    if [dstip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "dstip"
        }
      }
    }
    if [srcport] != "" {
      mutate {
        replace => {
         "event.idm.read_only_udm.principal.port" => "%{srcport}"
        }
        convert => {
          "event.idm.read_only_udm.principal.port" => "integer"
        }
      }
    }
    if [dstport] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.port" => "%{dstport}"
        }
        convert => {
          "event.idm.read_only_udm.target.port" => "integer"
        }
      }
    }
    if [oldattr_address] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "oldattr_address"
        }
      }
    }
    else if [oldattr_addresses] != "" {
      mutate {
        gsub => ["oldattr_addresses", "'", "\""]
      }
      mutate {
        gsub => ["oldattr_addresses", " ", "\",\""]
      }
      mutate {
        replace => {
          "oldattr_addresses" => "{\"oldattr_addresses\":%{oldattr_addresses}}"
        }
      }
      json {
        source   => "oldattr_addresses"
        array_function => "split_columns"
      }
      for ip in oldattr_addresses {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.ip" => "ip"
          }
        }
      }
    }
    if [attr_address] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "attr_address"
        }
      }
    }
    else if [attr_addresses] != "" {
      mutate {
        gsub => ["attr_addresses", "'", "\""]
      }
      mutate {
        gsub => ["attr_addresses", " ", "\",\""]
      }
      mutate {
        replace => {
          "attr_addresses" => "{\"attr_addresses\":%{attr_addresses}}"
        }
      }
      json {
        source   => "attr_addresses"
        array_function => "split_columns"
      }
      for ip in attr_addresses {
        mutate {
          merge => {
            "event.idm.read_only_udm.target.ip" => "ip"
          }
        }
      }
    }
    if [pid] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.pid" => "%{pid}"
        }
      }
    }
    if [objname] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.resource.name" => "%{objname}"
        }
      }
    }
    if [client] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{client}"
        }
      }
    }
    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
      }
    }
    if [srcip] != "" and [dstip] != "" {
      mutate {
        replace => {
          "event_type" => "NETWORK_CONNECTION"
        }
      }
    }
    if [event_type] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
  }
  else if [process_type] == "dhcpd" {
    grok {
      match => {
        "msg" => "%{WORD:dhcp_type} (for|on) %{IP:src_ip} (from|to) %{MAC:src_mac}(?: \\(%{HOST:src_host}\\)|%{SPACE})"
      }
      on_error => "dhcp_grok_fail"
      overwrite => ["dhcp_type","src_host"]
    }
    if [dhcp_grok_fail] {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.description" => "%{msg}"
          "event.idm.read_only_udm.metadata.product_event_type" => "%{process_type}"
          "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DHCP"
          "event.idm.read_only_udm.network.application_protocol" => "DHCP"
          "event.idm.read_only_udm.metadata.product_event_type" => "%{process_type}"
        }
      }
      if [dhcp_type] == "DHCPREQUEST" {
        mutate {
          replace => {
            "event.idm.read_only_udm.network.dhcp.ciaddr" => "%{src_ip}"
            "event.idm.read_only_udm.network.dhcp.chaddr" => "%{src_mac}"
            "event.idm.read_only_udm.network.dhcp.type" => "REQUEST"
            "event.idm.read_only_udm.network.dhcp.opcode" => "BOOTREQUEST"
          }
        }
        if [src_host] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.principal.hostname" => "%{src_host}"
              "event.idm.read_only_udm.observer.hostname" => "%{src_host}"
            }
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.mac" => "src_mac"
            "event.idm.read_only_udm.principal.ip" => "src_ip"
            "event.idm.read_only_udm.observer.ip" => "src_ip"
          }
        }
      }
      else if [dhcp_type] IN [ "DHCPACK", "DHCPOFFER" ] {
        if [src_host] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.principal.hostname" => "%{src_host}"
              "event.idm.read_only_udm.network.dhcp.client_hostname" => "%{src_host}"
            }
          }
        }
        if [dhcp_type] == "DHCPACK" {
          mutate {
            replace => {
              "event.idm.read_only_udm.network.dhcp.type" => "ACK"
              "event.idm.read_only_udm.network.dhcp.opcode" => "BOOTREPLY"
            }
          }
        }
        else if [dhcp_type] == "DHCPOFFER" {
          mutate {
            replace => {
              "event.idm.read_only_udm.network.dhcp.type" => "OFFER"
              "event.idm.read_only_udm.network.dhcp.opcode" => "BOOTREPLY"
            }
          }
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.network.dhcp.yiaddr" => "%{src_ip}"
            "event.idm.read_only_udm.network.dhcp.chaddr" => "%{src_mac}"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.ip" => "src_ip"
            "event.idm.read_only_udm.observer.ip" => "src_ip"
            "event.idm.read_only_udm.principal.mac" => "src_mac"
          }
        }
      }
      else if [dhcp_type] == "DHCPNAK" {
        mutate {
          replace => {
            "event.idm.read_only_udm.network.dhcp.type" => "NAK"
            "event.idm.read_only_udm.network.dhcp.opcode" => "BOOTREPLY"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.mac" => "src_mac"
            "event.idm.read_only_udm.principal.ip" => "src_ip"
          }
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.network.dhcp.yiaddr" => "%{src_ip}"
            "event.idm.read_only_udm.network.dhcp.chaddr" => "%{src_mac}"
          }
        }
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{msg}"
        "event.idm.read_only_udm.metadata.product_event_type" => "%{process_type}"
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  date {
    match => ["log_date","yyyy:MM:dd-HH:mm:ss"]
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "SOPHOS_DHCP"
      "event.idm.read_only_udm.metadata.vendor_name" => "SOPHOS"
    }
  }
  # output the built event
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
