# Product: Red Canary
# Category: EDR
# Supported Format: JSON
# Reference: https://redcanary.com/solutions/endpoint-detection-and-response/
# Last Updated: 2022-09-10
# Copyright 2022 Chronicle LLC


filter {
  # initialize
  mutate {
    replace => {
      "network" => ""
      "mac_addresses" => ""
      "protocol_cd" => ""
      "process_standard_input" => ""
      "process_standard_output" => ""
      "process_standard_error" => ""
      "about" => ""
      "ip_addresses" => ""
    }
  }

  # input
  json {
    source => "message"
    array_function => "split_columns"
  }

  # transform mac addresses from "ee-ee-ee-ee-ee-ee" to "ee:ee:ee:ee:ee:ee"
  if [mac_addresses] != "" {
    grok {
      match => {
        "message" => '\"mac_addresses\":\\[(?P<mac>.+?)\\]'
      }
    }
    mutate {
      gsub => ["mac", "-", ":"]
    }
    mutate {
      replace => {
        "json_mac" => '{"mac_addresses":[%{mac}]}'
      }
    }
    json {
      source => "json_mac"
    }
  }

  if [event_type_cd] == "endpoint_metadata" {
    date {
      match => ["registration_time", "ISO8601"]
    }

    mutate {
      rename => {
        "hostname" => "principal.hostname"
        "mac_addresses" => "principal.mac"
      }
      replace => {
        "metadata.event_type" => "STATUS_HEARTBEAT"
      }
    }

    if [ip_addresses] != "" {
      for ips in ip_addresses {
        mutate {
          merge => {
            "principal.ip" => "ips"
          }
        }
      }
    }
    # labels

    mutate {
      rename => {
        "endpoint_status" => "endpoint_status_label.value"
      }
      replace => {
        "endpoint_status_label.key" => "endpoint_status"
      }
    }
    mutate {
      merge => {
        "about.labels" => "endpoint_status_label"
      }
    }

    mutate {
      rename => {
        "monitoring_status" => "monitoring_status_label.value"
      }
      replace => {
        "monitoring_status_label.key" => "monitoring_status"
      }
    }
    mutate {
      merge => {
        "about.labels" => "monitoring_status_label"
      }
    }

    mutate {
      rename => {
        "physical_memory_bytes" => "physical_memory_bytes_label.value"
      }
      replace => {
        "physical_memory_bytes_label.key" => "physical_memory_bytes"
      }
      convert => {
        "physical_memory_bytes_label.value" => "string"
      }
    }
    mutate {
      merge => {
        "about.labels" => "physical_memory_bytes_label"
      }
    }

    mutate {
      rename => {
        "endpoint_type" => "endpoint_type_label.value"
      }
      replace => {
        "endpoint_type_label.key" => "endpoint_type"
      }
    }
    mutate {
      merge => {
        "about.labels" => "endpoint_type_label"
      }
    }

    if [is_telemetry_collection_enabled] {
      mutate {
        replace => {
          "is_telemetry_collection_enabled" => "true"
        }
      }
    } else {
      mutate {
        replace => {
          "is_telemetry_collection_enabled" => "false"
        }
      }
    }

    mutate {
      rename => {
        "is_telemetry_collection_enabled" => "is_telemetry_collection_enabled_label.value"
      }
      replace => {
        "is_telemetry_collection_enabled_label.key" => "is_telemetry_collection_enabled"
      }
    }
    mutate {
      merge => {
        "about.labels" => "is_telemetry_collection_enabled_label"
      }
    }
  }
  else {
    # timestamp
    date {
      match => ["activity_at_ts", "ISO8601"]
    }

    mutate {
      replace => {
        "target.process.product_specific_process_id" => "process_native_id:%{process_native_id}"
      }
    }

    if [event_type_cd] in ["network_connection", "process_start"] {
      if [event_type_cd] == "process_start" {
        mutate {
          replace => {
            "target.process.parent_process.product_specific_process_id" => "parent_process_native_id:%{parent_process_native_id}"
          }
        }
      }

      mutate {
        rename => {
          "process_path" => "target.process.file.full_path"
          "process_command_line" => "target.process.command_line"
          "process_sha256" => "target.process.file.sha256"
        }
      }
    }

    if [event_type_cd] == "network_connection" {
      if [protocol_cd] != "" {
        mutate {
          rename => {
            "protocol_cd" => "network.ip_protocol"
          }
        }
      }

      mutate {
        rename => {
          "direction_cd" => "network.direction"
        }
        replace => {
          "metadata.event_type" => "NETWORK_CONNECTION"
        }
        uppercase => ["network.direction", "network.ip_protocol"]
      }

      # By looking at the provided samples the local_ip seems to be always: 127.0.0.1, 0.0.0.0, :: or blank so we do these adjustments to avoid udm2sdm validations failures.
      if [local_ip] == "" {
        mutate {
          replace => {
            "local_ip" => "127.0.0.1"
          }
        }
      }
      if [domain] == "" {
        mutate {
          replace => {
            "domain" => "localhost"
          }
        }
      }
      if [local_port] > 0 {
        mutate {
          rename => {
            "local_port" => "principal.port"
          }
          convert => {
            "principal.port" => "integer"
          }
        }
      }

      mutate {
        rename => {
          "domain" => "principal.hostname"
        }
      }
      mutate {
        merge => {
          "principal.ip" => "local_ip"
        }
      }

      mutate {
        rename => {
          "remote_port" => "target.port"
        }
        convert => {
          "target.port" => "integer"
        }
      }
      mutate {
        merge => {
          "target.ip" => "remote_ip"
        }
      }

      mutate {
        rename => {
          "remote_location_cd" => "remote_location_cd_label.value"
        }
        replace => {
          "remote_location_cd_label.key" => "remote_location_cd"
        }
      }
      mutate {
        merge => {
          "about.labels" => "remote_location_cd_label"
        }
      }
    }
    else if [event_type_cd] == "process_start" {
      mutate {
        rename => {
          # process
          "process_pid" => "target.process.pid"
          "process_path" => "target.process.file.full_path"
          "process_command_line" => "target.process.command_line"
          "process_md5" => "target.process.file.md5"
          "process_sha1" => "target.process.file.sha1"
          "process_name" => "target.application"

          # parent_process
          "parent_process_pid" => "target.process.parent_process.pid"
          "parent_process_path" => "target.process.parent_process.file.full_path"
          "parent_process_command_line" => "target.process.parent_process.command_line"
          "parent_process_md5" => "target.process.parent_process.file.md5"
          "parent_process_sha1" => "target.process.parent_process.file.sha1"
          "parent_process_sha256" => "target.process.parent_process.file.sha256"

          "user_uid" => "principal.user.userid"
          "user_name" => "principal.user.user_display_name"
          "user_domain" => "principal.administrative_domain"
        }
        replace => {
          "metadata.event_type" => "PROCESS_LAUNCH"
        }
        convert => {
          "target.process.pid" => "string"
          "target.process.parent_process.pid" => "string"
        }
      }

      if [process_standard_input] != "" {
        mutate {
          rename => {
            "process_standard_input" => "process_standard_input_label.value"
          }
          replace => {
            "process_standard_input_label.key" => "process_standard_input"
          }
        }
        mutate {
          merge => {
            "about.labels" => "process_standard_input_label"
          }
        }
      }

      if [process_standard_output] != "" {
        mutate {
          rename => {
            "process_standard_output" => "process_standard_output_label.value"
          }
          replace => {
            "process_standard_output_label.key" => "process_standard_output"
          }
        }
        mutate {
          merge => {
            "about.labels" => "process_standard_output_label"
          }
        }
      }

      if [process_standard_error] != "" {
        mutate {
          rename => {
            "process_standard_error" => "process_standard_error_label.value"
          }
          replace => {
            "process_standard_error_label.key" => "process_standard_error"
          }
        }
        mutate {
          merge => {
            "about.labels" => "process_standard_error_label"
          }
        }
      }
    }
    else if [event_type_cd] == "process_end" {
      mutate {
        replace => {
          "metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
  }

  mutate {
    rename => {
      "host_name" => "principal.hostname"

      "event_type_cd" => "metadata.product_event_type"
      "sensor_product_ver" => "metadata.product_version"

      "endpoint_platform" => "principal.platform"
      "endpoint_operating_system" => "principal.platform_version"

      "sensor_product_cd" => "observer.application"
    }
    replace => {
      "observer.asset_id" => "sensor_id:%{sensor_id}"

      "metadata.vendor_name" => "REDCANARY"
      "metadata.product_name" => "EDR"
    }
    uppercase => ["principal.platform"]
  }

  # UDM fields

  mutate {
    rename => {
      "principal" => "event.idm.read_only_udm.principal"
      "target" => "event.idm.read_only_udm.target"
      "observer" => "event.idm.read_only_udm.observer"
      "metadata" => "event.idm.read_only_udm.metadata"
    }
  }

  if [about] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.about" => "about"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
