# Product: CITRIX_MONITOR
# Category: Monitoring of DaaS
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2022-11-01
# Copyright 2022 Chronicle LLC


filter {
  mutate {
    replace => {
      "CreatedDate" => ""
      "User.Id" => ""
      "User.Sid" => ""
      "User.Upn" => ""
      "User.UserName" => ""
      "User.FullName" => ""
      "User.Domain" => ""
      "CurrentConnectionId" => ""
      "MachineId" => ""
      "Machine.Id" => ""
      "Machine.Sid" => ""
      "Machine.IPAddress" => ""
      "Machine.HostingServerName" => ""
      "Machine.HostedMachineName" => ""
      "Machine.AgentVersion" => ""
      "Machine.AssociatedUserFullNames" => ""
      "Machine.AssociatedUserUPNs" => ""
      "Machine.Hash" => ""
      "Machine.OSType" => ""
      "Machine.DnsName" => ""
      "Connections" => ""
      "ApplicationInstances" => ""
      "LogOnDuration" => ""
      "SessionKey" => ""
      "ConnectionState" => ""
      "event_type" => ""
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [CreatedDate] != "" {
    date {
      match => ["CreatedDate", "ISO8601"]
    }
  }

  if [MachineId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.asset_id" => "MachineId:%{MachineId}"
      }
    }
  }
  else if [Machine][Id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.asset_id" => "MachineId:%{Machine.Id}"
      }
    }
  }

  if [Machine][Sid] != "" and [Machine][Sid] =~ "^S-\\\\d-(\\\\d+-){1,14}\\\\d+$" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.windows_sid" => "%{Machine.Sid}"
      }
    }
  }

  if [Machine][IPAddress] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "Machine.IPAddress"
      }
    }
  }

  if [Machine][HostingServerName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{Machine.HostingServerName}"
      }
    }
  }

  if [Machine][HostedMachineName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.administrative_domain" => "%{Machine.HostedMachineName}"
      }
    }
  }

  if [Machine][AssociatedUserUPNs] != "" {
    mutate {
      replace => {
        "associatedUserUPNs" => "{\"AssociatedUserUPNs\":[\"%{Machine.AssociatedUserUPNs}\"]}"
      }
    }
    mutate {
      gsub => ["associatedUserUPNs",",","\",\""]
    }

    json {
      source => "associatedUserUPNs"
      array_function => "split_columns"
      on_error => "not_json"
    }

    for user in AssociatedUserUPNs {
      if [user] =~ "^.+@.+$" {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.user.email_addresses" => "user"
          }
          replace => {
            "event_type" => "USER_UNCATEGORIZED"
          }
        }
      }
    }
  }

  if [Machine][AssociatedUserFullNames] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.user_display_name" => "%{Machine.AssociatedUserFullNames}"
      }
    }
  }

  if [Machine][DnsName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.dns_domain" => "%{Machine.DnsName}"
      }
    }
  }

  if [Machine][AgentVersion] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{Machine.AgentVersion}"
      }
    }
  }

  if [Machine][Hash] != "" {
    mutate {
      lowercase => ["Machine.Hash"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.file.md5" => "%{Machine.Hash}"
      }
    }
  }

  if [Machine][OSType] =~ "(?i)windows" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.platform" => "WINDOWS"
      }
    }
  }
  else if [Machine][OSType] =~ "(?i)mac" or [Machine][OSType] =~ "(?i)osx" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.platform" => "MAC"
      }
    }
  }
  else if [Machine][OSType] =~ "(?i)linux" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.platform" => "LINUX"
      }
    }
  }

  if [User][Id] != "" {
    mutate {
      convert => {
        "User.Id" => "string"
      }
    }
    mutate {
      replace => {
        "additional_user_id_label.key" => "userid"
        "additional_user_id_label.value.string_value" => "%{User.Id}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_user_id_label"
      }
    }
    mutate {
      replace => {
        "event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  if [User][UserName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{User.UserName}"
        "event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  if [User][FullName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.user_display_name" => "%{User.FullName}"
        "event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  if [User][Sid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.windows_sid" => "%{User.Sid}"
        "event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  if [User][Domain] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.administrative_domain" => "%{User.Domain}"
      }
    }
  }

  if [User][Upn] =~ "^.+@.+$" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.user.email_addresses" => "User.Upn"
      }
    }
    mutate {
      replace => {
        "event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  if [CurrentConnectionId] != "" {
    mutate {
      convert => {
        "CurrentConnectionId" => "string"
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{CurrentConnectionId}"
      }
    }
  }

  if [Connections] != "" {
    for connection in Connections {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "connection.ClientAddress"
        }
        on_error => "no_field"
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "connection.ConnectedViaIPAddress"
        }
        on_error => "no_field"
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "connection.LaunchedViaIPAddress"
        }
        on_error => "no_field"
      }
    }
  }

  if [ApplicationInstances] != "" {
    for applicationInstance in ApplicationInstances {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.application" => "%{applicationInstance.Application.Name}"
        }
        on_error => "no_field"
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.target.process.parent_process.file.full_path" => "%{applicationInstance.Application.AdminFolder}"
        }
        on_error => "no_field"
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.target.process.file.full_path" => "%{applicationInstance.Application.Path}"
        }
        on_error => "no_field"
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.network.http.user_agent" => "%{applicationInstance.Application.BrowserName}"
        }
        on_error => "no_field"
      }
    }
  }

  if [LogOnDuration] != "" {
    mutate {
      convert => {
        "LogOnDuration" => "string"
      }
    }
    mutate {
      replace => {
        "label_Log_On_Duration.key" => "LogOnDuration"
        "label_Log_On_Duration.value" => "%{LogOnDuration}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.metadata.ingestion_labels" => "label_Log_On_Duration"
      }
    }
  }

  if [SessionKey] != "" {
    mutate {
      replace => {
        "label_Session_Key.key" => "SessionKey"
        "label_Session_Key.value" => "%{SessionKey}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.metadata.ingestion_labels" => "label_Session_Key"
      }
    }
  }

  if [ConnectionState] != "" {
    mutate {
      convert => {
        "ConnectionState" => "string"
      }
    }
    mutate {
      replace => {
        "label_Connection_State.key" => "ConnectionState"
        "label_Connection_State.value" => "%{ConnectionState}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.metadata.ingestion_labels" => "label_Connection_State"
      }
    }
  }

  if [event_type] == "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "CITRIX_MONITOR"
      "event.idm.read_only_udm.metadata.vendor_name" => "CITRIX_MONITOR"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
