# Product: BARRACUDA CLOUDGEN FIREWALL
# Category: SaaS Applications
# Supported Format: Syslog
# Reference: NA
# Last Updated:2026-04-16
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "security_result" => ""
      "ts_month" => ""
      "ts_day" => ""
      "ts_time" => ""
      "host" => ""
      "severity" => ""
      "process_name" => ""
      "product_id" => ""
      "src_ip" => ""
      "src_port" => ""
      "desc" => ""
      "has_principal" => ""
      "has_target" => ""
      "has_user" => ""
      "tar_app" => ""
      "msg_data" => ""
      "column2" => ""
      "column13" => ""
      "column5" => ""
      "column6" => ""
      "column7" => ""
      "column8" => ""
      "column11" => ""
      "column14" => ""
      "action" => ""
      "id" => ""
      "details" => ""
      "dst_ip" => ""
      "dst_port" => ""
      "_action" => ""
      "mac" => ""
      "user_id" => ""
      "column1" => ""
      "column12" => ""
      "column4" => ""
      "column3" => ""
      "column9" => ""
      "protocol_src" => ""
      "ip_protocol_out" => ""
      "protocol_number_src" => ""
      "ts_timestamp" => ""
      "request_type" => ""
      "request_key" => ""
      "kv_data" => ""
      "principal_user_id" => ""
      "cn_data" => ""
      "peer" => ""
      "origin" => ""
      "server" => ""
      "service" => ""
      "box" => ""
      "startport" => ""
      "endport" => ""
      "syslog_priority" => ""
    }
  }
  mutate {
    gsub => ["message","\\r\\n",""]
  }
  mutate {
    gsub => ["message","\\\n",""]
  }
  grok {
    match => {
      "message" => [
         "<%{INT}>%{SYSLOGTIMESTAMP:ts_timestamp} %{HOSTNAME:host} %{DATA}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} (?P<action>Allow|Block): %{GREEDYDATA:msg_data}",
        "<%{INT}>%{MONTH:ts_month}  %{MONTHDAY:ts_day} %{TIME:ts_time} %{HOSTNAME:host} %{HOSTNAME}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} %{DATA:tar_app}: \\[%{INT:product_id}\\] %{DATA} %{IP:src_ip}:%{IPORHOST:src_port} %{GREEDYDATA:desc}",
        "<%{INT}>%{MONTH:ts_month}  %{MONTHDAY:ts_day} %{TIME:ts_time} %{HOSTNAME:host} %{HOSTNAME}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} %{DATA:tar_app}: \\[%{INT:product_id}\\]\\s+%{GREEDYDATA:desc}",
        "<%{INT}>%{MONTH:ts_month}  %{MONTHDAY:ts_day} %{TIME:ts_time} %{HOSTNAME:host} %{HOSTNAME}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} %{DATA:tar_app}: \\[%{DATA}\\]\\s+%{DATA:action}:\\s+%{DATA} %{DATA}\\(%{INT}\\) %{IP:src_ip} -> %{IP:dst_ip}:%{IPORHOST:dst_port} \\|\\[ID: %{INT:id} %{DATA}\\]\\|\\|%{INT}\\|%{GREEDYDATA:details}",
        "<%{INT}>%{MONTH:ts_month}  %{MONTHDAY:ts_day} %{TIME:ts_time} %{HOSTNAME:host} %{HOSTNAME}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} %{DATA:tar_app}: \\<%{DATA}\\>\\|%{DATA}\\(%{INT}\\)\\|\\|\\|%{INT}\\|%{MAC:mac}\\|%{GREEDYDATA}",
        "<%{INT}>%{MONTH:ts_month}  %{MONTHDAY:ts_day} %{TIME:ts_time} %{HOSTNAME:host} %{HOSTNAME}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} %{DATA:tar_app}: %{USERNAME:user_id}\\|%{GREEDYDATA}",
        "<%{INT}>%{MONTH:ts_month}  %{MONTHDAY:ts_day} %{TIME:ts_time} %{HOSTNAME:host} %{HOSTNAME}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} %{DATA:tar_app}: %{GREEDYDATA:msg_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:ts_timestamp} %{HOSTNAME:host} %{INT:product_id}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} \\[%{DATA:request_type}\\] %{DATA:request_key}: (?P<Authentication>%{DATA:desc} for %{GREEDYDATA:kv_data}) %{DATA:principal_user_id}\\|%{GREEDYDATA:cn_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:ts_timestamp} %{HOSTNAME:host} %{INT:product_id}/%{DATA}/%{HOSTNAME}/%{DATA:process_name}:\\s+%{DATA:severity}\\s+%{HOSTNAME} %{GREEDYDATA:desc}",
      ]
    }
    overwrite => ["ts_month", "ts_day","ts_time","host","severity","tar_app","product_id","src_ip","src_port","desc","process_name","msg_data","action", "id", "details","dst_ip","dst_port", "mac", "user_id", "ts_timestamp", "request_type", "request_key", "principal_user_id", "kv_data", "cn_data", "syslog_priority"]
    on_error => "no_grok"
  }
  kv {
    source => "kv_data"
    field_split => " "
    value_split => "="
    on_error => "no_kv_data"
  }
  if ![no_kv_data] {
    if [peer] != "" {
      grok {
        match => {
          "peer" => [
            "%{IP:peer}"
          ]
        }
        overwrite => ["peer"]
        on_error => "grok_peer_error"
      }
      if ![grok_peer_error] {
        mutate {
          merge => {
            "principal.ip" => "peer"
            "principal.asset.ip" => "peer"
          }
          on_error => "no_peer_ip"
        }
        if ![no_peer_ip] {
          mutate {
            replace => {
              "has_principal" => "true"
            }
          }
        }
      }
    }
    if [origin] != "" {
      mutate {
        replace => {
          "principal.application" => "%{origin}"
        }
        on_error => "no_origin"
      }
    }
    if [server] != "" {
      mutate {
        replace => {
          "server_label.key" => "server"
          "server_label.value.string_value" => "%{server}"
        }
        on_error => "no_server"
      }
      if ![no_server] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "server_label"
          }
          on_error => "no_server_label"
        }
      }
    }
    if [service] != "" {
      mutate {
        replace => {
          "service_label.key" => "service"
          "service_label.value.string_value" => "%{service}"
        }
        on_error => "no_service"
      }
      if ![no_service] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "service_label"
          }
          on_error => "no_service_label"
        }
      }
    }
    if [box] != "" {
      mutate {
        replace => {
          "box_name_label.key" => "box_name"
          "box_name_label.value.string_value" => "%{box}"
        }
        on_error => "no_box"
      }
      if ![no_box] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "box_name_label"
          }
          on_error => "no_box_name_label"
        }
      }
    }
    if [startport] != "" {
      mutate {
        replace => {
          "start_port_label.key" => "start_port"
          "start_port_label.value.string_value" => "%{startport}"
        }
        on_error => "no_startport"
      }
      if ![no_startport] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "start_port_label"
          }
          on_error => "no_start_port_label"
        }
      }
    }
    if [endport] != "" {
      mutate {
        replace => {
          "end_port_label.key" => "end_port"
          "end_port_label.value.string_value" => "%{endport}"
        }
        on_error => "no_endport"
      }
      if ![no_endport] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "end_port_label"
          }
          on_error => "no_end_port_label"
        }
      }
    }
  }
  grok {
    match => {
      "desc" => [
        "%{IP:src_ip}:%{INT:src_port}"
      ]
    }
    overwrite => ["src_ip", "src_port"]
    on_error => "grok_desc_error"
  }
  if [desc] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{desc}"
      }
      on_error => "no_desc"
    }
  }
  if [request_type] != "" {
    mutate {
      replace => {
        "request_type_label.key" => "request_type"
        "request_type_label.value.string_value" => "%{request_type}"
      }
      on_error => "no_request_type"
    }
    if ![no_request_type] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "request_type_label"
        }
        on_error => "no_request_type_label"
      }
    }
  }
  if [request_key] != "" {
    mutate {
      replace => {
        "request_key_label.key" => "request_key"
        "request_key_label.value.string_value" => "%{request_key}"
      }
      on_error => "no_request_key"
    }
    if ![no_request_key] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "request_key_label"
        }
        on_error => "no_request_key_label"
      }
    }
  }
  if [principal_user_id] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{principal_user_id}"
        "has_user" => "true"
      }
      on_error => "no_principal_user_id"
    }
  }
  if [cn_data] != "" {
    mutate {
      gsub => ["cn_data","\\|",""]
    }
    mutate {
      merge => {
        "principal.user.group_identifiers" => "cn_data"
      }
      on_error => "no_cn_data"
    }
  }
  if [syslog_priority] != "" {
    mutate {
      replace => {
        "syslog_priority_label.key" => "syslogpriority"
        "syslog_priority_label.value.string_value" => "%{syslog_priority}"
      }
      on_error => "no_syslog_priority"
    }
    if ![no_syslog_priority] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "syslog_priority_label"
        }
        on_error => "no_syslog_priority_label"
      }
    }
  }
  else if [msg_data] != "" {
    mutate {
    gsub => ["msg_data","\\|","#"]
    }
    mutate {
      gsub => ["msg_data","\\n",""]
    }
    csv {
     source => "msg_data"
     separator => "#"
     on_error => "no_msg_data"
    }
  }
  if [host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host}"
        "principal.asset.hostname" => "%{host}"
        "has_principal" => "true"
      }
      on_error => "no_host"
    }
  }
  if [src_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "src_ip"
        "principal.asset.ip" => "src_ip"
      }
      on_error => "no_src_ip"
    }
    if ![no_src_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [src_port] not in ["","0"] {
    mutate {
      replace => {
        "principal.port" => "%{src_port}"
      }
      on_error => "no_src_port"
    }
    mutate {
      convert => {
        "principal.port" => "integer"
      }
      on_error => "conversion_error"
    }
  }
  if [tar_app] != "" {
    mutate {
      replace => {
        "target.application" => "%{tar_app}"
      }
      on_error => "no_tar_app"
    }
  }
  if [process_name] != "" {
    mutate {
      replace => {
        "process_name_label.key" => "process_name"
        "process_name_label.value.string_value" => "%{process_name}"
      }
      on_error => "no_process_name"
    }
    if ![no_process_name] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "process_name_label"
        }
        on_error => "no_process_name_label"
      }
    }
  }
  if [severity] != "" {
    mutate {
      uppercase => ["severity"]
      on_error => "no_severity"
    }
  }

  if [severity] == "ERROR" {
      mutate {
        replace => {
          "security_result.severity" => "%{severity}"
        }
        on_error => "no_severity"
      }
    } else if [severity] == "INFO" {
       mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    }else if [severity] == "WARNING" {
       mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
  }else if [severity] == "BLOCK" {
      mutate {
        replace => {
          "security_result.severity" => "ERROR"
        }
      }
    }
  else {
    mutate {
      replace => {
        "security_result.severity_details" => "%{severity}"
      }
      on_error => "no_security_result"
    }
  }
  if [product_id] != "" {
    mutate {
      replace => {
        "target.process.pid" => "%{product_id}"
      }
      on_error => "no_product_id"
    }
  }
  if [column13] != "" {
    mutate {
      merge => {
        "principal.ip" => "column13"
        "principal.asset.ip" => "column13"
      }
      on_error => "no_column13"
    }
    if ![no_column13] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [column5] not in ["","0"] {
    mutate {
      replace => {
        "principal.port" => "%{column5}"
      }
      on_error => "no_column5"
    }
    mutate {
      convert => {
        "principal.port" => "integer"
      }
      on_error => "conversion_error_principal_port"
    }
  }
  if [column6] != "" {
    mutate {
      merge => {
        "principal.mac" => "column6"
      }
      on_error => "no_column6"
    }
    if ![no_column6] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [column7] != "" {
    mutate {
      merge => {
        "target.ip" => "column7"
        "target.asset.ip" => "column7"
      }
      on_error => "no_column7"
    }
    if ![no_column7] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [column8] not in ["","0"] {
    grok {
      match => {
        "column8" => [
          "%{INT:column8}"
        ]
      }
      overwrite => ["column8"]
      on_error => "no_column8_grok"
    }
    if ![no_column8_grok] {
      mutate {
        convert => {
          "column8" => "string"
        }
        on_error => "conversion_error_column8"
      }
      mutate {
        replace => {
          "target.port" => "%{column8}"
        }
        on_error => "no_column8_port"
      }
      mutate {
        convert => {
          "target.port" => "integer"
        }
        on_error => "conversion_error_target_port"
      }
    }
  }
  if [column11] != "" {
    mutate {
      replace => {
        "connection_type_label.key" => "connection_type"
        "connection_type_label.value.string_value" => "%{column11}"
      }
      on_error => "no_column11"
    }
    if ![no_column11] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "connection_type_label"
        }
        on_error => "no_connection_type_label"
      }
    }
  }
  if [column14] != "" {
    mutate {
      merge => {
        "target.ip" => "column14"
        "target.asset.ip" => "column14"
      }
      on_error => "no_column14"
    }
    if ![no_column14] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [column1] != "" {
    mutate {
      replace => {
        "traffic_direction_label.key" => "traffic_direction"
        "traffic_direction_label.value.string_value" => "%{column1}"
      }
      on_error => "no_column1"
    }
    if ![no_column1] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "traffic_direction_label"
        }
        on_error => "no_traffic_direction_label"
      }
    }
  }
  if [column3] != "" {
    mutate {
      replace => {
        "principal_interface_label.key" => "principal_interface"
        "principal_interface_label.value.string_value" => "%{column3}"
      }
      on_error => "no_column3"
    }
    if ![no_column3] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "principal_interface_label"
        }
        on_error => "no_principal_interface_label"
      }
    }
  }
  if [column12] != "" {
    mutate {
      replace => {
        "security_result.rule_id" => "%{column12}"
      }
      on_error => "no_column12"
    }
  }
  if [column4] != "" {
    grok {
      match => {
        "column4" => [
          "%{IP:column4}"
        ]
      }
      overwrite => ["column4"]
      on_error => "no_column4"
    }
    if ![no_column4] {
      mutate {
        merge => {
          "principal.ip" => "column4"
          "principal.asset.ip" => "column4"
        }
        on_error => "no_column4_ip"
      }
      if ![no_column4_ip] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
  }
  if [column9] != "" {
    mutate {
      replace => {
        "application_label.key" => "application"
        "application_label.value.string_value" => "%{column9}"
      }
      on_error => "no_column9"
    }
    if ![no_column9] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "application_label"
        }
        on_error => "no_application_label"
      }
    }
  }
  if [action] != "" {
    if [action] == "Allow" {
      mutate {
        replace => {
          "_action" => "ALLOW"
        }
      }
    }
    else if [action] == "Block" {
      mutate {
        replace => {
          "_action" => "BLOCK"
        }
      }
    }
    else {
      mutate {
        replace => {
          "security_result.action_details" => "%{action}"
        }
        on_error => "action_not_present"
      }
    }
  }
  if [_action] != "" {
    mutate {
      merge => {
        "security_result.action" => "_action"
      }
      on_error => "no_action"
    }
  }
  mutate {
    uppercase => ["column2"]
  }
  if [column2] not in ["", "N/A", "UNKNOWN"] {
    mutate {
      replace => {
        "protocol_number_src" => "%{column2}"
      }
      on_error => "no_protocol_src"
    }
    if ![no_protocol_src] {
        # This file contains the ip protocol convertor
        # Document:
        #   - https://www.iana.org/assignments/protocol-numbers/protocol-numbers.xhtml
        # Interface:
        # protocol_number_src (required): number with the value which represents the protocol
        # ip_protocol_out: string that is either empty or contains ip protocol
        #                  compatible to IpProtocol enum in udm.proto
        
        mutate {
          replace => {
            "ip_protocol_out" => "UNKNOWN_IP_PROTOCOL"
          }
        }
        
        
        if [protocol_number_src] in [ 1, "ICMP", "ICMPV6", 58 ] {
          mutate {
            replace => {
              "ip_protocol_out" => "ICMP"
            }
          }
        } else if [protocol_number_src] in [ 2, "IGMP" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "IGMP"
            }
          }
        } else if [protocol_number_src] in [ 6, "TCP" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "TCP"
            }
          }
        } else if [protocol_number_src] in [ 17, "UDP" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "UDP"
            }
          }
        } else if [protocol_number_src] in [ 41, "IP6IN4" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "IP6IN4"
            }
          }
        } else if [protocol_number_src] in [ 47, "GRE" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "GRE"
            }
          }
        } else if [protocol_number_src] in [ 50, "ESP" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "ESP"
            }
          }
        } else if [protocol_number_src] in [ 88, "EIGRP" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "EIGRP"
            }
          }
        }  else if [protocol_number_src] in [ 97, "ETHERIP" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "ETHERIP"
            }
          }
        } else if [protocol_number_src] in [ 103, "PIM" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "PIM"
            }
          }
        } else if [protocol_number_src] in [ 112, "VRRP" ] {
          mutate {
            replace => {
              "ip_protocol_out" => "VRRP"
            }
          }
        }
      if [ip_protocol_out] not in ["", "UNKNOWN_IP_PROTOCOL"] {
        mutate {
          replace => {
            "network.ip_protocol" => "%{ip_protocol_out}"
          }
          on_error => "no_ip_protocol"
        }
      }
    }
  }
  if [ts_timestamp] != "" {
    date {
      match => ["ts_timestamp", "MMM d HH:mm:ss", "MMM dd HH:mm:ss"]
      rebase => true
      target => "metadata.event_timestamp"
      on_error => "no_ts_timestamp"
    }
  }
  if [dst_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "dst_ip"
        "target.asset.ip" => "dst_ip"
      }
      on_error => "no_dst_ip"
    }
    if ![no_dst_ip] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [dst_port] not in ["","0"] {
    mutate {
      replace => {
        "target.port" => "%{dst_port}"
      }
      on_error => "no_dst_port"
    }
    mutate {
      convert => {
        "target.port" => "integer"
      }
      on_error => "conversion_error_dst_port"
    }
  }
  if [id] != "" {
    mutate {
      replace => {
        "id_label.key" => "id"
        "id_label.value.string_value" => "%{id}"
      }
      on_error => "no_id"
    }
    if ![no_id] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "id_label"
        }
        on_error => "no_id_label"
      }
    }
  }
  if [details] != "" {
    mutate {
      replace => {
        "details_label.key" => "details"
        "details_label.value.string_value" => "%{details}"
      }
      on_error => "no_details"
    }
    if ![no_details] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "details_label"
        }
        on_error => "no_details_label"
      }
    }
  }
  if [mac] != "" {
    mutate {
      merge => {
        "target.mac" => "mac"
      }
      on_error => "no_mac"
    }
    if ![no_mac] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [user_id] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{user_id}"
      }
      on_error => "no_user_id"
    }
    mutate {
      replace => {
        "has_user" => "true"
      }
    }
  }
  mutate {
    replace => {
      "metadata.vendor_name" => "BARRACUDA CLOUDGEN FIREWALL"
      "metadata.product_name" => "BARRACUDA CLOUDGEN FIREWALL"
    }
  }
  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }



  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
