# Product: Microsoft ATA
# Category: IDS/IPS
# Supported Format: SYSLOG + KV
# Reference: https://docs.microsoft.com/en-us/advanced-threat-analytics
# Last Updated: 2024-01-29
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "when" => ""
      "suser" => ""
      "kv_msg" => ""
      "request" => ""
      "app" => ""
      "msg" => ""
      "shost" => ""
      "cs1" => ""
      "kv_list1" => ""
      "kv_list2" => ""
      "kv_list3" => ""
      "hostname" => ""
      "prefix_hostname" => ""
      "hostname_suffix" => ""
      "externalId" => ""
      "version" => ""
      "firstname" => ""
      "lastname" => ""
      "target" => ""
      "host" => ""
      "has_principal_host" => "false"
      "has_target_host" => "false"
      "event_type_set" => "false"
      "event_type" => ""
    }
  }
  grok {
    match => {
      "message" => "<%{NUMBER}>%{NUMBER} %{YEAR:year}-%{MONTHNUM:month}-%{MONTHDAY:day}T%{HOUR:hour}:%{MINUTE:minute}:%{INT:second}.%{INT}%{ISO8601_TIMEZONE:tz} %{GREEDYDATA:deviceHost} %{WORD} %{NUMBER} %{WORD} %{GREEDYDATA}CEF:%{NUMBER}\\|%{WORD}\\|%{WORD}\\|%{GREEDYDATA:version}\\|%{WORD:eventLabel}\\|%{GREEDYDATA:eventMessage}\\|%{NUMBER:product_priority}\\|%{GREEDYDATA:kv_msg}"
    }
    overwrite => ["when","kv_msg","version"]
    on_error => "grok_pattern_mismatch"
    }

  if [kv_msg] =~ " msg=" {
    mutate {
      gsub => ["kv_msg"," msg="," #msg="]
    }
    grok {
      match => {"kv_msg" => "%{GREEDYDATA:kv_list1} #msg=%{GREEDYDATA:kv_msg}"}
      overwrite => ["kv_msg","kv_list1"]
      on_error => "kv_msg1_grok_failed"
    }
    if [kv_msg] =~ " request=" {
      mutate {
        gsub => ["kv_msg"," request="," #request="]
      }
      grok {
        match => {"kv_msg" => "%{GREEDYDATA:kv_msg} #%{GREEDYDATA:kv_list2}"}
        overwrite => ["kv_msg","kv_list2"]
        on_error => "kv_msg2_grok_failed"
      }
    }
    if [kv_msg] =~ " externalId=" {
      mutate {
        gsub => ["kv_msg"," externalId="," #externalId="]
      }
      grok {
        match => {"kv_msg" => "%{GREEDYDATA:kv_msg} #%{GREEDYDATA:kv_list3}"}
        overwrite => ["kv_msg","kv_list3"]
        on_error => "kv_msg3_grok_failed"
      }
    }
    mutate {
      replace => {
        "security_result.description" => "%{kv_msg}"
      }
    }
  }

  if [kv_list1] != "" {
    kv {
      source => "kv_list1"
      field_split => " "
      value_split => "="
    }
  }
  if [kv_list2] != "" {
    kv {
      source => "kv_list2"
      field_split => " "
      value_split => "="
    }
  }
  if [kv_list3] != "" {
    kv {
      source => "kv_list3"
      field_split => " "
      value_split => "="
    }
  }
  if [kv_msg] != "" && [kv_msg] =~ "Gateway,"{
    grok {
      match => {"kv_msg" => "%{GREEDYDATA:prefix_hostname}Gateway, %{HOSTNAME:hostname}, %{GREEDYDATA:hostname_suffix}"}
      overwrite => ["hostname","prefix_hostname","hostname_suffix"]
      on_error => "kv_msg4_grok_failed"
    }
  }

  if [kv_msg] =~ "performed interactive logins" {
    grok {
      match => {"kv_msg" => "%{GREEDYDATA}from %{HOSTNAME:target}%{GREEDYDATA}"}
      overwrite => ["target"]
      on_error => "kv_msg5_grok_failed"
    }
    mutate {
      replace => {
      "event_type" => "USER_LOGIN"
      "event.idm.read_only_udm.extensions.auth.type" => "MACHINE"
      "event_type_set" => "true"
      }
    }
  }

  if [suser] != "" && [kv_msg] != "" {
    grok {
      match => {"kv_msg" => "%{WORD:firstname}, %{WORD:lastname}"}
      overwrite => ["firstname", "lastname"]
      on_error => "kv_msg6_grok_failed"
    }
    if [firstname] != "" && [lastname] != "" {
      if [event_type] == "USER_LOGIN" {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.user.user_display_name" => "%{firstname},%{lastname}"
          }
        }
      } else if [firstname] != "" and [lastname] != "" {
        mutate {
          replace => {
            "event.idm.read_only_udm.principal.user.user_display_name" => "%{firstname},%{lastname}"
          }
        }
      }
    }
  }

  mutate {
    replace => {
      "ts" => "%{year}-%{month}-%{day} %{hour}:%{minute}:%{second}"
    }
  }

  date {
    match => ["ts", "yyyy-MM-dd HH:mm:ss", "ISO8601" ]
  }

  if [app] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.observer.application" => "%{app}"
      }
    }
  }
  if [version] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{version}"
      }
    }
  }
  if [request] != "" && [request] =~ "/"{
    mutate {
        replace => {
          "security_result.about.hostname" => "%{request}"
        }
      }
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{request}"
        "has_target_host" => "true"
      }
    }
  } else if [hostname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{hostname}"
        "has_target_host" => "true"
      }
    }
  }
  if [externalId] != "" {
    mutate {
        replace => {
          "event.idm.read_only_udm.metadata.product_event_type" => "%{externalId}"
        }
      }
    if [externalId] == "2012" {
      mutate {
        replace => {
          event_type => "SCAN_HOST"
          "event_type_set" => "true"
        }
      }
    }
  }
  if [cs1] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.url_back_to_product" => "%{cs1}"
      }
    }
  }
  if [suser] != "" {
    if [event_type] == "USER_LOGIN" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.user.userid" => "%{suser}"
        }
      }
    } else {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{suser}"
        }
      }
    }
  }
  if [product_priority] != "" {
    mutate {
      convert => {"product_priority" => "integer"}
    }
    if [product_priority] == 3 {
      mutate {
        replace => {
          "security_result.priority" => "LOW_PRIORITY"
          "security_result.severity" => "LOW"
        }
      }
    } else if [product_priority] == 5 {
      mutate {
        replace => {
          "security_result.priority" => "MEDIUM_PRIORITY"
          "security_result.severity" => "MEDIUM"
        }
      }
    } else if [product_priority] == 10 {
      mutate {
        replace => {
          "security_result.priority" => "HIGH_PRIORITY"
          "security_result.severity" => "HIGH"
        }
      }
    }
  }
  if [shost] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{shost}"
        "has_principal_host" => "true"
      }
    }
    if [deviceHost] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.observer.hostname" => "%{deviceHost}"
        }
      }
    }
  } else {
    if [deviceHost] != "" {
      mutate {
        replace => {
          "observer_ip" => "%{deviceHost}"
        }
        convert => {
          "observer_ip" => "ipaddress"
        }
        on_error => "is_client_ip"
      }

      if ![is_client_ip] {
        mutate {
          merge => {
            "event.idm.read_only_udm.observer.ip" => "deviceHost"
          }
        }
      }else {
        mutate {
          replace => {
            "event.idm.read_only_udm.observer.hostname" => "%{deviceHost}"
          }
        }
      }
    }
  }

  if [cs1] != "" {
    if [event_type] == "USER_LOGIN" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "%{target}"
          "has_target_host" => "true"
        }
      }
    } else {
      grok {
        match => {"cs1" => "https://%{HOSTNAME:target}"}
        overwrite => ["target"]
        on_error => "cs1_msg_grok_failed"
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "%{target}"
          "has_target_host" => "true"
        }
      }
    }
  }

  if [shost] == ""{
    if [request] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{request}"
          "has_principal_host" => "true"
        }
      }
    } else{
      if [kv_msg] != "" {
        grok {
          match => {
            "kv_msg" => [
              ", %{GREEDYDATA:host},",
              "from %{DATA:host} "
            ]
          }
          overwrite => ["host"]
          on_error => "kv_msg_grok_failed"
        }
        if [host] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.principal.hostname" => "%{host}"
              "has_principal_host" => "true"
            }
            on_error => "host_not_found"
          }
        }
      }
    }
  }
  if [eventLabel] =~ "Alert" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{eventLabel}"
      }
    }
    mutate {
      replace => {
        "security_result.summary" => "%{prefix_hostname} %{hostname} %{hostname_suffix}"
      }
    }
  } else {
    mutate {
      replace => {
        "security_result.threat_name" => "%{eventLabel}"
        "security_result.summary" => "%{eventMessage}"
      }
    }
  }
  mutate {
    merge => {
      "event.idm.read_only_udm.security_result" => "security_result"
    }
  }
  if [has_principal_host] == "true"  and [has_target_host] == "true"  and [event_type_set] == "false" {
    mutate {
      replace => {
        "event_type" => "NETWORK_UNCATEGORIZED"
      }
    }
  }
  else if [event_type_set] == "false" {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "ATA"
      "event.idm.read_only_udm.metadata.vendor_name" => "MICROSOFT"
    }
  }
  mutate {
    rename => {
      "event_type" => "event.idm.read_only_udm.metadata.event_type"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
