# Product: CA ACF2
# Category: Mainframe
# Supported Format: LEEF
# Reference: See below
# Last Updated: 2022-05-24
# Copyright 2022 Chronicle LLC


# Additional References:
# Log format: https://drive.google.com/file/d/11do0W4wIee7JVFMkYfVlMvjgjZqgnegp/view?usp=sharing
# Log format: https://drive.google.com/file/d/11do0W4wIee7JVFMkYfVlMvjgjZqgnegp/view?usp=sharing
# Log format: https://drive.google.com/file/d/1y7JKjcJz3l3oaznGid8UGYWfUNhtS5tC/view?usp=sharing
# Mapping: https://docs.google.com/spreadsheets/d/1Eu4nSgbhRabJgmVLFvemlcenDURi3fNTG2IlCDHYwXc/edit?usp=sharing

filter {
    mutate {
        replace => {
            "_metadata" => ""
            "_principal" => ""
            "_target" => ""
            "_security_result" => ""
            "_extensions" => ""
            "kv_data" => ""
            "box" => ""
            "cat" => ""
            "class" => ""
            "devTime" => ""
            "dsn" => ""
            "job" => ""
            "job_id" => ""
            "job_group" => ""
            "logstr" => ""
            "name" => ""
            "reason" => ""
            "res" => ""
            "sum" => ""
            "terminal" => ""
            "usrName" => ""
            "vol" => ""
            "username_password" => "USERNAME_PASSWORD"
            "auth_violation" => "AUTH_VIOLATION"
            "acl_violation" => "ACL_VIOLATION"
            "action_block" => "BLOCK"
            "usrPriv" => ""
            "intent" => ""
            "auth" => ""
        }
    }

    grok {
        match => {
            "message" => [
                "LEEF:(?P<log_version>[0-9.]+)\\|(?P<vendor_name>[a-zA-Z0-9._-]+)\\|(?P<product_name>[a-zA-Z0-9._-]+)\\|(?P<product_version>[0-9.]+)\\|(?P<event_type>[a-zA-Z0-9._-]+)\\|%{GREEDYDATA:kv_data}"
            ]
        }
        overwrite => [ "kv_data" ]
        on_error => "_not_found"
    }

    if [_not_found] {
      drop {
        tag => "TAG_MALFORMED_ENCODING"
      }
    }

    mutate {
        gsub => [
            # replace \t with a ^ so that field_split in kv can work
            "kv_data", "\\t", "^"
        ]
    }

    kv {
        source => "kv_data"
        field_split => "^"
        value_split => "="
        whitespace => strict
    }

    date {
        match => [
            "devTime", "yyyy-MM-ddTHH:mm:ss.SSSZ"
        ]
    }

    if [job] != "" {
        grok {
            match => {
                "job" => [
                    "(?P<job_group>^.{0}.{4})(?P<time>.{25})(?P<job_id>.{8})"
                ]
            }
            overwrite => [ "job_id", "job_group" ]
            on_error => "_not_found"
        }
        mutate {
            gsub => [
                "job_id", " ", "",
                "job_group", " ", "",
            ]
        }
        if [job_id] != "" {
            mutate {
                replace => {
                    "_target.application" => "%{job_id}"
                }
           }
        }
        if [job_group] != "" {
            mutate {
                replace => {
                    "_target.group.group_display_name" => "%{job_group}"
                }
           }
        }
    }

    # Setting event type and event type specific fields

    # event type: User insert, delete, replace and update
    if [event_type] == "ACF2-L" {
        if [cat] == "UPDATE" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_UNCATEGORIZED"
                }
            }
        }
        else if [cat] == "REPLACE" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_UNCATEGORIZED"
                }
            }
        }
        else if [cat] == "INSERT" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_CREATION"
                }
            }
        }
        else if [cat] == "DELETE" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_DELETION"
                }
            }
        }
        if [res] != "" {
            mutate {
                replace => {
                    "_target.user.userid" => "%{res}"
                }
            }
        }

        if [name] != "" {
            mutate {
                replace => {
                    "_principal.user.user_display_name" => "%{name}"
                }
            }
        }

        if [usrName] != "" {
            mutate {
                replace => {
                    "_principal.user.userid" => "%{usrName}"
                }
            }
        }

    }

    # Event type: failed login
    else if [event_type] == "ACF2-P" {
        if [cat] == "HISTORY_NOT_ALLOWED_EXP" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_RESOURCE_ACCESS"
                }
            }

            if [name] != "" {
                mutate {
                    replace => {
                        "_principal.user.user_display_name" => "%{name}"
                    }
                }
            }

            if [usrName] != "" {
                mutate {
                    replace => {
                        "_principal.user.userid" => "%{usrName}"
                    }
                }
            }

            mutate {
                merge => {
                    "_security_result.category" => "acl_violation"
                }
            }
        }
        else if [cat] == "SUSPENDED_PWVIOL" or
            [cat] == "PASSWORD_INVALID" or
            [cat] == "PASSWORD_EXPIRED" or
            [cat] == "LOGONID_NOTFOUND" or
            [cat] == "LOGONID_SUSPEND" or
            [cat] == "PASSWORD_NEEDED" or
            [cat] == "NAT_CHAR_REQD" or
            [cat] == "TOO_MANY_REPEATING_EXP" or
            [cat] == "NUM_REQD_EXP" or
            [cat] == "PASSWORD_EXP_LEN" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_LOGIN"
                }
            }

            if [name] != "" {
                mutate {
                    replace => {
                        "_target.user.user_display_name" => "%{name}"
                    }
                }
            }

            if [usrName] != "" {
                mutate {
                    replace => {
                        "_target.user.userid" => "%{usrName}"
                    }
                }
            }

            mutate {
                merge => {
                    "_security_result.category" => "auth_violation"
                }
            }
        } else {
            mutate {
                replace => {
                    "_metadata.event_type" => "GENERIC_EVENT"
                }
            }
        }
        mutate {
            replace => {
                "_extensions.auth.type" => "TACACS"
            }
            merge => {
                "_extensions.auth.mechanism" => "username_password"
            }
        }
        mutate {
            merge => {
                "_security_result.action" => "action_block"
            }
        }
    }
    # Event type: resource access attempt
    else if [event_type] == "ACF2-O" {
        if [cat] == "CHECK_ACCESS" or
            [cat] == "SSFC_54" or
            [cat] == "GET_UMAP" or
            [cat] == "KERBEROS_INFO" or
            [cat] == "SETEUID" or
            [cat] == "CDSA_DATALIB" or
            [cat] == "ADMIN_REQ" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_RESOURCE_ACCESS"
                }
            }
        } else {
            mutate {
                replace => {
                    "_metadata.event_type" => "GENERIC_EVENT"
                }
            }
        }

        if [name] != "" {
            mutate {
                replace => {
                    "_principal.user.user_display_name" => "%{name}"
                }
            }
        }

        if [usrName] != "" {
            mutate {
                replace => {
                    "_principal.user.userid" => "%{usrName}"
                }
            }
        }
        if [sum] =~ "^ACF2 [a-zA-Z_-]* failure for logonid [a-zA-Z_-]*" {
            mutate {
                merge => {
                    "_security_result.category" => "acl_violation"
                    "_security_result.action" => "action_block"
                }
            }
        }

    }

    # Event type: rebuild directory job
    else if [event_type] == "ACF2-A" {
        if [cat] == "Modify" {
            mutate {
                replace => {
                    "_metadata.event_type" => "RESOURCE_WRITTEN"
                }
            }
        }
        else if [usrName] != "" {
          mutate {
            replace => {
              "_metadata.event_type" => "USER_UNCATEGORIZED"
            }
          }
        }
        else {
            mutate {
                replace => {
                    "_metadata.event_type" => "GENERIC_EVENT"
                }
            }
        }
        mutate {
            replace => {
                "_target.namespace" => "DIRECTORY"
            }
        }

        if [name] != "" {
            mutate {
                replace => {
                    "_principal.user.user_display_name" => "%{name}"
                }
            }
        }

        if [usrName] != "" {
            mutate {
                replace => {
                    "_principal.user.userid" => "%{usrName}"
                }
            }
        }

    }

    # Event type: change password
    else if [event_type] == "ACF2-E" {
        if [cat] == "REPLACE" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_CHANGE_PASSWORD"
                }
            }
        }
        else if [cat] == "INSERT" {
            mutate {
                replace => {
                    "_metadata.event_type" => "USER_CHANGE_PASSWORD"
                }
            }
        } else {
            mutate {
                replace => {
                    "_metadata.event_type" => "GENERIC_EVENT"
                }
            }
        }
        if [res] != "" {
            mutate {
                replace => {
                    "_target.resource.product_object_id" => "%{res}"
                }
            }
        }

        if [name] != "" {
            mutate {
                replace => {
                    "_principal.user.user_display_name" => "%{name}"
                }
            }
        }

        if [usrName] != "" {
            mutate {
                replace => {
                    "_principal.user.userid" => "%{usrName}"
                }
            }
        }

    }

    # Event type: resource written
    else if [event_type] == "ACF2-V" {
        mutate {
            replace => {
                "_metadata.event_type" => "RESOURCE_WRITTEN"
            }
        }
        if [res] != "" {
            mutate {
                replace => {
                    "_target.resource.product_object_id" => "%{res}"
                }
            }
        }

        if [name] != "" {
            mutate {
                replace => {
                    "_principal.user.user_display_name" => "%{name}"
                }
            }
        }

        if [usrName] != "" {
            mutate {
                replace => {
                    "_principal.user.userid" => "%{usrName}"
                }
            }
        }

    }

    # Event type: resource written
    else if [event_type] == "ACF2-D" {
        mutate {
            replace => {
                "_metadata.event_type" => "RESOURCE_WRITTEN"
            }
        }

        if [name] != "" {
            mutate {
                replace => {
                    "_principal.user.user_display_name" => "%{name}"
                }
            }
        }

        if [usrName] != "" {
            mutate {
                replace => {
                    "_principal.user.userid" => "%{usrName}"
                }
            }
        }

    }

    # Event type: automatic job submitted
    else if [event_type] == "ACF2-J" {
        mutate {
            replace => {
                "_metadata.event_type" => "GENERIC_EVENT"
            }
        }

        if [name] != "" {
            mutate {
                replace => {
                    "_target.user.user_display_name" => "%{name}"
                }
            }
        }

        if [usrName] != "" {
            mutate {
                replace => {
                    "_target.user.userid" => "%{usrName}"
                }
            }
        }

        if [usrName] != "" {
          mutate {
            replace => {
              "_metadata.event_type" => "USER_UNCATEGORIZED"
            }
          }
        }
    }
    # Event type:
    else if [event_type] == "ACF2-R" {
        mutate {
            replace => {
                "_metadata.event_type" => "USER_UNCATEGORIZED"
            }
        }

        if [name] != "" {
            mutate {
                replace => {
                    "_target.user.user_display_name" => "%{name}"
                }
            }
        }

        if [usrName] != "" {
            mutate {
                replace => {
                    "_target.user.userid" => "%{usrName}"
                }
            }
        }
    }

    # setting common fields

    if [usrPriv] != "" {
      mutate {
        replace => {
          "usrpriv_label.key" => "usrPriv"
          "usrpriv_label.value.string_value" => "%{usrPriv}"
        }
      }

      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "usrpriv_label"
        }
      }
    }

    if [auth] != "" {
      mutate {
        replace => {
          "auth_label.key" => "auth"
          "auth_label.value.string_value" => "%{auth}"
        }
      }

      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "auth_label"
        }
      }
    }

    if [intent] not in [ "", "-" ] {
      mutate {
        replace => {
          "intent_label.key" => "intent"
          "intent_label.value.string_value" => "%{intent}"
        }
      }

      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "intent_label"
        }
      }
    }

    if [cat] != "" {
      mutate {
        replace => {
          "cat_label.key" => "cat"
          "cat_label.value.string_value" => "%{cat}"
        }
      }

      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "cat_label"
        }
      }
    }

    if [box] != "" {
      mutate {
        replace => {
          "box_label.key" => "box"
          "box_label.value.string_value" => "%{box}"
        }
      }

      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "box_label"
        }
      }
    }

    if [class] != "" {
        mutate {
            replace => {
                "category_details" => "SAF class: %{class}"
            }
        }
        mutate {
            merge => {
                "_security_result.category_details" => "category_details"
            }
        }
    }

    if [dsn] != "" {
        mutate {
            replace => {
                "_target.resource.product_object_id" => "%{dsn}"
                "_target.resource.name" => "%{dsn}"
                "_target.resource.resource_type" => "DATABASE"
            }
        }
    }

    if [logstr] != "" {
        mutate {
            replace => {
                "_security_result.summary" => "%{logstr}"
            }
        }
    }

    if [reason] != "" {
        if [reason] == "LOGGING" {
            mutate {
                replace => {
                    "_security_result.severity" => "INFORMATIONAL"
                }
            }
        }
        else if [reason] == "VIO" {
            mutate {
                replace => {
                    "_security_result.severity" => "LOW"
                }
            }
        }
        else if [reason] == "TRACE" {
            mutate {
                replace => {
                    "_security_result.severity" => "INFORMATIONAL"
                }
            }
        }
        mutate {
            replace => {
                "_security_result.severity_details" => "%{reason}"
            }
        }
    }

    if [sum] != "" {
        mutate {
            replace => {
                "_metadata.description" => "%{sum}"
            }
        }
    }

    if [terminal] != "" {
        mutate {
            replace => {
                "_principal.hostname" => "%{terminal}"
            }
        }
    }

    if [vol] != "" {
        mutate {
            replace => {
                "_target.resource.parent" => "%{vol}"
            }
        }
    }

    # Setting UDM fields

    mutate {
        replace => {
            "_metadata.vendor_name" => "%{vendor_name}"
            "_metadata.product_name" => "%{product_name}"
            "_metadata.product_version" => "%{product_version}"
            "_metadata.product_event_type" => "%{event_type} %{cat}"
        }
    }

    if [_principal] != "" {
        mutate {
            rename => {
                "_principal" => "event.idm.read_only_udm.principal"
            }
        }
    }

    if [_metadata] != "" {
        mutate {
            rename => {
                "_metadata" => "event.idm.read_only_udm.metadata"
            }
        }
    }

    if [_target] != "" {
        mutate {
            rename => {
                "_target" => "event.idm.read_only_udm.target"
            }
        }
    }

    if [_extensions] != "" {
        mutate {
            rename => {
                "_extensions" => "event.idm.read_only_udm.extensions"
            }
        }
    }

    if [_security_result] != "" {
        mutate {
            merge => {
                "event.idm.read_only_udm.security_result" => "_security_result"
            }
        }
    }

    mutate {
        merge => {
            "@output" => "event"
        }
    }
}
