# Product: UPGUARD
# Category: Vulnerability scanners
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2024-11-13
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "network" => ""
      "metadata" => ""
      "additional" => ""
      "security_result" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "notification.context.VendorName" => ""
      "notification.description" => ""
      "notification.context.ActionURL" => ""
      "notification.context.FinalScore" => ""
      "notification.context.Threshold" => ""
      "notification.context.TotalDrop" => ""
      "notification.context.PrevHighestScore" => ""
      "notification.context.InLastDays" => ""
      "notification.context.VendorID" => ""
      "notification.id" => ""
      "notification.context.LatestScoreOn" => ""
      "notification.context.PrevHighestOn" => ""
      "notification.occurredAt" => ""
      "notification.type" => ""
      "notification.context.LatestScore" => ""
      "notification.context.PrevScoreOn" => ""
      "notification.context.PrevScore" => ""
      "notification.context.DetectedCVEs" => ""
      "notification.context.Domain" => ""
      "notification.context.StartDate" => ""
      "notification.context.EndDate" => ""
      "notification.context.Hosts" => ""
    }
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }
  if [notification][context][VendorName] != "" {
    mutate {
      replace => {
        "metadata.vendor_name" => "%{notification.context.VendorName}"
      }
      on_error => "invalid_VendorName"
    }
  }
  if [notification][description] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{notification.description}"
      }
      on_error => "invalid_description"
    }
  }
  mutate {
    convert => {
      "notification.id" => "string"
    }
    on_error => "string_conversion_failure_id"
  }
  if [notification][id] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{notification.id}"
      }
      on_error => "invalid_product_log_id"
    }
  }
  if [notification][context][ActionURL] != "" {
    mutate {
      replace => {
        "principal.url" => "%{notification.context.ActionURL}"
      }
      on_error => "invalid_ActionURL"
    }
  }
  mutate {
    convert => {
      "notification.context.FinalScore" => "string"
    }
    on_error => "string_conversion_failure_FinalScore"
  }
  if [notification][context][FinalScore] != "" {
    mutate {
      replace => {
        "notification_context_FinalScore_field.value.string_value" => "%{notification.context.FinalScore}"
      }
      on_error => "invalid_FinalScore"
    }
    if ![invalid_FinalScore] {
      mutate {
        replace => {
          "notification_context_FinalScore_field.key" => "FinalScore"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_FinalScore_field"
        }
        on_error => "FinalScore_label_merge_failure"
      }
    }
  }
  mutate {
    convert => {
      "notification.context.Threshold" => "string"
    }
    on_error => "string_conversion_failure_Threshold"
  }
  if [notification][context][Threshold] != "" {
    mutate {
      replace => {
        "notification_context_Threshold_field.value.string_value" => "%{notification.context.Threshold}"
      }
      on_error => "invalid_Threshold"
    }
    if ![invalid_Threshold] {
      mutate {
        replace => {
          "notification_context_Threshold_field.key" => "Threshold"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_Threshold_field"
        }
        on_error => "Threshold_label_merge_failure"
      }
    }
  }
  mutate {
    convert => {
      "notification.context.TotalDrop" => "string"
    }
    on_error => "string_conversion_failure_TotalDrop"
  }
  if [notification][context][TotalDrop] != "" {
    mutate {
      replace => {
        "notification_context_TotalDrop_field.value.string_value" => "%{notification.context.TotalDrop}"
      }
      on_error => "invalid_TotalDrop"
    }
    if ![invalid_TotalDrop] {
      mutate {
        replace => {
          "notification_context_TotalDrop_field.key" => "TotalDrop"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_TotalDrop_field"
        }
        on_error => "TotalDrop_label_merge_failure"
      }
    }
  }
  mutate {
    convert => {
      "notification.context.PrevHighestScore" => "string"
    }
    on_error => "string_conversion_failure_PrevHighestScore"
  }
  if [notification][context][PrevHighestScore] != "" {
    mutate {
      replace => {
        "notification_context_PrevHighestScore_field.value.string_value" => "%{notification.context.PrevHighestScore}"
      }
      on_error => "invalid_PrevHighestScore"
    }
    if ![invalid_PrevHighestScore] {
      mutate {
        replace => {
          "notification_context_PrevHighestScore_field.key" => "PrevHighestScore"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_PrevHighestScore_field"
        }
        on_error => "PrevHighestScore_label_merge_failure"
      }
    }
  }
  mutate {
      convert => {
        "notification.context.InLastDays" => "string"
      }
      on_error => "invalid_InLastDays"
    }
  if [notification][context][InLastDays] != "" {
    mutate {
      replace => {
        "notification_context_InLastDays_field.value.string_value" => "%{notification.context.InLastDays}"
      }
      on_error => "invalid_InLastDays"
    }
    if ![invalid_InLastDays] {
      mutate {
        replace => {
          "notification_context_InLastDays_field.key" => "InLastDays"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_InLastDays_field"
        }
        on_error => "InLastDays_label_merge_failure"
      }
    }
  }
  mutate {
    convert => {
      "notification.context.VendorID" => "string"
    }
    on_error => "invalid_VendorID"
  }
  if [notification][context][VendorID] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{notification.context.VendorID}"
      }
      on_error => "invalid_VendorID"
    }
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  if [notification][context][LatestScoreOn] != "" {
    mutate {
      replace => {
        "notification_context_LatestScoreOn_field.value.string_value" => "%{notification.context.LatestScoreOn}"
      }
      on_error => "invalid_LatestScoreOn"
    }
    if ![invalid_LatestScoreOn] {
      mutate {
        replace => {
          "notification_context_LatestScoreOn_field.key" => "LatestScoreOn"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_LatestScoreOn_field"
        }
        on_error => "LatestScoreOn_label_merge_failure"
      }
    }
  }
  if [notification][context][PrevHighestOn] != "" {
    mutate {
      replace => {
        "notification_context_PrevHighestOn_field.value.string_value" => "%{notification.context.PrevHighestOn}"
      }
      on_error => "invalid_PrevHighestOn"
    }
    if ![invalid_PrevHighestOn] {
      mutate {
        replace => {
          "notification_context_PrevHighestOn_field.key" => "PrevHighestOn"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_PrevHighestOn_field"
        }
        on_error => "PrevHighestOn_label_merge_failure"
      }
    }
  }
  if [notification][type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{notification.type}"
      }
      on_error => "invalid_type"
    }
  }
  if [notification][occurredAt] != "" {
    date {
      match => [ "notification.occurredAt",  "ISO8601" ]
      target => "metadata.event_timestamp"
      on_error => "invalid_occurredAt"
    }
  }
  mutate {
    convert => {
      "notification.context.LatestScore" => "string"
    }
    on_error => "string_conversion_failure_LatestScore"
  }
  if [notification][context][LatestScore] != "" {
    mutate {
      replace => {
        "notification_context_LatestScore_field.value.string_value" => "%{notification.context.LatestScore}"
      }
      on_error => "invalid_LatestScore"
    }
    if ![invalid_LatestScore] {
      mutate {
        replace => {
          "notification_context_LatestScore_field.key" => "LatestScore"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_LatestScore_field"
        }
        on_error => "LatestScore_label_merge_failure"
      }
    }
  }
  if [notification][context][PrevScoreOn] != "" {
    mutate {
      replace => {
        "notification_context_PrevScoreOn_field.value.string_value" => "%{notification.context.PrevScoreOn}"
      }
      on_error => "invalid_PrevScoreOn"
    }
    if ![invalid_PrevScoreOn] {
      mutate {
        replace => {
          "notification_context_PrevScoreOn_field.key" => "PrevScoreOn"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_PrevScoreOn_field"
        }
        on_error => "PrevScoreOn_label_merge_failure"
      }
    }
  }
  if [notification][context][StartDate] != "" {
    mutate {
      replace => {
        "notification_context_StartDate_field.value.string_value" => "%{notification.context.StartDate}"
      }
      on_error => "invalid_StartDate"
    }
    if ![invalid_StartDate] {
      mutate {
        replace => {
          "notification_context_StartDate_field.key" => "StartDate"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_StartDate_field"
        }
        on_error => "StartDate_label_merge_failure"
      }
    }
  }
  if [notification][context][EndDate] != "" {
    mutate {
      replace => {
        "notification_context_EndDate_field.value.string_value" => "%{notification.context.EndDate}"
      }
      on_error => "invalid_EndDate"
    }
    if ![invalid_EndDate] {
      mutate {
        replace => {
          "notification_context_EndDate_field.key" => "EndDate"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_EndDate_field"
        }
        on_error => "EndDate_label_merge_failure"
      }
    }
  }
  mutate {
    convert => {
      "notification.context.PrevScore" => "string"
    }
    on_error => "string_conversion_failure_PrevScore"
  }
  if [notification][context][PrevScore] != "" {
    mutate {
      replace => {
        "notification_context_PrevScore_field.value.string_value" => "%{notification.context.PrevScore}"
      }
      on_error => "invalid_PrevScore"
    }
    if ![invalid_PrevScore] {
      mutate {
        replace => {
          "notification_context_PrevScore_field.key" => "PrevScore"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "notification_context_PrevScore_field"
        }
        on_error => "PrevScore_label_merge_failure"
      }
    }
  }
  if [notification][context][DetectedCVEs] != "" {
    for data in notification.context.DetectedCVEs {
      mutate {
        replace => {
          "add_label" => ""
        }
      }
      mutate {
        replace => {
          "data_CVE" => "%{data.CVE}"
        }
        on_error => "no_key"
      }
      mutate {
        convert => {
          "data.CVSS" => "string"
        }
        on_error => "no_value"
      }
      mutate {
        replace => {
          "data_CVSS" => "%{data.CVSS}"
        }
        on_error => "no_value"
      }
      if ![no_key] and ![no_value] {
        mutate {
          replace => {
            "add_label.key" => "%{data_CVE}"
            "add_label.value" => "%{data_CVSS}"
          }
        }
        mutate {
          merge => {
            "security_result.detection_fields" => "add_label"
          }
          on_error => "merge_error"
        }
      }
    }
  }
  if [notification][context][Hosts] != "" {
    for index, hosts in notification.context.Hosts {
      mutate {
        replace => {
          "srcHostname_label" => ""
        }
      }
      mutate {
        convert => {
          "index" => "string"
        }
        on_error => "already_string"
      }
      if [index] == "0" {
        mutate {
          replace => {
            "principal.hostname" => "%{hosts}"
            "has_principal" => "true"
          }
          on_error => "no_host"
        }
      }
      else {
        mutate {
          replace => {
            "srcHostname_label.string_value" => "%{hosts}"
          }
          on_error => "no_srcHostname"
        }
        mutate {
          merge => {
            "srcHostname_list.value.list_value.values" => "srcHostname_label"
          }
          on_error => "no_srcHostname_label"
        }
        if [srcHostname_list][value] != "" {
          mutate {
            replace => {
              "srcHostname_list.key" => "hostnames"
            }
          }
          mutate {
            merge => {
              "event.idm.read_only_udm.additional.fields" => "srcHostname_list"
            }
            on_error => "no_srcHostname_list"
          }
        }
      }
    }
  }
  if [notification][context][Domain] != "" {
    mutate {
      replace => {
        "target.administrative_domain" => "%{notification.context.Domain}"
      }
      on_error => "invalid_Domain"
    }
  }
  mutate {
    replace => {
      "metadata.product_name" => "UPGUARD"
    }
  }

  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "false" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [notification][context][VendorID] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_merge_failure"
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  # Generate output
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
