# Product: FILEZILLA_FTP
# Category: File tranfser
# Supported Format: SYSLOG
# Reference: https://wiki.filezilla-project.org/Server_logs#:~:text=Open%20the%20server%20settings%20(Edit,of%20FileZilla%20Servers%20installation%20path
# Last Updated: 2024-06-09
# Copyright 2024 Chronicle LLC


filter {

  mutate {
    replace => {
      "timestamp" => ""
      "src_hostname" => ""
      "pid" => ""
      "userid" => ""
      "dst_ip" => ""
      "description" => ""
      "port" => ""
      "response_code" => ""
      "product_event_type" => ""
      "date" => ""
      "time" => ""
      "user_email" => ""
      "app_proto" => ""
      "method" => ""
      "kv_data" => ""
      "src_ip" => ""
      "event_type" => ""
      "has_principal_host" => ""
      "description_data" => ""
      "session_id" => ""
    }
  }

  grok {
    match => {
      message => [
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} %{HOSTNAME:src_hostname} %FileZilla: \\(%{INT:pid}\\) %{DATESTAMP} (AM|PM)? - %{GREEDYDATA:userid} \\(%{IP:dst_ip}\\)> %{GREEDYDATA:description}"
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} %{HOSTNAME:src_hostname} %FileZilla: %{GREEDYDATA:description}",
        "%{WORD:product_event_type}\\|%{DATE:date} %{TIME:time}\\|%{GREEDYDATA:description_data}",
        "%{GREEDYDATA:description}"
      ]
    }
    overwrite => ["timestamp","src_hostname","pid","userid","dst_ip","description","product_event_type","date","time","description_data"]
  }

  if [timestamp] != "" {
    date {
      match => ["timestamp", "MMM d HH:mm:ss", "MMM d HH:mm:ss "]
      rebase => true
    }
  }
  else if [date] != "" and [time] != "" {
    mutate {
      replace => {
        "timestamp" => "%{date} %{time}"
      }
      on_error => "no_timestamp"
    }
    date {
      match => ["timestamp", "MM/dd/yyyy HH:mm:ss.SSS"]
      on_error => "time_mismatch"
    }
  }

  if [product_event_type] == "POST" {
    grok {
      match => {
        "description_data" => [
          "%{WORD:app_proto}:%{DATA:session_id}:%{EMAILADDRESS:user_email},.*:%{IP:dst_ip}\\] %{WORD:method}:%{GREEDYDATA:kv_data}",
          "%{WORD:app_proto}:%{DATA:session_id}:%{IP:dst_ip}\\] %{WORD:method}:%{GREEDYDATA:kv_data}",
          "%{GREEDYDATA:kv_data}"
        ]
      }
      overwrite => ["port","dst_ip","src_hostname","user_email","app_proto","method","kv_data","src_ip","session_id"]
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{description_data}"
      }
      on_error => "no_description_data"
    }
  }

  if [kv_data] !~ ":" and [kv_data] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{kv_data}"
      }
      on_error => "no_kv_data"
    }
  }

  if [kv_data] != "" {
    kv {
      source => "kv_data"
      field_split => "*"
      value_split => ":"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" => "%{User-Agent}"
        "event.idm.read_only_udm.network.http.parsed_user_agent" =>
        "%{User-Agent}"
      }
      on_error => "no_User_Agent"
    }

    mutate {
      convert => {
        "event.idm.read_only_udm.network.http.parsed_user_agent" =>
        "parseduseragent"
      }
      on_error => "no_User_Agent"
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{Host}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{Host}"
      }
      on_error => "no_host"
    }
    if ![no_host] {
      mutate {
        replace => {
          "has_principal_host" => "true"
        }
      }
    }

    if [session_id] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.session_id" => "%{session_id}"
        }
        on_error => "no_session_id"
      }
    }

    mutate {
      replace => {
        "last_http_response_cookies_label.key" => "Cookie"
        "last_http_response_cookies_label.value.string_value" => "%{Cookie}"
      }
      on_error => "no_cookie"
    }

    if ![no_cookie] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.url_metadata.last_http_response_cookies.fields" => "last_http_response_cookies_label"
        }
        on_error => "no_cookie"
      }
    }
  }

  if [product_event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{product_event_type}"
      }
      on_error => "no_product_event_type"
    }
  }


  if [description] != "" {
    mutate {
      gsub => ["description","\\\"",""]
    }

    if [dst_ip] != "" {
      grok {
        match => {
          "description" => [
            "port %{INT:port}"
            "%{INT:response_code}( |-)"
          ]
        }
        overwrite => ["port","response_code"]
        on_error => "match_error"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{description}"
      }
    }
  }

  if [port] != "" {
    mutate {
      convert => {
        "port" => "integer"
      }
    }
    mutate {
      rename => {
        "port" => "event.idm.read_only_udm.principal.port"
      }
    }
  }

  if [response_code] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.response_code" => "%{response_code}"
      }
      convert => {
        "event.idm.read_only_udm.network.http.response_code" => "integer"
      }
    }
  }

  if [src_hostname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{src_hostname}"
        "has_principal_host" => "true"
      }
    }
  }

  if [app_proto] in ["HTTP","HTTPS"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "%{app_proto}"
      }
      on_error => "no_proto"
    }
  }

  if [method] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{method}"
      }
    }
  }

  if [user_email] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.user.email_addresses" => "user_email"
      }
      replace => {
        "event_type" => "NETWORK_FTP"
      }
      on_error => "no_user"
    }
  }

  if [dst_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "dst_ip"
      }
      replace => {
        "event_type" => "NETWORK_FTP"
      }
    }
  }

  if [event_type] != "" and [has_principal_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [pid] != "" {
    mutate{
      replace => {
        "event.idm.read_only_udm.target.process.pid" => "%{pid}"
      }
    }
  }

  if [userid] != "" and [userid] !~ "not logged in" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{userid}"
      }
    }
  }

  mutate{
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "FILEZILLA"
      "event.idm.read_only_udm.metadata.product_name" => "FILEZILLA"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
