# Product: IBM QRADAR
# Category: Security Log
# Supported Format: SYSLOG
# Reference: N/A
# Last Updated: 2024-06-18
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "_source._host" => ""
      "_source._file" => ""
      "_source._platform" => ""
      "_source._ip" => ""
      "_source._id" => ""
      "_source.action" => ""
      "_source.message" => ""
      "_source.severity" => ""
      "_source.eventTime" => ""
      "_source.eventType" => ""
      "_source.typeURI" => ""
      "_source.correlationId" => ""
      "_source.dataEvent" => ""
      "_source.saveServiceCopy" => ""
      "_source.o_initiator.authnId" => ""
      "_source.o_initiator.typeURI" => ""
      "_source.o_initiator.o_host.address" => ""
      "_source.o_initiator.o_credential.type" => ""
      "_source.o_target.id" => ""
      "_source.o_target.typeURI" => ""
      "_source.o_target.name" => ""
      "_source.o_target.o_host.address" => ""
      "_source.o_requestData.initiatorGUID" => ""
      "_source.o_requestData.o_request_body.user_name" => ""
      "_source.o_requestData.o_request_body.client_id" => ""
      "_source.o_requestData.o_request_body.scenario_type" => ""
      "_source.o_requestData.o_request_body.action" => ""
      "_source.o_requestData.o_request_body.method" => ""
      "_source.o_requestData.o_headers.User-Agent" => ""
      "_source.o_requestData.o_responseData.response_body" => ""
      "_source.o_responseData.response_body" => ""
      "_source.o_responseData.status" => ""
      "_source.o_observer.name" => ""
    }
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "json_failed"
  }
  if ![json_failed] {
    mutate {
      replace => {
        "response_code" => ""
        "event" => ""
        "principal" => ""
        "target" => ""
        "security_result" => ""
        "network" => ""
        "metadata" => ""
        "observer" => ""
        "has_principal" => ""
        "has_target" => ""
        "has_http" => ""
      }
    }
    if [_source][_host] != "" {
      mutate {
        replace => {
          "principal.hostname" => "%{_source._host}"
          "principal.asset.hostname" => "%{_source._host}"
        }
        on_error => "o_source_host_invalid"
      }
    }
    if [_source][_file] != "" {
      mutate {
        replace => {
          "principal.file.full_path" => "%{_source._file}"
        }
        on_error => "o_source_file_invalid"
      }
    }
    if [_source][_platform] != "" {
      mutate {
        replace => {
          "platform.key" => "platform"
          "platform.value" => "%{_source._platform}"
        }
        on_error => "o_source_platform_invalid"
      }
      if ![o_source_platform_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "platform"
          }
          on_error => "o_source_platform_merge_invalid"
        }
      }
    }
    if [_source][_ip] != "" {
      mutate {
        merge => {
          "principal.ip" => "_source._ip"
          "principal.asset.ip" => "_source._ip"
        }
        on_error => "o_source_ip_merge_invalid"
      }
      if ![o_source_ip_merge_invalid] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    if [_source][_id] != "" {
      mutate {
        replace => {
          "metadata.product_log_id" => "%{_source._id}"
        }
        on_error => "o_source_id_invalid"
      }
    }
    if [_source][message] != "" {
      mutate {
        replace => {
          "metadata.description" => "%{_source.message}"
        }
        on_error => "o_source_message_invalid"
      }
    }
    if [_source][severity] =~ "normal" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
        on_error => "o_source_severity_invalid"
      }
    }
    if [_source][severity] != "" {
      mutate {
        replace => {
          "security_result.severity_details" => "%{_source.severity}"
        }
        on_error => "o_source_severity_invalid"
      }
    }
    if [_source][eventTime] != "" {
      date {
        match => ["_source.eventTime","ISO8601","yyyy-MM-ddTHH:mm:ss.SSZ"]
        target => "metadata.event_timestamp"
        on_error => "no_event_received_time"
      }
    }
    if [_source][eventType] != "" {
      mutate {
        replace => {
          "metadata.product_event_type" => "%{_source.eventType}"
        }
        on_error => "o_source_event_type_invalid"
      }
    }
    if [_source][typeURI] != "" {
      mutate {
        replace => {
          "metadata.url_back_to_product" => "%{_source.typeURI}"
        }
        on_error => "o_source_type_uri_invalid"
      }
    }
    if [_source][dataEvent] != "" {
      mutate {
        convert => {
          "_source.dataEvent" => "string"
        }
        on_error => "o_source_data_event_convert_invalid"
      }
      mutate {
        replace => {
          "dataEvent.key" => "dataEvent"
          "dataEvent.value" => "%{_source.dataEvent}"
        }
        on_error => "no_data_event"
      }
      if ![no_data_event] {
        mutate {
          merge => {
            "security_result.detection_fields" => "dataEvent"
          }
          on_error => "o_source_data_event_merge_invalid"
        }
      }
    }
    if [_source][saveServiceCopy] != "" {
      mutate {
        convert => {
          "_source.saveServiceCopy" => "string"
        }
        on_error => "o_source_save_service_copy_convert_invalid"
      }
      mutate {
        replace => {
          "saveServiceCopy.key" => "saveServiceCopy"
          "saveServiceCopy.value" => "%{_source.saveServiceCopy}"
        }
        on_error => "no_save_service_copy"
      }
      mutate {
        merge => {
          "security_result.detection_fields" => "saveServiceCopy"
        }
        on_error => "o_source_save_service_copy_merge_invalid"
      }
    }
    if [_source][correlationId] != "" {
      mutate {
        replace => {
          "correlationId.key" => "correlationId"
          "correlationId.value" => "%{_source.correlationId}"
        }
        on_error => "no_correlation_id"
      }
      mutate {
        merge => {
          "security_result.detection_fields" => "correlationId"
        }
        on_error => "o_source_correlation_id_merge_invalid"
      }
    }
    if [_source][o_initiator][authnId] != "" {
      mutate {
        replace => {
          "principal.user.userid" => "%{_source.o_initiator.authnId}"
        }
        on_error => "_source_o_initiator_authnId_invalid"
      }
    }
    if [_source][o_initiator][typeURI] != "" {
      mutate {
        replace => {
          "principal.url" => "%{_source.o_initiator.typeURI}"
        }
        on_error => "o_source_o_initiator_typeURI_invalid"
      }
    }
    if [_source][o_initiator][o_host][address] != "" {
      mutate {
        merge => {
          "principal.ip" => "_source.o_initiator.o_host.address"
          "principal.asset.ip" => "_source.o_initiator.o_host.address"
        }
        on_error => "_source_o_initiator_o_host_address_invalid"
      }
      if ![_source_o_initiator_o_host_address_invalid] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    if [_source][o_initiator][o_credential][type] != "" {
      mutate {
        replace => {
          "o_credential.key" => "credential_type"
          "o_credential.value" => "%{_source.o_initiator.o_credential.type}"
        }
        on_error => "o_source_o_initiator_o_credential_type_invalid"
      }
      if ![o_source_o_initiator_o_credential_type_invalid] {
        mutate {
          merge => {
            "principal.resource.attribute.labels" => "o_credential"
          }
          on_error => "o_source_o_initiator_o_credential_type_merge_invalid"
        }
      }
    }
    if [_source][o_target][id] != "" {
      mutate {
        replace => {
          "target.user.userid" => "%{_source.o_target.id}"
        }
        on_error => "_source_o_target_o_host_id_invalid"
      }
    }
    if [_source][o_target][typeURI] != "" {
      mutate {
        replace => {
          "target.url" => "%{_source.o_target.typeURI}"
        }
        on_error => "o_source_o_target_typeURI_invalid"
      }
    }
    if [_source][o_target][name] != "" {
      mutate {
        replace => {
          "target.user.user_display_name" => "%{_source.o_target.name}"
        }
        on_error => "_source_o_target_name_invalid"
      }
    }
    if [_source][o_target][o_host][address] != "" {
      mutate {
        replace => {
          "target.hostname" => "%{_source.o_target.o_host.address}"
          "target.asset.hostname" => "%{_source.o_target.o_host.address}"
        }
        on_error => "_source_o_target_o_host_address_invalid"
      }
      if ![_source_o_target_o_host_address_invalid] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }
    if [_source][o_requestData][initiatorGUID] != "" {
      mutate {
        replace => {
          "principal.resource.product_object_id" => "%{_source.o_requestData.initiatorGUID}"
        }
        on_error => "o_source_o_requestData_initiatorGUID_invalid"
      }
    }
    if [_source][o_requestData][o_request_body][user_name] != "" {
      mutate {
        replace => {
          "principal.user.user_display_name" => "%{_source.o_requestData.o_request_body.user_name}"
        }
        on_error => "_source_o_requestData_o_request_body_user_name_invalid"
      }
    }
    if [_source][o_requestData][o_request_body][client_id] != "" {
      mutate {
        replace => {
          "clientid.key" => "client_id"
          "clientid.value" => "%{_source.o_requestData.o_request_body.client_id}"
        }
        on_error => "o_source_o_requestData_o_request_body_client_id_invalid"
      }
      if ![o_source_o_requestData_o_request_body_client_id_invalid] {
        mutate {
          merge => {
            "target.resource.attribute.labels" => "clientid"
          }
          on_error => "o_source_o_requestData_o_request_body_client_id_merge_invalid"
        }
      }
    }
    if [_source][o_requestData][o_request_body][scenario_type] != "" {
      mutate {
        replace => {
          "scenario_type.key" => "scenario_type"
          "scenario_type.value" => "%{_source.o_requestData.o_request_body.scenario_type}"
        }
        on_error => "o_source_o_requestData_o_request_body_scenario_type_invalid"
      }
      if ![o_source_o_requestData_o_request_body_scenario_type_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "scenario_type"
          }
          on_error => "o_source_o_requestData_o_request_body_scenario_type_merge_invalid"
        }
      }
    }
    if [_source][o_requestData][o_request_body][action] != "" {
      mutate {
        replace => {
          "security_result.action_details" => "%{_source.o_requestData.o_request_body.action}"
        }
        on_error => "o_source_o_requestData_o_request_body_action_invalid"
      }
    }
    if [_source][o_requestData][o_request_body][method] != "" {
      mutate {
        replace => {
          "network.http.method" => "%{_source.o_requestData.o_request_body.method}"
        }
        on_error => "_source_o_requestData_o_request_body_method_invalid"
      }
      if ![_source_o_requestData_o_request_body_method_invalid] {
        mutate {
          replace => {
            "has_http" => "true"
          }
        }
      }
    }
    if [_source][o_requestData][o_headers][User-Agent] != "" {
      mutate {
        replace => {
          "network.http.user_agent" => "%{_source.o_requestData.o_headers.User-Agent}"
        }
        on_error => "_source_o_requestData_o_headers_User-Agent_invalid"
      }
    }
    if [_source][o_responseData][response_body] =~ "(?i)success" {
      mutate {
        replace => {
          "action" => "ALLOW"
        }
      }
      mutate {
        merge => {
          "security_result.action" => "action"
        }
        on_error => "o_source_o_responseData_response_body_merge_invalid"
      }
    }
    if [_source][o_responseData][response_body] != "" {
      mutate {
        replace => {
          "security_result.action_details" => "%{_source.o_responseData.response_body}"
        }
      }
    }
    if [_source][o_responseData][status] != "" {
      mutate {
        convert => {
          "_source.o_responseData.status" => "string"
        }
        on_error => "o_source_o_responseData_status_convert_invalid"
      }
      grok {
        match => {
          "_source.o_responseData.status" => "%{INT:response_code}"
        }
        overwrite => ["response_code"]
        on_error => "o_source_o_responseData_status_grok_invalid"
      }
      if ![o_source_o_responseData_status_grok_invalid] {
        if [response_code] != "" {
          mutate {
            convert => {
              "response_code" => "integer"
            }
            on_error => "o_source_o_responseData_status_convert_invalid"
          }
          mutate {
            rename => {
              "response_code" => "network.http.response_code"
            }
          }
        }
      }
    }
    if [_source][o_observer][name] != "" {
      mutate {
        replace => {
          "observer.resource.name" => "%{_source.o_observer.name}"
        }
        on_error => "_source_o_observer_name_invalid"
      }
    }
    mutate{
      replace =>{
        "metadata.vendor_name" => "IBM QRADAR"
        "metadata.product_name" => "IBM QRADAR"
      }
    }
    if [has_principal] == "true" and [has_target] == "true" and [has_http] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_HTTP"
        }
      }
    }
    else if [has_principal] == "true" and [has_target] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_CONNECTION"
        }
      }
    }
    else if [has_principal] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      mutate {
        replace => {
          "metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
    if [metadata] != "" {
      mutate {
        rename => {
          "metadata" => "event.idm.read_only_udm.metadata"
        }
      }
    }
    if [observer] != "" {
      mutate {
        rename => {
          "observer" => "event.idm.read_only_udm.observer"
        }
      }
    }
    if [principal] != "" {
      mutate {
        rename => {
          "principal" => "event.idm.read_only_udm.principal"
        }
      }
    }
    if [target] != "" {
      mutate {
        rename => {
          "target" => "event.idm.read_only_udm.target"
        }
      }
    }
    if [network] != "" {
      mutate {
        rename => {
          "network" => "event.idm.read_only_udm.network"
        }
      }
    }
    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
        on_error => "no_security_result"
      }
    }
    mutate {
      merge => {
        "@output" => "event"
      }
    }
  }
  else {
    mutate {
      replace => {
        "security_result" => ""
        "event.idm.read_only_udm.metadata.product_name" => "IBM QRADAR"
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
    grok {
      match => {
        "message" => "%{SYSLOGTIMESTAMP:log_date} %{IP:log_ip} %{WORD:log_level} %{DATA:application}\\[%{INT:event_id}\\]: %{GREEDYDATA:message_body}"
      }
      on_error => "grok_fail"
    }
    if [grok_fail] {
      drop {
        tag => "TAG_UNSUPPORTED"
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.application" => "%{application}"
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.pid" => "%{event_id}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "log_ip"
      }
    }

    if [log_level] =~ "(?i)(error|warning)" {
      mutate {
        replace => { "security_result.severity" => "HIGH" }
      }
    }
    else if [log_level] =~ "(?i)notice" {
      mutate {
        replace => { "security_result.severity" => "MEDIUM" }
      }
    }
    else if [log_level] =~ "(?i)(information|info)" {
      mutate {
        replace => { "security_result.severity" => "LOW" }
      }
    }

    date {
      match => ["log_date","MMM dd HH:mm:ss"]
      rebase => true
      on_error => "date_not_matched"
    }

    if [application] =~ "httpd" {
      grok {
        match => {
          "message_body" => [
            "User=%{WORD:user_id} tty=%{DATA:protocol} host=%{IP:host_ip} %{DATA:auth_status} \\(start=%{DATA:start}%{SPACE}end=%{DATA:end}\\)"
          ]
        }
        on_error => "httpd_not_matched"
      }
      if ![httpd_not_matched] {
        if [auth_status] =~ "(?i)failed" {
          mutate {
            replace => {
              "action" => "BLOCK"
            }
          }
          mutate {
            merge => {
              "security_result.action" => "action"
            }
          }
        }
        mutate {
          replace => {
            "security_result.description" => "%{auth_status}"
          }
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
            "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
          }
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.target.user.userid" => "%{user_id}"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.target.ip" => "host_ip"
          }
        }
      } else {
        mutate {
          replace => {
            "event.idm.read_only_udm.metadata.description" => "%{message_body}"
          }
        }
      }
    }
    else if [application] =~ "logger" {
      grok {
        match => {
          "message_body" => [
            "(\\[ssl_acc\\]|\\[acc\\]) %{IP:ip} .*? %{DATA:auth} \\[%{HTTPDATE:timestamp}\\] \\\"%{DATA:request}\\\" %{NUMBER:response}",
            "\\[ssl_req\\]\\[%{HTTPDATE:timestamp}\\] %{IP:ip} %{NOTSPACE:tls_version} %{NOTSPACE:crypto_algorithm} \\\"%{DATA:request}\\\" (%{NUMBER:response})?",
          ]
        }
        on_error => "logger_not_matched"
      }
      if ![logger_not_matched] {
        mutate {
          replace => {
            "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.target.ip" => "ip"
          }
        }
        mutate {
          rename => {
            "auth" => "event.idm.read_only_udm.target.user.userid"
          }
        }
        mutate {
          rename => {
            "request" => "event.idm.read_only_udm.target.url"
          }
        }
        mutate {
          convert => {
            "response" => "integer"
          }
        }
        mutate {
          rename => {
            "response" => "event.idm.read_only_udm.network.http.response_code"
          }
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.network.tls.version" => "%{tls_version}"
          }
          on_error => "tls_version_not_present"
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.network.tls.cipher" => "%{crypto_algorithm}"
          }
          on_error => "cipher_not_present"
        }
      } else {
        mutate {
          replace => {
            "event.idm.read_only_udm.metadata.description" => "%{message_body}"
          }
        }
      }
    }
    else if [application] =~ "CROND" {
      grok {
        match => {
          "message_body" => "\\(%{DATA:target_host}\\) CMD \\(%{GREEDYDATA:command}\\)"
        }
        on_error => "crond_not_matched"
      }
      if ![crond_not_matched] {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.user.userid" => "%{target_host}"
          }
        }
        mutate {
          gsub => ["command", "^\\s+|\\s+$", ""]
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.target.process.command_line" => "%{command}"
          }
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.metadata.event_type" => "PROCESS_LAUNCH"
          }
        }
      } else {
        mutate {
          replace => {
            "event.idm.read_only_udm.metadata.description" => "%{message_body}"
          }
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.description" => "%{message_body}"
        }
      }
    }

    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
      }
    }

    mutate {
      merge => {
        "@output" => "event"
      }
    }
  }
}
