# Product: Snort IDS
# Category: IDS/IPS
# Supported Format: SYSLOG + JSON
# Reference: https://suricata.readthedocs.io/en/suricata-6.0.0/rules/index.html
# Last Updated: 2024-12-04
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "inter_host" => ""
      "srcip" => ""
      "dstip" => ""
      "rule_name" => ""
      "signature_rev" => ""
      "signature" => ""
      "signature_id" => ""
      "hostname" => ""
      "category" => ""
      "date_log" => ""
      "desc" => ""
      "time" => ""
      "srcport" => ""
      "dstport" => ""
      "proto" => ""
      "severity" => ""
      "classification" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "intermediary" => ""
      "security_result" => ""
      "net_proto" => ""
    }
  }
  mutate {
    gsub => ["message", "\\r\\n", " "]
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>(?P<date_log>%{MONTH} %{MONTHDAY} %{HOUR}:%{MINUTE}:%{SECOND}) %{DATA:inter_host} %{DATA}:.* pid\\(%{INT}\\)%{SPACE}%{DATA:alert}: %{NUMBER} %{NUMBER:severity} %{DATA:category} %{HOSTNAME:hostname} \\{%{DATA:event_time}\\} %{NUMBER} %{NUMBER} \\{%{DATA:rule_name}\\} %{IP:srcip} %{IP:dstip} %{NUMBER:proto} %{NUMBER:srcport} %{NUMBER:dstport} %{NUMBER} %{NUMBER:signature_id} %{NUMBER:signature_rev} %{NUMBER} %{NUMBER}",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:inter_host} snort\\[%{INT}\\]: \\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} \\[Classification: %{GREEDYDATA:classification}\\] \\[Priority: %{INT:severity}\\] \\{%{WORD:proto}\\} %{IP:srcip}:%{INT:srcport} -> %{IP:dstip}:%{INT:dstport}",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} snort\\[%{INT}\\]: \\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} \\[Classification: %{GREEDYDATA:classification}\\] \\[Priority: %{INT:severity}\\] \\{%{WORD}\\}(?P<a>.* %{IP:srcip} -> %{IP:dstip}.*)",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} snort\\[%{INT}\\]: \\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} \\[Classification: %{GREEDYDATA:classification}\\] \\[Priority: %{INT:severity}\\] \\{%{WORD}\\}(?P<a>.*%{IP:srcip} -> %{IP:dstip}.*)",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} snort\\[%{INT}\\]: %{GREEDYDATA}\\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} \\[Classification: %{GREEDYDATA:classification}\\] \\[Priority: %{INT:severity}\\] \\{%{WORD}\\}(?P<a>.* %{IP:srcip}:%{INT:srcport} -> %{IP:dstip}:%{INT:dstport}.*)",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} snort\\[%{INT}\\]: %{GREEDYDATA}\\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} \\[Classification: %{GREEDYDATA:classification}\\] \\[Priority: %{INT:severity}\\] \\{%{WORD}\\}(?P<a>.*%{IP:srcip}:%{INT:srcport} -> %{IP:dstip}:%{INT:dstport}.*)",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} snort\\[%{INT}\\]: %{GREEDYDATA}\\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} \\[Classification: %{GREEDYDATA:classification}\\] \\[Priority: %{INT:severity}\\] \\{%{WORD}\\}(?P<sec>.* %{IP:srcip} -> %{IP:dstip}.*)",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} snort\\[%{INT}\\]: %{GREEDYDATA}\\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} \\[Classification: %{GREEDYDATA:classification}\\] \\[Priority: %{INT:severity}\\] \\{%{WORD}\\}(?P<sec>.*%{IP:srcip} -> %{IP:dstip}.*)",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} snort\\[%{INT}\\]: \\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} %{IP:srcip} -> %{IP:dstip}",
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{IP:srcip} snort\\[%{INT}\\]: \\[%{INT}:%{INT}:%{INT}\\] %{GREEDYDATA:desc} \\[Classification: %{GREEDYDATA:classification}\\] \\[Priority: %{INT:severity}\\]: \\{%{WORD}\\} %{IP:srcip}:%{INT:srcport} -> %{IP:dstip}:%{INT:dstport}"
      ]
    }
    overwrite => ["inter_host","desc","time","date_log","category","srcip","dstip","rule_name","signature_rev","signature_id","hostname","proto","srcport","dstport","severity","classification"]
    on_error => "json_log_format"
  }
  if [hostname] =~ "ip-" {
    mutate {
      gsub => ["hostname", "ip-", ""]
    }
    mutate {
      gsub => ["hostname", "-", "."]
    }
  }
  grok {
    match => {
      "desc" => [
       "%{DATA} %{DATA:net_proto} %{GREEDYDATA}"
     ]
    }
    overwrite => ["net_proto"]
    on_error => "no_net_proto"
  }
  if [net_proto]!= "" {
    if [net_proto] in ["tcp","TCP"] {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.ip_protocol" => "TCP"
        }
        on_error => "no_net_proto"
      }
    }
  }
  mutate {
    gsub => ["desc", '\"', ""]
  }
  if [time] != "" {
    date {
      match => ["time" , "MMM  D HH:mm:ss","MMM  DD HH:mm:ss", "MMM d HH:mm:ss","MMM dd HH:mm:ss"]
      rebase => true
      on_error => "date_time_failure"
    }
  }

  if [json_log_format] {
    mutate {
      replace => {
        "files" => ""
        "app_proto" => ""
        "alert" => ""
        "agent" => ""
      }
    }
    mutate {
      gsub => ["message","@timestamp","event_timestamp"]
    }
    mutate {
      gsub => ["message",'\"message\":','\"inner_message\":']
    }
    json {
      source => "message"
      array_function => "split_columns"
      on_error => "json_format_error"
    }
    json {
      source => "inner_message"
      array_function => "split_columns"
      on_error => "inner_json_format_error"
    }
    if [json_format_error] and [inner_json_format_error] and [json_log_format] {
      drop{
        tag => "TAG_UNSUPPORTED"
      }
    }
    date {
      match => ["event_timestamp" , "ISO8601"]
    }
    if [metadata][version] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.product_version" => "%{metadata.version}"
        }
      }
    }
    if [src_ip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "src_ip"
        }
      }
    }
    if [dest_ip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "dest_ip"
        }
      }
    }
    if [src_port] != "" {
      mutate {
        convert => {
          "src_port" => "integer"
        }
      }
      mutate {
        rename => {
          "src_port" => "event.idm.read_only_udm.principal.port"
        }
      }
    }
    if [dest_port] != "" {
      mutate {
        convert => {
          "dest_port" => "integer"
        }
      }
      mutate {
        rename => {
          "dest_port" => "event.idm.read_only_udm.target.port"
        }
      }
    }
    if [proto] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.ip_protocol" => "%{proto}"
        }
      }
    }
    if [community_id] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.community_id" => "%{community_id}"
        }
      }
    }
    if [log][file][path] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.file.full_path" => "%{log.file.path}"
        }
      }
    }
    if [host][name] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{host.name}"
        }
      }
    }
    if [alert][rule] != "" {
      mutate {
        replace => {
          "rule" => "%{alert.rule}"
        }
      }
      grok {
        match => {
          "rule" => "%{WORD:action} %{WORD:protocol} %{NOTSPACE:srcnetwork} %{WORD:port} %{NOTSPACE:direction} %{NOTSPACE:dstnetwork} %{NOTSPACE:application_port} \\(%{GREEDYDATA:kv_keywords}"
        }
        overwrite => ["protocol", "srcnetwork", "action", "port", "kv_keywords"]
      }
      kv {
        source => "kv_keywords"
        field_split => ";"
        value_split => ":"
      }
    }
    if [alert][action] == "allowed" {
      mutate {
        replace => {
          "security_action" => "ALLOW"
        }
      }
    }
    else {
      mutate {
        replace => {
          "security_action" => "UNKNOWN_ACTION"
        }
      }
    }
    mutate {
      merge => {
        "security_result.action" => "security_action"
      }
    }

    if [alert] != "" {
      mutate {
        convert => {
          "alert.signature_id" => "string"
          "alert.rev" => "string"
        }
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "SCAN_NETWORK"
        }
      }
      mutate {
        replace => {
          "security_result.rule_name" => "%{alert.signature}"
          "security_result.rule_version" => "%{alert.rev}"
          "security_result.rule_id" => "%{alert.signature_id}"
        }
      }
      if [alert][rule] != ""{
        mutate {
          replace => {
            "security_result.summary" => "%{alert.rule}"
          }
        }
        mutate {
          gsub => ["security_result.summary", '\"', '']
        }
        if [classtype] not in ["","unknown"] {
          mutate {
            replace => {
              "security_result.rule_type" => "%{classtype}"
            }
          }
        }
      }
      if [alert][category] == "Potential Corporate Privacy Violation" {
        mutate {
          replace => {
            "category" => "POLICY_VIOLATION"
          }
        }
      }
      else if [alert][category] in ["A Network Trojan was detected","Potentially Bad Traffic"] {
        mutate {
          replace => {
            "category" => "NETWORK_MALICIOUS"
          }
        }
      }
      else if [alert][category] == "Unknown Traffic" {
        mutate {
          replace => {
            "category" => "NETWORK_SUSPICIOUS"
          }
        }
      }
      else if [alert][category] == "Attempted User Privilege Gain" {
        mutate {
          replace => {
            "category" => "AUTH_VIOLATION"
          }
        }
      }
      else {
        mutate {
          replace => {
            "category" => "UNKNOWN_CATEGORY"
          }
        }
      }

      mutate {
        merge => {
          "security_result.category" => "category"
          "security_result.category_details" => "alert.category"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
    if [alert][severity] >= 4 {
      mutate {
        replace => {
          "security_result.severity" => "LOW"
        }
      }
    }
    else if [alert][severity] == 2 or [alert][severity] == 3 {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    else if [alert][severity] == 1 {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
      }
    }
    else {
      mutate {
        replace => {
          "security_result.severity" => "UNKNOWN_SEVERITY"
        }
      }
    }

    if [files] != "" {
      for file in files {
        if [file][filename] not in ["","/"] {
          mutate {
            replace => {
              "security_result.about.file.full_path" => "%{file.filename}"
            }
          }
        }
        if [file][size] != "" {
          mutate {
            rename => {
              "file.size" => "security_result.about.file.size"
            }
            convert => {
              "security_result.about.file.size" => "uinteger"
            }
          }
        }
      }
    }
    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
      }
    }
    if [app_proto] != "" and [app_proto] in ["dns","smb","http"] {
      mutate {
        uppercase => ["app_proto"]
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.network.application_protocol" => "%{app_proto}"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.application_protocol" => "UNKNOWN_APPLICATION_PROTOCOL"
        }
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.observer.hostname" => "%{agent.hostname}"
      }
      on_error => "no_host"
    }

    if [agent] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.observer.application"      => "%{agent.type}"
          "event.idm.read_only_udm.observer.asset_id"         => "%{agent.type}:%{agent.id}"
          "event.idm.read_only_udm.observer.platform_version" => "%{agent.version}"
        }
      }
    }
  }
  else {
    if [inter_host] != "" {
      mutate {
        replace => {
          "intermediary.hostname" => "%{inter_host}"
          "intermediary.asset.hostname" => "%{inter_host}"
        }
        on_error => "no_intermediary"
      }
    }
    if [rule_name] != "" {
      mutate {
        replace => {
          "security_result.rule_name" => "%{rule_name}"
        }
        on_error => "no_rule_name"
      }
    }
    if [signature_rev] != "" {
      mutate {
        replace => {
          "security_result.rule_version" => "%{signature_rev}"
        }
        on_error => "no_signature_rev"
      }
    }
    if [signature_id] != "" {
      mutate {
        replace => {
          "security_result.rule_id" => "%{signature_id}"
        }
        on_error => "no_signature_id"
      }
    }
    if [hostname] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{hostname}"
          "event.idm.read_only_udm.principal.asset.hostname" => "%{hostname}"
        }
        on_error => "no_hostname"
      }
    }
    if [srcip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "srcip"
          "event.idm.read_only_udm.principal.asset.ip" => "srcip"
        }
        on_error => "no_srcip"
      }
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
    if [dstip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "dstip"
          "event.idm.read_only_udm.target.asset.ip" => "dstip"
        }
        on_error => "no_dstip"
      }
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
    if [srcport] != "" {
      mutate {
        convert => {
          "srcport" => "integer"
        }
        on_error => "no_srcport"
      }
      mutate {
        rename => {
          "srcport" => "event.idm.read_only_udm.principal.port"
        }
      }
    }
    if [dstport] != "" {
      mutate {
        convert => {
          "dstport" => "integer"
        }
        on_error => "no_dstport"
      }
      mutate {
        rename => {
          "dstport" => "event.idm.read_only_udm.target.port"
        }
      }
    }

    if [proto] != "" {
      mutate {
        replace => {
          "protocol_number_src" => "%{proto}"
        }
        on_error => "no_proto"
      }
      mutate {
        convert => {
          "protocol_number_src" => "integer"
        }
        on_error => "conversion_failure"
      }
      if ![conversion_failure] {
        # This file contains the ip protocol convertor
# Document:
#   - https://www.iana.org/assignments/protocol-numbers/protocol-numbers.xhtml

# Interface:
# protocol_number_src (required): number with the value which represents the protocol
# ip_protocol_out: string that is either empty or contains ip protocol
#                  compatible to IpProtocol enum in udm.proto

mutate {
  replace => {
    "ip_protocol_out" => "UNKNOWN_IP_PROTOCOL"
  }
}


if [protocol_number_src] in [ 1, "ICMP", "ICMPV6", 58 ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ICMP"
    }
  }
} else if [protocol_number_src] in [ 2, "IGMP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "IGMP"
    }
  }
} else if [protocol_number_src] in [ 6, "TCP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "TCP"
    }
  }
} else if [protocol_number_src] in [ 17, "UDP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "UDP"
    }
  }
} else if [protocol_number_src] in [ 41, "IP6IN4" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "IP6IN4"
    }
  }
} else if [protocol_number_src] in [ 47, "GRE" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "GRE"
    }
  }
} else if [protocol_number_src] in [ 50, "ESP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ESP"
    }
  }
} else if [protocol_number_src] in [ 88, "EIGRP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "EIGRP"
    }
  }
}  else if [protocol_number_src] in [ 97, "ETHERIP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ETHERIP"
    }
  }
} else if [protocol_number_src] in [ 103, "PIM" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "PIM"
    }
  }
} else if [protocol_number_src] in [ 112, "VRRP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "VRRP"
    }
  }
}

        mutate {
          replace => {
            "event.idm.read_only_udm.network.ip_protocol" => "%{ip_protocol_out}"
            "has_network" => "true"
          }
          on_error => "no_ip_protocol"
        }
      }
    }
    if [severity] != "" {
      mutate {
        convert => {
          "severity" => "uinteger"
        }
        on_error => "no_severity"
      }
      if [severity] >= 4 {
        mutate {
          replace => {
            "security_result.severity" => "LOW"
          }
        }
      }
      else if [severity] == 2 or [severity] == 3 {
        mutate {
          replace => {
            "security_result.severity" => "MEDIUM"
          }
        }
      }
      else if [severity] == 1 {
        mutate {
          replace => {
            "security_result.severity" => "HIGH"
          }
        }
      }
      else {
        mutate {
          replace => {
            "security_result.severity" => "UNKNOWN_SEVERITY"
          }
        }
      }
    }
    if [category] != "" {
      if [category] == "trojan-activity" {
        mutate {
          replace => {
            "sec_category" => "NETWORK_MALICIOUS"
          }
        }
      }
      else if [category] == "policy-violation" {
        mutate {
          replace => {
            "sec_category" => "POLICY_VIOLATION"
          }
        }
      }
      else {
        mutate {
          replace => {
            "sec_category" => "UNKNOWN_CATEGORY"
          }
        }
      }
      mutate {
        merge => {
          "security_result.category" => "sec_category"
          "security_result.category_details" => "category"
        }
        on_error => "no_category"
      }
    }
    if [classification] != "" {
      mutate {
        replace => {
          "security_result.description" => "%{classification}"
        }
        on_error => "no_classification"
      }
    }
    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
        on_error => "no_security_result"
      }
    }
    if [intermediary] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.intermediary" => "intermediary"
        }
        on_error => "no_intermediary"
      }
    }
    if [date_log] != "" {
      date {
        match => ["date_log" , "MMM  d HH:mm:ss", "MMM dd HH:mm:ss"]
        rebase => true
        on_error => "date_log_failure"
      }
    }

    if [has_principal] == "true" and [has_target] == "true" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "SCAN_NETWORK"
        }
      }
    }
    else if [has_principal] == "true" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
  }
  if [desc] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{desc}"
      }
      on_error => "no_desc"
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "SNORT_IDS"
      "event.idm.read_only_udm.metadata.vendor_name" => "SNORT"
    }
  }
  # output the built event
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
