# Product: Digital Monitoring Products (DMP) Entre
# Category: Physical Security
# Supported Format: SYSLOG
# Reference: N/A
# Last Updated: 2020-09-23
# Copyright 2021 Chronicle LLC

filter {
    mutate {
        replace => {
            "inter_ip" => ""
            "inter_host" => ""
            "log_level" => ""
            "p_event_type" => ""
            "date" => ""
            "time" => ""
            "additional" => ""
            "security_result" => ""
            "intermediary" => ""
            "resource" => ""
            "event_time" => ""
            "data" => ""
            "userid" => ""
            "user_display_name" => ""
            "device_data" => ""
            "p_event_category" => ""
            "p_event_title" => ""
            "p_event_action" => ""
            "principal" => ""
            "principal_host" => ""
            "event.idm.read_only_udm.metadata.vendor_name" => "DMP"
            "event.idm.read_only_udm.metadata.product_name" => "ENTRE"
            "event_type" => "GENERIC_EVENT"
        }
    }

    # extracting field values
    grok {
        match => {
            "message" => "<%{INT}>%{SYSLOGTIMESTAMP} %{IPORHOST:inter_host} \\[(?P<product>.*?)\\] %{WORD:log_level}[ ]+-[ ]+Trigger: (?P<p_event_type>.*?) Time: %{DATE:date} %{TIME:time} %{GREEDYDATA:additional}"
        }

        overwrite => [
            "inter_host", "log_level", "p_event_type", "date", "time", "additional"
        ]
    }

    # setting intermediary.hostname / ip value extracted using grok filter
    if [inter_host] != "" {
        mutate {
            replace => {
                "inter_ip" => "%{inter_host}"
            }

            convert => {
                "inter_host" => "ipaddress"
            }

            on_error => "not_inter_ip"
        }

        if [not_inter_ip] {
            mutate {
                replace => {
                    "intermediary.hostname" => "%{inter_host}"
                }
            }
        } else {
            mutate {
                merge => {
                    "intermediary.ip" => "inter_ip"
                }
            }
        }
    }

    # setting security_result.severity_details and serverity value extracted using grok filter
    if [log_level] != "" {
        mutate {
            replace => {
                "security_result.severity_details" => "%{log_level}"
            }
        }

        if [log_level] == "INFO" {
            mutate {
                replace => {
                    "security_result.severity" => "LOW"
                }
            }
        } else if [log_level] == "WARNING" {
            mutate {
                replace => {
                    "security_result.severity" => "MEDIUM"
                }
            }
        } else if [log_level] == "ERROR" {
            mutate {
                replace => {
                    "security_result.severity" => "HIGH"
                }
            }
        }
    }

    # extracting fields from additional data
    grok {
        match => {
            "additional" => [
                "Device: (?P<device_data>.*?) Personnel record: (?P<user_display_name>.*?) Credential: (?P<userid>[\\d]+) Data: (?P<data>.*)"
                "Device: (?P<device_data>.*?) Data: (?P<data>.*)"
                "Device: (?P<device_data>.*?) Personnel record: (?P<user_display_name>.*?) Credential: (?P<userid>[\\d]+)"
                "Device: (?P<device_data>.*)[ ]+"
                "%{GREEDYDATA:dummy_data}"
            ]
        }

        overwrite => [
            "data", "userid", "user_display_name", "device_data"
        ]
    }

    # removing trailing spaces from device_data
    mutate {
        gsub => [
            "device_data", "[ \\t]+$", ""
        ]
    }

    # setting security_result.decription to "data" field extracted using grok filter
    if [data] != "" {
        mutate {
            replace => {
                "security_result.description" => "%{data}"
            }
        }
    }

    # setting principal.user.userid to "userid" field extracted using grok filter
    if [userid] != "" {
        mutate {
            replace => {
                "principal.user.userid" => "%{userid}"
            }
        }
    }

    # setting principal.user.user_display_name to "user_display_name" field extracted using grok filter
    if [user_display_name] != "" {
        mutate {
            replace => {
                "principal.user.user_display_name" => "%{user_display_name}"
            }
        }
    }

    # setting principal.location.name to "device_data" field extracted using grok filter
    if [device_data] != "" {
        grok {
            match => {
                "device_data" => [
                    "%{IPORHOST:principal_host}%{GREEDYDATA}"
                ]
            }

            overwrite => [
                "principal_host"
            ]
        }

        mutate {
            replace => {
                "principal.location.name" => "%{device_data}"
                "principal_ip" => "%{principal_host}"
            }

            convert => {
                "principal_host" => "ipaddress"
            }

            on_error => "not_principal_ip"
        }

        if [not_principal_ip] {
            mutate {
                replace => {
                    "principal.hostname" => "%{principal_ip}"
                }
            }
        } else {
            mutate {
                merge => {
                    "principal.ip" => "principal_ip"
                }
            }
        }
    }

    # preprocessing date and time before merging them
    mutate {
        gsub => [
            "date", " ", ""
        ]
    }

    mutate {
        gsub => [
            "time", " ", ""
        ]
    }

    # extracting event details from product's event data
    grok {
        match => {
            "p_event_type" => [
                "(?P<p_event_category>.*?) - (?P<p_event_title>.*?): (?P<p_event_action>.*)"
                "(?P<p_event_category>.*?) - (?P<p_event_title>.*)"
             ]
        }

        overwrite => [
            "p_event_action", "p_event_title", "p_event_category"
        ]
    }

    # setting time and other details related to event
    mutate {
        replace => {
            "event_time" => "%{date} %{time}"
            "security_result.summary" => "%{p_event_type}"
        }

        lowercase => [
            "p_event_action", "p_event_title", "p_event_category"
        ]
    }

    # setting event_type based on different fields and setting event specific UDM fields
    if [p_event_title] == "arming status" {
        mutate {
            replace => {
                "event_type" => "SETTING_MODIFICATION"
                "event.idm.read_only_udm.target.resource.name" => "Arming status"
                "event.idm.read_only_udm.target.resource.type" => "SETTING"
            }
        }
    } else if [p_event_action] == "set time" {
        mutate {
            replace => {
                "event_type" => "SETTING_MODIFICATION"
                "event.idm.read_only_udm.target.resource.name" => "Panel command"
                "event.idm.read_only_udm.target.resource.type" => "SETTING"
            }
        }
    } else if [p_event_action] == "automatic recall test ok" or
        [p_event_action] =~ "door (locked|unlocked)" or
        [p_event_action] =~ "zone (open|closed|forced open)"{
        mutate {
            replace => {
                "event_type" => "STATUS_HEARTBEAT"
            }
        }
    } else if [p_event_title] == "door access" and
        [p_event_action] == "door access granted" {
        mutate {
            replace => {
                "event_type" => "USER_BADGE_IN"
                "event.idm.read_only_udm.extensions.auth.type" => "PHYSICAL"
                "auth_mechanism" => "BADGE_READER"
                "event.idm.read_only_udm.target.location.name" => "%{device_data}"
                "principal" => ""
            }
        }

        mutate {
            merge => {
                "event.idm.read_only_udm.extensions.auth.mechanism" => "auth_mechanism"
            }

            replace => {
                "principal.user.user_display_name" => "%{user_display_name}"
                "principal.user.userid" => "%{userid}"
            }
        }
    }

    # if [p_event_title] == "historical events driver command" {
    #     mutate {
    #         replace => {
    #             "event_type" => "SERVICE_START"
    #         }
    #     }
    # }

    # if pricipal is empty at this point, setting it to intermediary host address
    # otherwise, it'll throw error.
    if [principal] == "" and [not_inter_ip] {
        mutate {
            replace => {
                "principal.hostname" => "%{inter_host}"
            }
        }
    } else if [principal] == "" {
        mutate {
            merge => {
                "principal.ip" => "inter_ip"
            }
        }
    }

    # merging security_result and intermediary fields and renaming principal
    mutate {
        merge => {
            "event.idm.read_only_udm.security_result" => "security_result"
            "event.idm.read_only_udm.intermediary" => "intermediary"
        }

        rename => {
            "principal" => "event.idm.read_only_udm.principal"
        }
    }

    #Handle GENERIC_EVENT, metadata.description
    if [event_type] == "GENERIC_EVENT" {
        mutate {
            replace => {
                "event.idm.read_only_udm.metadata.description" => "%{p_event_type}"
            }
        }
    }

    #Handle metadata.event_type
    mutate {
        replace => {
            "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
        }
    }

    # parsing date
    date {
        match => [
            "event_time", "M/d/yyyy HH:mm:ss", "MM/d/yyyy HH:mm:ss", "M/dd/yyyy HH:mm:ss", "MM/dd/yyyy HH:mm:ss"
        ]
    }

    mutate {
        merge => {
            "@output" => "event"
        }
    }
}
