# Product: ORACLE_NETSUITE
# Category: CASB
# Supported Format: JSON
# References: N/A
# Last Updated: 2026-04-06
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "ts" => ""
      "timestamp" => ""
      "TIMESTAMP" => ""
      "src_ip" => ""
      "ip" => ""
      "host" => ""
      "status" => ""
      "column2" => ""
      "hostname" => ""
      "action" => ""
      "column10" => ""
      "column7" => ""
      "column1" => ""
      "column3" => ""
      "column4" => ""
      "network" => ""
      "security" => ""
      "security_result" => ""
      "additional" => ""
      "principal" => ""
      "csv_message" => ""
      "target" => ""
      "msg" => ""
      "msg1" => ""
      "Login_Audit_Trail_IP_Address" => ""
      "Login_Audit_Trail_Application" => ""
      "Login_Audit_Trail_Request_URI" => ""
      "Login_Audit_Trail_Role" => ""
      "Login_Audit_Trail_Status" => ""
      "Login_Audit_Trail_User" => ""
      "Login_Audit_Trail_User_Agent" => ""
      "result" => ""
      "Login_Audit_Trail_Date" => ""
      "Login_Audit_Trail_Email_Address" => ""
      "Login_Audit_Trail_Detail" => ""
      "Login_Audit_Trail_Access_Token_Name" => ""
      "Login_Audit_Trail_Security_Challenge" => ""
      "preview" => ""
      "has_principal" => "false"
      "has_principal_user" => "false"
      "emailaddress" => ""
      "date" => ""
      "useragent" => ""
      "oauthappname" => ""
      "ipaddress" => ""
      "requesturi" => ""
      "role_id" => ""
      "oauthaccesstokenname" => ""
      "user" => ""
      "log_type" => ""
      "security_result_action" => ""
      "detail" => ""
      "secchallenge" => ""
      "Name" => ""
      "Email" => ""
      "Supervisor" => ""
      "Job_Title" => ""
      "Role_Change" => ""
      "Role_Change_Action" => ""
      "Role_Change_Date" => ""
    }
  }
  mutate {
    gsub => ["message" ,'\\r\\n', '']
  }
  mutate {
    gsub => ["message" ,'\\n', '']
  }
  mutate {
    gsub => ["message" ,'\\"Role Change Date\\"', '"Role_Change_Date"']
  }
  mutate {
    gsub => ["message" ,'\\"Role Change Action\\"', '"Role_Change_Action"']
  }
  mutate {
    gsub => ["message" ,'\\"Job Title\\"', '"Job_Title"']
  }
  mutate {
    gsub => ["message" ,'\\"Role Change\\"', '"Role_Change"']
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "message_not_json"
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{DATA:src_ip} custom_netsuite_logs(:|) %{MONTHDAY}-%{MONTH}-%{YEAR} %{HOUR}:%{MINUTE} %{DATA},%{GREEDYDATA:csv_message}"
        "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{DATA:src_ip} custom_netsuite_logs %{GREEDYDATA:msg}"
        "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{DATA:src_ip} custom_netsuite_logs(:|) %{GREEDYDATA:msg}"
        "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{DATA:src_ip} custom_netsuite_logs_json %{GREEDYDATA:msg1}"
      ]
    }
    overwrite => ["ts","src_ip","hostname", "ip", "action", "var", "path", "pv", "csv_message","msg", "msg1"]
    on_error => "no_grok"
  }
  if [emailaddress] =~ "^.+@.+$" {
    mutate {
      merge => {
        "principal.user.email_addresses" => "emailaddress"
      }
      on_error => "login_audits_email_error"
    }
  }
  if [date] != "" {
    date {
      match => ["date", "M/d/yyyy h:mm:ss a"]
      target => "metadata.event_timestamp"
      on_error => "login_audits_date_error"
    }
  }
  if [useragent] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{useragent}"
      }
      on_error => "login_audits_useragent_error"
    }
    mutate {
      replace => {
        "network.http.parsed_user_agent" => "%{useragent}"
      }
      on_error => "replace_user_agent_error"
    }
    mutate {
      convert => {
        "network.http.parsed_user_agent" => "parseduseragent"
      }
      on_error => "convert_user_agent_error"
    }
  }
  if [status] =~ "Success" or [Role_Change_Action] =~ "Added" {
    mutate {
      replace => {
        "security_result_action" => "ALLOW"
      }
    }
  }
  else if [status] =~ "Failure" {
    mutate {
      replace => {
        "security_result_action" => "BLOCK"
      }
    }
  }
  if [security_result_action] != "" {
    mutate {
      merge => {
        "security_result.action" => "security_result_action"
      }
      on_error => "security_result_action_merge_error"
    }
  }
  if [oauthappname] != "" {
    mutate {
      replace => {
        "principal.application" => "%{oauthappname}"
      }
      on_error => "login_audits_oauthappname_error"
    }
  }
  if [ipaddress] != "" {
    mutate {
      merge => {
        "principal.ip" => "ipaddress"
        "principal.asset.ip" => "ipaddress"
      }
      on_error => "login_audits_ipaddress_error"
    }
    if ![login_audits_ipaddress_error] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  mutate {
    convert => {
      "role" => "string"
    }
    on_error => "role_conversion_error"
  }
  mutate {
    replace => {
      "role_id" => "%{role}"
    }
    on_error => "role_id_error"
  }
  if [role_id] != "" {
    mutate {
      replace => {
        "login_audits_role_label.key" => "role_id"
        "login_audits_role_label.value" => "%{role}"
      }
      on_error => "login_audits_role_label_error"
    }
    if ![login_audits_role_label_error] {
      mutate {
        merge => {
          "principal.user.attribute.labels" => "login_audits_role_label"
        }
        on_error => "login_audits_role_merge_error"
      }
    }
  }
  if [oauthaccesstokenname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.extensions.auth.auth_details" => "%{oauthaccesstokenname}"
      }
      on_error => "oauthaccesstokenname_error"
    }
  }
  mutate {
    convert => {
      "user" => "string"
    }
    on_error => "user_conversion_error"
  }
  if [user] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{user}"
      }
      on_error => "login_audits_user_error"
    }
    if ![login_audits_user_error] {
      mutate {
        replace => {
          "has_principal_user" => "true"
        }
      }
    }
  }
  if [detail] != "" {
    mutate {
      replace => {
        "detail_label.key" => "detail"
        "detail_label.value.string_value" => "%{detail}"
      }
      on_error => "detail_label_error"
    }
    if ![detail_label_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "detail_label"
        }
        on_error => "detail_label_merge_error"
      }
    }
  }
  if [secchallenge] != "" {
    mutate {
      replace => {
        "sec_challenge_label.key" => "secchallenge"
        "sec_challenge_label.value.string_value" => "%{secchallenge}"
      }
      on_error => "sec_challenge_label_error"
    }
    if ![sec_challenge_label_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "sec_challenge_label"
        }
        on_error => "sec_challenge_label_merge_error"
      }
    }
  }
  if [requesturi] != "" {
    mutate {
      replace => {
        "api_type_label.key" => "requesturi"
        "api_type_label.value" => "%{requesturi}"
      }
      on_error => "api_type_label_error"
    }
    if ![api_type_label_error] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "api_type_label"
        }
        on_error => "api_type_label_merge_error"
      }
    }
  }
  if [Name] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{Name}"
      }
      on_error => "name_err"
    }
  }
  if [Email] =~ "^.+@.+$" {
    mutate {
      merge => {
        "principal.user.email_addresses" => "Email"
      }
      on_error => "role_email_err"
    }
  }
  if [Supervisor] != "" {
    mutate {
      replace => {
        "supervisor_label.key" => "supervisor"
        "supervisor_label.value" => "%{Supervisor}"
      }
      on_error => "supervisor_label_err"
    }
    if ![supervisor_label_err] {
      mutate {
        merge => {
          "principal.user.attribute.labels" => "supervisor_label"
        }
        on_error => "supervisor_merge_err"
      }
    }
  }
  if [Job_Title] != "" {
    mutate {
      replace => {
        "principal.user.title" => "%{Job_Title}"
      }
      on_error => "job_title_err"
    }
  }
  if [Role_Change_Date] != "" {
    date {
      match => ["Role_Change_Date", "M/d/yyyy h:mm a"]
      target => "metadata.event_timestamp"
      on_error => "role_date_err"
    }
  }
  if [log_type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{log_type}"
      }
      on_error => "no_log_type"
    }
  }
  if [Role_Change] != "" {
    mutate {
      replace => {
        "role_change_label.key" => "Role_Change"
        "role_change_label.value.string_value" => "%{Role_Change}"
      }
      on_error => "role_change_label_error"
    }
    if ![role_change_label_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "role_change_label"
        }
        on_error => "role_change_label_merge_error"
      }
    }
  }
  if [msg] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{msg}"
      }
      on_error => "no_description"
    }
  }
  mutate{
    gsub => ["msg1" ,'Login Audit Trail _ ', 'Login_Audit_Trail_']
  }
  mutate{
    gsub => ["msg1" ,'Email Address', 'Email_Address']
  }
  mutate{
    gsub => ["msg1" ,'IP Address', 'IP_Address']
  }
  mutate{
    gsub => ["msg1" ,'Request URI', 'Request_URI']
  }
  mutate{
    gsub => ["msg1" ,'User Agent', 'User_Agent']
  }

  json {
    source => "msg1"
    array_function => "split_columns"
    on_error => "msg1_not_json"
  }
  if ![msg1_not_json] {
    mutate {
      replace =>{
        "additional_preview" => ""
      }
    }
    if [preview] != "" {
      mutate{
        convert => {
          "preview" => "string"
        }
        on_error => "preview_coversion_error"
      }
      mutate {
        replace => {
          "additional_preview.key" => "preview"
          "additional_preview.value.string_value" => "%{preview}"
        }
        on_error => "no_preview"
      }
      if ![no_preview] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "additional_preview"
          }
          on_error => "preview_merge_failure"
        }
      }
    }
    if [result][Login_Audit_Trail_Date] != "" {
      mutate {
        convert => {
          "result.Login_Audit_Trail_Date" => "string"
        }
        on_error => "already_a_string"
      }
      date {
        match => ["result.Login_Audit_Trail_Date", "LDAP", "UNIX", "ISO8601", "dd-MMM-yyyy H:mm a"]
        target => "metadata.event_timestamp"
        on_error => "not_in_unix_or_iso_format"
      }
    }
    if [result][Login_Audit_Trail_Email_Address] != "" {
      mutate {
        merge => {
          "principal.user.email_addresses" => "result.Login_Audit_Trail_Email_Address"
        }
        on_error => "no_email_addresses"
      }
    }
    if [result][Login_Audit_Trail_IP_Address] != "" {
      mutate {
        replace => {
          "principal.asset.ip" => "%{result.Login_Audit_Trail_IP_Address}"
          "principal.ip" => "%{result.Login_Audit_Trail_IP_Address}"
        }
        on_error => "no_ip"
      }
    }
    if [result][Login_Audit_Trail_Request_URI] != "" {
      mutate {
        replace => {
          "target.url" => "%{result.Login_Audit_Trail_Request_URI}"
        }
        on_error => "no_request_uri"
      }
    }
    if [result][Login_Audit_Trail_Role] =~ "Administrator" {
      mutate {
        replace => {
          "role.type" => "ADMINISTRATOR"
        }
        on_error => "no_role"
      }
      mutate {
        merge => {
          "principal.user.attribute.roles" => "role"
        }
        on_error => "no_role_merge"
      }
    }

    if [result][Login_Audit_Trail_Status] != "" {
      mutate {
        replace => {
          "security_result.summary" => "%{result.Login_Audit_Trail_Status}"
        }
        on_error => "no_status"
      }
    }
    if [result][Login_Audit_Trail_User] != "" {
      mutate {
        replace => {
          "principal.user.userid" => "%{result.Login_Audit_Trail_User}"
        }
        on_error => "no_user"
      }
    }
    if [result][Login_Audit_Trail_User_Agent] != "" {
      mutate {
        replace => {
          "network.http.user_agent" => "%{result.Login_Audit_Trail_User_Agent}"
        }
        on_error => "no_user_agent"
      }
    }
    if [result][host] != "" {
      mutate {
        replace => {
          "principal.hostname" => "%{result.host}"
          "principal.asset.hostname" => "%{result.host}"
        }
        on_error => "no_hostname"
      }
    }
  }
  csv {
    source => "csv_message"
    separator => ","
    on_error => "not_csv"
  }
  if [csv_message] != "" {
    grok {
      match => {
        "csv_message" =>[
          "%{DATA:Login_Audit_Trail_User},%{DATA:Login_Audit_Trail_Email_Address},%{IP:Login_Audit_Trail_IP_Address},%{DATA:Login_Audit_Trail_Status},%{DATA:Login_Audit_Trail_Role},(%{DATA:Login_Audit_Trail_Detail})?,%{DATA:Login_Audit_Trail_Request_URI},(%{DATA:Login_Audit_Trail_Security_Challenge})?,(%{DATA:Login_Audit_Trail_Access_Token_Name})?,(%{DATA:Login_Audit_Trail_Application})?,%{GREEDYDATA:Login_Audit_Trail_User_Agent}",
          "%{DATA:date},%{DATA:Login_Audit_Trail_Email_Address},%{IP:Login_Audit_Trail_IP_Address},%{DATA:Login_Audit_Trail_Status},%{DATA:Login_Audit_Trail_Role},,%{DATA:Login_Audit_Trail_Request_URI},,,%{DATA:Login_Audit_Trail_Application},%{GREEDYDATA:Login_Audit_Trail_User_Agent}"
        ]
      }
      overwrite => ["Login_Audit_Trail_User", "Login_Audit_Trail_Email_Address", "Login_Audit_Trail_IP_Address", "Login_Audit_Trail_Status", "Login_Audit_Trail_Role", "Login_Audit_Trail_Request_URI", "Login_Audit_Trail_Application", "Login_Audit_Trail_User_Agent","Login_Audit_Trail_Detail", "Login_Audit_Trail_Access_Token_Name", "Login_Audit_Trail_Security_Challenge"]
      on_error => "csv_failed"
    }
  }
  if [Login_Audit_Trail_Access_Token_Name] != "" {
    mutate {
      replace => {
        "Login_Audit_Trail_Access_Token_Name_label.key" => "Login_Audit_Trail_Access_Token_Name"
        "Login_Audit_Trail_Access_Token_Name_label.value.string_value" => "%{Login_Audit_Trail_Access_Token_Name}"
      }
      on_error => "no_Login_Audit_Trail_Access_Token_Name"
    }
    if ![no_Login_Audit_Trail_Access_Token_Name] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "Login_Audit_Trail_Access_Token_Name_label"
        }
        on_error => "no_Login_Audit_Trail_Access_Token_Name_label_merge"
      }
    }
  }
  if [Login_Audit_Trail_Security_Challenge] != "" {
    mutate {
      replace => {
        "Login_Audit_Trail_Security_Challenge_label.key" => "Login_Audit_Trail_Security_Challenge"
        "Login_Audit_Trail_Security_Challenge_label.value" => "%{Login_Audit_Trail_Security_Challenge}"
      }
      on_error => "no_Login_Audit_Trail_Security_Challenge"
    }
    if ![no_Login_Audit_Trail_Security_Challenge] {
      mutate {
        merge => {
          "security_result.about.resource.attribute.labels" => "Login_Audit_Trail_Security_Challenge_label"
        }
        on_error => "no_Login_Audit_Trail_Security_Challenge_label_merge"
      }
    }
  }
  if [Login_Audit_Trail_User] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{Login_Audit_Trail_User}"
      }
      on_error => "no_user"
    }
    if ![no_user] {
      mutate {
        replace => {
          "has_principal_user" => "true"
        }
      }
    }
  }
  if [Login_Audit_Trail_Request_URI] != "" {
    mutate {
      replace => {
        "target.url" => "%{Login_Audit_Trail_Request_URI}"
      }
      on_error => "no_request_uri"
    }
  }
  if [Login_Audit_Trail_Status] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{Login_Audit_Trail_Status}"
      }
      on_error => "no_status"
    }
  }
  if [Login_Audit_Trail_Application] != "" {
    mutate {
      replace => {
        "principal.application" => "%{Login_Audit_Trail_Application}"
      }
      on_error => "no_application"
    }
  }
  if [Login_Audit_Trail_Role] =~ "Administrator" {
    mutate {
      replace => {
        "role.type" => "ADMINISTRATOR"
      }
      on_error => "no_role"
    }
  }
  else {
    mutate {
      replace => {
        "Login_Audit_Trail_Role_label.key" => "role"
        "Login_Audit_Trail_Role_label.value" => "%{Login_Audit_Trail_Role}"
      }
      on_error => "no_Login_Audit_Trail_Role"
    }
    if ![no_Login_Audit_Trail_Role] && [Login_Audit_Trail_Role] != "" {
      mutate {
        merge => {
          "principal.user.attribute.labels" => "Login_Audit_Trail_Role_label"
        }
        on_error => "no_Login_Audit_Trail_Role_label_merge"
      }
    }
  }
  if [Login_Audit_Trail_Role] != "" {
    mutate {
      merge => {
        "principal.user.attribute.roles" => "role"
      }
      on_error => "no_role_merge"
    }
  }
  if [Login_Audit_Trail_User_Agent] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{Login_Audit_Trail_User_Agent}"
      }
      on_error => "no_user_agent"
    }
  }

  mutate {
    replace => {
      "action" => "%{column4}"
    }
    on_error => "action_error"
  }
  mutate {
    gsub => ["src_ip" ,"-" ,"."]
  }
  mutate {
    gsub => ["src_ip" ,"ip." ,""]
  }
  if [ts] != "" {
    date {
      match => ["ts", "MMM d HH:mm:ss", "MMM  dd HH:mm:ss" ]
      rebase => true
      on_error => "diff_format"
      target => "metadata.event_timestamp"
    }
  }
  if [column2]  != "" {
    mutate {
      merge => {
        "principal.user.email_addresses" => "column2"
      }
      on_error => "no_email_addresses"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [action] != "" {
    if [action] in ["Success","SUCCESS"] {
      mutate {
        replace => {
          "security_result_action" => "ALLOW"
        }
      }
    }
    else {
      mutate {
        replace => {
          "security_result_action" => "BLOCK"
        }
      }
    }
    mutate {
      merge => {
        "security_result.action" => "security_result_action"
      }
      on_error => "no_action"
    }
  }
  if [Login_Audit_Trail_Detail] != "" {
    mutate {
      replace => {
        "Login_Audit_Trail_Detail_label.key" => "Login_Audit_Trail_Detail"
        "Login_Audit_Trail_Detail_label.value.string_value" => "%{Login_Audit_Trail_Detail}"
      }
      on_error => "no_Login_Audit_Trail_Detail"
    }
    if ![no_Login_Audit_Trail_Detail] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "Login_Audit_Trail_Detail_label"
        }
        on_error => "no_Login_Audit_Trail_Detail_merge"
      }
    }
  }
  if [column7] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{column7}"
      }
      on_error => "no_path"
    }
  }
  if [column1] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{column1}"
      }
      on_error => "no_product_event_type"
    }
  }
  if [column10] != "" {
    mutate {
      replace => {
        "principal.application" => "%{column10}"
      }
      on_error => "no_region"
    }
  }
  if [column3] != "" {
    mutate {
      merge => {
        "principal.asset.ip" => "column3"
        "principal.ip" => "column3"
      }
      on_error => "no_ip"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [src_ip] != "" {
    mutate {
      merge => {
        "principal.asset.ip" => "src_ip"
        "principal.ip" => "src_ip"
      }
      on_error => "no_ip"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [has_principal] == "true" and [has_principal_user] == "true" and [log_type] =~ "login" and [requesturi] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }
  else if [has_principal_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
