# Product: PROOFPOINT_SER
# Category: Email server
# Supported Format: JSON
# Reference: See below
# Last Updated: 2025-01-02
# Copyright 2025 Chronicle LLC

filter {
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "additional" => ""
      "event_type" => ""
      "applicationName" => ""
      "applicationUserName" => ""
      "fromEnvelope" => ""
      "fromHeader" => ""
      "userId" => ""
      "senderId" => ""
      "senderName" => ""
      "status" => ""
      "details" => ""
      "date" => ""
      "data.throughputLimit" => ""
      "data.averageDailyThroughput" => ""
      "data.throughputForecast" => ""
      "data.remainingThroughput" => ""
      "data.acceptedThroughput" => ""
      "data.licenseStartDate" => ""
      "data.licenseEndDate" => ""
      "data.average7DayThroughput" => ""
      "data.average30DayThroughput" => ""
      "data.requestedMessages" => ""
      "data.acceptedMessages" => ""
      "data.sentMessages" => ""
      "data.deliveredMessages" => ""
      "data.avgAcceptedMessageSize" => ""
      "data.blockedMessages" => ""
      "data.name" => ""
      "data.quarantinedMessages" => ""
      "data.rejectedMessages" => ""
      "data.relayUserId" => ""
      "data.requestedThroughput" => ""
      "data.totalMessages" => ""
      "data.undeliveredMessages" => ""
      "data.date" => ""
      "data.throughput" =>""
      "data.totalThroughput" => ""
      "user_present" => ""
      "log_metadata.totalThroughput" => ""
      "json_data" => ""
      "invalid_json" => "false"
      "principal_host" => ""
      "principal_port" => ""
      "desc" => ""
    }
  }
  mutate {
    gsub => ["message","totalThrouhgput", "totalThroughput"]
  }
  mutate {
    gsub=> ["message","metadata","log_metadata"]
  }
  mutate {
      gsub => ["message","'",'"']
  }
   mutate {
      gsub => ["message","\\[",""]
  }
  mutate {
      gsub => ["message","\\]",""]
  }

  if [message] =~ "acceptedMessages" {
    mutate {
      replace => {
        "message" => "{\"data\":%{message}}"
      }
    }
  }

  # parse log as json
  json {
    source         => "message"
    array_function => "split_columns"
    on_error       => "not_a_json"
  }
  if [not_a_json] {
    grok {
      match => {
        "message" => "\\\"%{GREEDYDATA:json_data}\\\""
      }
      on_error => "grok_error"
      overwrite => ["json_data"]
    }
  }
  if [json_data] != "" {
    json {
      source         => "json_data"
      array_function => "split_columns"
      on_error       => "not_json"
    }
    if [not_json] {
      mutate {
        replace => {
          "invalid_json" => "true"
        }
      }
    }
  }
  grok {
    match => {
      "message" => "%{DATA}(host=\\\"%{DATA:principal_host}\\\", port=%{INT:principal_port}%{DATA}): %{GREEDYDATA:desc}"
    }
    on_error => "grok_error"
    overwrite => ["desc", "principal_host", "principal_port"]
  }
# parse log as json
  if[principal_host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{principal_host}"
        "principal.asset.hostname" => "%{principal_host}"
      }
      on_error => "no_principal_host"
    }
  }
  if[principal_port] != "" {
   mutate {
      replace => {
        "principal.port" => "%{principal_port}"
      }
      on_error => "no_principal_port"
    }
    mutate {
      convert => {
        "principal.port" => "integer"
      }
      on_error => "not_an_integer"
    }
  }
  if[desc] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{desc}"
      }
      on_error => "no_description"
    }
  }
  if [invalid_json] == "true" and [grok_error] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  if [data][date] != "" {
    date{
      match => ["data.date","yyyy-MM-dd"]
      on_error => "no_date"
    }
  }
  if [applicationName] != "" {
    mutate {
      replace => {
        "principal.administrative_domain" => "%{applicationName}"
      }
      on_error => "no_applicationName"
    }
  }

  if [applicationUserName] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{applicationUserName}"
        "user_present" => "true"
      }
      on_error => "no_applicationUserName"
    }
  }

  if [fromEnvelope] != "" and [fromEnvelope] =~ "^.+@.+$" {
    mutate {
      replace => {
        "network.email.bounce_address" => "%{fromEnvelope}"
        "user_present" => "true"
      }
      on_error => "no_fromEnvelope"
    }
  }

  if [fromHeader] != "" and [fromHeader] =~ "^.+@.+$" {
    mutate {
      replace => {
        "network.email.from" => "%{fromHeader}"
        "user_present" => "true"
      }
      on_error => "no_fromHeader"
    }
  }

  if [userId] != "" {
    mutate {
      replace => {
        "principal.user.product_object_id" => "%{userId}"
        "user_present" => "true"
      }
      on_error => "no_userId"
    }
  }

  if [senderId] != "" {
    mutate {
      replace => {
        "target.user.product_object_id" => "%{senderId}"
        "user_present" => "true"
      }
      on_error => "no_senderId"
    }
  }

  if [senderName] != "" {
    mutate {
      replace => {
        "target.administrative_domain" => "%{senderName}"
      }
      on_error => "no_senderName"
    }
  }

  if [status] != "" {
    for key, value in status map {
      mutate {
        replace => {
          "map_label" => ""
        }
      }
      mutate {
        convert => {
          "value" => "string"
        }
        on_error => "already_string"
      }
      mutate {
        replace => {
          "map_label.key" => "%{key}"
          "map_label.value.string_value" => "%{value}"
        }
        merge => {
          "additional.fields" => "map_label"
        }
        on_error => "no_map_key_value"
      }
    }
  }

  if [details] != "" {
    for key, value in details map {
      if [key] == "NULL" {
        mutate {
          replace => {
            "map_label" => ""
          }
        }
        mutate {
          convert => {
            "value" => "string"
          }
          on_error => "already_string"
        }
        mutate {
          replace => {
            "map_label.key" => "%{key}"
            "map_label.value.string_value" => "%{value}"
          }
          merge => {
            "additional.fields" => "map_label"
          }
          on_error => "no_map_key_value"
        }
      }
      else {
        for key1, value1 in value map {
          for key2, value2 in value1 map {
            mutate {
              replace => {
                "nested_key" => "%{key}.%{key1}.%{key2}"
              }
            }
            mutate {
              replace => {
                "map_label" => ""
              }
            }
            mutate {
              convert => {
                "value2" => "string"
              }
              on_error => "already_string"
            }
            mutate {
              replace => {
                "map_label.key" => "%{nested_key}"
                "map_label.value.string_value" => "%{value2}"
              }
              merge => {
                "additional.fields" => "map_label"
              }
              on_error => "no_map_key_value"
            }
          }
        }
      }
    }
  }

  if [data][throughputLimit] != "" {
    mutate {
      replace => {
        "throughputLimit_label.key" => "throughputLimit"
        "throughputLimit_label.value.string_value" => "%{data.throughputLimit}"
      }
      on_error => "no_throughputLimit"
    }
    if ! [no_throughputLimit] {
      mutate {
        merge => {
          "additional.fields" => "throughputLimit_label"
        }
        on_error => "no_throughputLimit"
      }
    }
  }
  if[data][throughput]!=""{
    mutate {
      replace => {
        "throughput_label.key" => "throughput"
        "throughput_label.value.string_value" => "%{data.throughput}"
      }
      on_error => "no_throughput"
    }
    if ! [no_throughput] {
      mutate {
        merge => {
          "additional.fields" => "throughput_label"
        }
        on_error => "no_throughput"
      }
    }
  }
  if [data][totalThroughput] != "" {
    mutate {
      replace => {
        "data_totalThroughput_label.key" => "data_totalThroughput"
        "data_totalThroughput_label.value.string_value" => "%{data.totalThroughput}"
      }
      on_error => "no_data_totalThroughput"
    }
    if ! [no_data_totalThroughput] {
      mutate {
        merge => {
          "additional.fields" => "data_totalThroughput_label"
        }
        on_error => "no_data_totalThroughput"
      }
    }
  }
  if [log_metadata][totalThroughput] != "" {
    mutate {
      replace => {
        "metadata_totalThroughput_label.key" => "metadata_totalThroughput"
        "metadata_totalThroughput_label.value.string_value" => "%{log_metadata.totalThroughput}"
      }
      on_error => "no_metadata_totalThroughput"
    }
    if ! [no_metadata_totalThroughput] {
      mutate {
        merge => {
          "additional.fields" => "metadata_totalThroughput_label"
        }
        on_error => "_no_metadata_totalThroughput"
      }
    }
  }

  if [data][averageDailyThroughput] != "" {
    mutate {
      replace => {
        "averageDailyThroughput_label.key" => "averageDailyThroughput"
        "averageDailyThroughput_label.value.string_value" => "%{data.averageDailyThroughput}"
      }
      on_error => "no_averageDailyThroughput"
    }
    if ! [no_averageDailyThroughput] {
      mutate {
        merge => {
          "additional.fields" => "averageDailyThroughput_label"
        }
        on_error => "no_averageDailyThroughput"
      }
    }
  }

  if [data][throughputForecast] != "" {
    mutate {
      replace => {
        "throughputForecast_label.key" => "throughputForecast"
        "throughputForecast_label.value.string_value" => "%{data.throughputForecast}"
      }
      on_error => "no_throughputForecast"
    }
    if ! [no_throughputForecast] {
      mutate {
        merge => {
          "additional.fields" => "throughputForecast_label"
        }
        on_error => "no_throughputForecast"
      }
    }
  }

  if [data][remainingThroughput] != "" {
    mutate {
      replace => {
        "remainingThroughput_label.key" => "remainingThroughput"
        "remainingThroughput_label.value.string_value" => "%{data.remainingThroughput}"
      }
      on_error => "no_remainingThroughput"
    }
    if ! [no_remainingThroughput] {
      mutate {
        merge => {
          "additional.fields" => "remainingThroughput_label"
        }
        on_error => "no_remainingThroughput"
      }
    }
  }

  if [data][acceptedThroughput] != "" {
    mutate {
      replace => {
        "acceptedThroughput_label.key" => "acceptedThroughput"
        "acceptedThroughput_label.value.string_value" => "%{data.acceptedThroughput}"
      }
      on_error => "no_acceptedThroughput"
    }
    if ! [no_acceptedThroughput] {
      mutate {
        merge => {
          "additional.fields" => "acceptedThroughput_label"
        }
        on_error => "no_acceptedThroughput"
      }
    }
  }

  if [data][licenseStartDate] != "" {
    mutate {
      replace => {
        "licenseStartDate_label.key" => "licenseStartDate"
        "licenseStartDate_label.value.string_value" => "%{data.licenseStartDate}"
      }
      on_error => "no_licenseStartDate"
    }
    if ! [no_licenseStartDate] {
      mutate {
        merge => {
          "additional.fields" => "licenseStartDate_label"
        }
        on_error => "no_licenseStartDate"
      }
    }
  }

  if [data][licenseEndDate] != "" {
    mutate {
      replace => {
        "licenseEndDate_label.key" => "licenseEndDate"
        "licenseEndDate_label.value.string_value" => "%{data.licenseEndDate}"
      }
      on_error => "no_licenseEndDate"
    }
    if ! [no_licenseEndDate] {
      mutate {
        merge => {
          "additional.fields" => "licenseEndDate_label"
        }
        on_error => "no_licenseEndDate"
      }
    }
  }

  if [data][average7DayThroughput] != "" {
    mutate {
      replace => {
        "average7DayThroughput_label.key" => "average7DayThroughput"
        "average7DayThroughput_label.value.string_value" => "%{data.average7DayThroughput}"
      }
      on_error => "no_average7DayThroughput"
    }
    if ! [no_average7DayThroughput] {
      mutate {
        merge => {
          "additional.fields" => "average7DayThroughput_label"
        }
        on_error => "no_average7DayThroughput"
      }
    }
  }

  if [data][average30DayThroughput] != "" {
    mutate {
      replace => {
        "average30DayThroughput_label.key" => "average30DayThroughput"
        "average30DayThroughput_label.value.string_value" => "%{data.average30DayThroughput}"
      }
      on_error => "no_average30DayThroughput"
    }
    if ! [no_average30DayThroughput] {
      mutate {
        merge => {
          "additional.fields" => "average30DayThroughput_label"
        }
        on_error => "no_average30DayThroughput"
      }
    }
  }

  if [data][requestedMessages] != "" {
    mutate {
      convert => {
        "data.requestedMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "requestedMessages_label.key" => "requestedMessages"
        "requestedMessages_label.value.string_value" => "%{data.requestedMessages}"
      }
      on_error => "no_requestedMessages"
    }
    if ! [no_requestedMessages] {
      mutate {
        merge => {
          "additional.fields" => "requestedMessages_label"
        }
        on_error => "no_requestedMessages"
      }
    }
  }

  if [data][acceptedMessages] != "" {
    mutate {
      convert => {
        "data.acceptedMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "acceptedMessages_label.key" => "acceptedMessages"
        "acceptedMessages_label.value.number_value" => "%{data.acceptedMessages}"
      }
      on_error => "no_acceptedMessages"
    }
    mutate {
      convert => {
        "acceptedMessages_label.value.number_value" => "float"
      }
      on_error => "no_acceptedMessages"
    }
    if ! [no_acceptedMessages] {
      mutate {
        merge => {
          "additional.fields" => "acceptedMessages_label"
        }
        on_error => "no_acceptedMessages"
      }
    }
  }

  if [data][sentMessages] != "" {
    mutate {
      convert => {
        "data.sentMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "sentMessages_label.key" => "sentMessages"
        "sentMessages_label.value.number_value" => "%{data.sentMessages}"
      }
      on_error => "no_sentMessages"
    }
    mutate {
      convert => {
        "sentMessages_label.value.number_value" => "float"
      }
      on_error => "no_sentMessages"
    }
    if ! [no_sentMessages] {
      mutate {
        merge => {
          "additional.fields" => "sentMessages_label"
        }
        on_error => "no_sentMessages"
      }
    }
  }

  if [data][deliveredMessages] != "" {
    mutate {
      convert => {
        "data.deliveredMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "deliveredMessages_label.key" => "deliveredMessages"
        "deliveredMessages_label.value.number_value" => "%{data.deliveredMessages}"
      }
      on_error => "no_deliveredMessages"
    }
    mutate {
      convert => {
        "deliveredMessages_label.value.number_value" => "float"
      }
      on_error => "no_deliveredMessages"
    }
    if ! [no_deliveredMessages] {
      mutate {
        merge => {
          "additional.fields" => "deliveredMessages_label"
        }
        on_error => "no_deliveredMessages"
      }
    }
  }

  if [data][avgAcceptedMessageSize] != "" {
    mutate {
      replace => {
        "avgAcceptedMessageSize_label.key" => "avgAcceptedMessageSize"
        "avgAcceptedMessageSize_label.value.string_value" => "%{data.avgAcceptedMessageSize}"
      }
      on_error => "no_avgAcceptedMessageSize"
    }
    if ! [no_avgAcceptedMessageSize] {
      mutate {
        merge => {
          "additional.fields" => "avgAcceptedMessageSize_label"
        }
        on_error => "no_avgAcceptedMessageSize"
      }
    }
  }

  if [data][blockedMessages] != "" {
    mutate {
      convert => {
        "data.blockedMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "blockedMessages_label.key" => "blockedMessages"
        "blockedMessages_label.value.string_value" => "%{data.blockedMessages}"
      }
      on_error => "no_blockedMessages"
    }
    if ! [no_blockedMessages] {
      mutate {
        merge => {
          "additional.fields" => "blockedMessages_label"
        }
        on_error => "no_blockedMessages"
      }
    }
  }

  if [data][name] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{data.name}"
      }
      on_error => "no_name"
    }
  }

  if [data][quarantinedMessages] != "" {
    mutate {
      convert => {
        "data.quarantinedMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "quarantinedMessages_label.key" => "quarantinedMessages"
        "quarantinedMessages_label.value.string_value" => "%{data.quarantinedMessages}"
      }
      on_error => "no_quarantinedMessages"
    }
    if ! [no_quarantinedMessages] {
      mutate {
        merge => {
          "additional.fields" => "quarantinedMessages_label"
        }
        on_error => "no_quarantinedMessages"
      }
    }
  }

  if [data][rejectedMessages] != "" {
    mutate {
      convert => {
        "data.rejectedMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "rejectedMessages_label.key" => "rejectedMessages"
        "rejectedMessages_label.value.number_value" => "%{data.rejectedMessages}"
      }
      on_error => "no_rejectedMessages"
    }
    mutate {
      convert => {
        "rejectedMessages_label.value.number_value" => "float"
      }
      on_error => "no_rejectedMessages"
    }
    if ! [no_rejectedMessages] {
      mutate {
        merge => {
          "additional.fields" => "rejectedMessages_label"
        }
        on_error => "no_rejectedMessages"
      }
    }
  }

  if [data][relayUserId] != "" {
    mutate {
      replace => {
        "principal.user.product_object_id" => "%{data.relayUserId}"
        "user_present" => "true"
      }
      on_error => "no_relayUserId"
    }
  }

  if [data][requestedThroughput] != "" {
    mutate {
      replace => {
        "requestedThroughput_label.key" => "requestedThroughput"
        "requestedThroughput_label.value.string_value" => "%{data.requestedThroughput}"
      }
      on_error => "no_requestedThroughput"
    }
    if ! [no_requestedThroughput] {
      mutate {
        merge => {
          "additional.fields" => "requestedThroughput_label"
        }
        on_error => "no_requestedThroughput"
      }
    }
  }

  if [data][totalMessages] != "" {
    mutate {
      convert => {
        "data.totalMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "totalMessages_label.key" => "totalMessages"
        "totalMessages_label.value.number_value" => "%{data.totalMessages}"
      }
      on_error => "no_totalMessages"
    }
    mutate {
      convert => {
        "totalMessages_label.value.number_value" => "float"
      }
      on_error => "no_totalMessages"
    }
    if ! [no_totalMessages] {
      mutate {
        merge => {
          "additional.fields" => "totalMessages_label"
        }
        on_error => "no_totalMessages"
      }
    }
  }

  if [data][undeliveredMessages] != "" {
    mutate {
      convert => {
        "data.undeliveredMessages" => "string"
      }
      on_error => "not_a_string"
    }
    mutate {
      replace => {
        "undeliveredMessages_label.key" => "undeliveredMessages"
        "undeliveredMessages_label.value.string_value" => "%{data.undeliveredMessages}"
      }
      on_error => "no_undeliveredMessages"
    }
    if ! [no_undeliveredMessages] {
      mutate {
        merge => {
          "additional.fields" => "undeliveredMessages_label"
        }
        on_error => "no_undeliveredMessages"
      }
    }
  }

  if [user_present] != "" {
    mutate {
      replace => {
        "event_type" => "EMAIL_TRANSACTION"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "PROOFPOINT SER"
      "metadata.vendor_name" => "PROOFPOINT"
      "metadata.event_type" => "%{event_type}"
    }
    on_error => "no_event_type"
  }

  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
