# Product: MACOS ENDPOINT SECURITY
# Category: AV and endpoint logs
# Supported Format: SYSLOG + KV
# Reference: See below
# Last Updated: 2023-07-17
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "additional" => ""
      "security_result" => ""
      "timestamp" => ""
      "hostname" => ""
      "severity" => ""
      "kv_data" => ""
      "EventType" => ""
      "MachTimestamp" => ""
      "MessageVersion" => ""
      "MessageSequence" => ""
      "Executable" => ""
      "PID" => ""
      "PIDVersion" => ""
      "UID" => ""
      "RealGID" => ""
      "SessionID" => ""
      "ParentPID" => ""
      "CodesigningFlags" => ""
      "SigningID" => ""
      "TeamID" => ""
      "CodeDirectoryHash" => ""
      "ESClient" => ""
      "PlatformBinary" => ""
      "ExistingFile" => ""
      "File" => ""
      "TargetFile" => ""
      "TargetProcessExecutable" => ""
      "TargetProcessPID" => ""
      "TargetProcessPIDVersion" => ""
      "TargetProcessUID" => ""
      "TargetProcessRealGID" => ""
      "TargetProcessSessionID" => ""
      "TargetProcessParentPID" => ""
      "TargetProcessCodesigningFlags" => ""
      "TargetProcessSigningID" => ""
      "TargetProcessCodeDirectoryHash" => ""
      "TargetProcessESClient" => ""
      "TargetProcessPlatformBinary" => ""
      "TargetProcessArgs" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "%{TIMESTAMP_ISO8601:timestamp} %{DATA:hostname} %{WORD:severity} %{GREEDYDATA:kv_data}"
      ]
    }
    overwrite => ["timestamp", "hostname", "severity", "kv_data"]
    on_error => "grok_failed"
  }

  if [grok_failed] {
    drop {
      tag => "TAG_UNSPECIFIED"
    }
  }

  mutate {
    gsub => ["kv_data", " ([\\w-]+)=","#$1="]
  }
  kv {
    source => "kv_data"
    field_split => "#"
    value_split => "="
    trim_value => '\"'
  }

  if [timestamp] != "" {
    date {
      match => ["timestamp", "yyyy-MM-dd HH:mm:ss", "ISO8601"]
      target => "metadata.event_timestamp"
      on_error => "wrong_format"
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
      }
    }
  }

  if [severity] != "" {
    if [severity] =~ "(?i)Info" {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    }
    else if [severity] =~ "(?i)Error" {
      mutate {
        replace => {
          "security_result.severity" => "ERROR"
        }
      }
    }
    else if [severity] =~ "(?i)Warning" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    else {
      mutate {
        replace => {
          "security_result.severity" => "UNKNOWN_SEVERITY"
        }
      }
    }
  }

  if [EventType] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{EventType}"
      }
      on_error => "no_event_type"
    }
  }

  if [MessageSequence] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{MessageSequence}"
      }
      on_error => "no_message_sequence"
    }
  }

  if [MessageVersion] != "" {
    mutate {
      replace => {
        "message_version_label.key" => "MessageVersion"
        "message_version_label.value.string_value" => "%{MessageVersion}"
      }
      merge => {
        "additional.fields" => "message_version_label"
      }
      on_error => "no_message_version"
    }
  }

  if [Executable] != "" {
    mutate {
      replace => {
        "target.process.file.full_path" => "%{Executable}"
      }
      on_error => "no_executable"
    }
  }

  if [PID] != "" {
    mutate {
      replace => {
        "principal.process.pid" => "%{PID}"
      }
      on_error => "no_pid"
    }
  }

  if [ParentPID] != "" {
    mutate {
      replace => {
        "principal.process.parent_process.pid" => "%{ParentPID}"
      }
      on_error => "no_ppid"
    }
  }

  if [UID] != "" {
    mutate {
      replace => {
        "principal.resource.product_object_id" => "%{UID}"
      }
      on_error => "no_uid"
    }
  }

  if [RealGID] != "" {
    mutate {
      replace => {
        "principal.group.product_object_id" => "%{RealGID}"
      }
      on_error => "no_gid"
    }
  }

  if [SessionID] != "" {
    mutate {
      replace => {
        "network.session_id" => "%{SessionID}"
      }
      on_error => "no_sessionid"
    }
  }

  if [PIDVersion] != "" {
    mutate {
      replace => {
        "pid_version_label.key" => "PIDVersion"
        "pid_version_label.value.string_value" => "%{PIDVersion}"
      }
      merge => {
        "additional.fields" => "pid_version_label"
      }
      on_error => "no_pid_version"
    }
  }

  if [CodesigningFlags] != "" {
    mutate {
      replace => {
        "code_signing_flags_label.key" => "CodesigningFlags"
        "code_signing_flags_label.value.string_value" => "%{CodesigningFlags}"
      }
      merge => {
        "additional.fields" => "code_signing_flags_label"
      }
      on_error => "no_code_signing_flags"
    }
  }

  if [SigningID] != "" {
    mutate {
      replace => {
        "signing_id_label.key" => "SigningID"
        "signing_id_label.value.string_value" => "%{SigningID}"
      }
      merge => {
        "additional.fields" => "signing_id_label"
      }
      on_error => "no_signing_id"
    }
  }

  if [TeamID] != "" {
    mutate {
      replace => {
        "team_id_label.key" => "TeamID"
        "team_id_label.value.string_value" => "%{TeamID}"
      }
      merge => {
        "additional.fields" => "team_id_label"
      }
      on_error => "no_team_id"
    }
  }

  if [CodeDirectoryHash] != "" {
    mutate {
      replace => {
        "code_directory_hash_label.key" => "CodeDirectoryHash"
        "code_directory_hash_label.value.string_value" => "%{CodeDirectoryHash}"
      }
      merge => {
        "additional.fields" => "code_directory_hash_label"
      }
      on_error => "no_code_directory_hash"
    }
  }

  if [ESClient] != "" {
    mutate {
      replace => {
        "esc_client_label.key" => "ESClient"
        "esc_client_label.value.string_value" => "%{ESClient}"
      }
      merge => {
        "additional.fields" => "esc_client_label"
      }
      on_error => "no_esc_client"
    }
  }

  if [PlatformBinary] != "" {
    mutate {
      replace => {
        "platform_binary_label.key" => "PlatformBinary"
        "platform_binary_label.value.string_value" => "%{PlatformBinary}"
      }
      merge => {
        "additional.fields" => "platform_binary_label"
      }
      on_error => "no_platform_binary"
    }
  }

  if [ExistingFile] != "" {
    mutate {
      replace => {
        "existing_file_label.key" => "ExistingFile"
        "existing_file_label.value.string_value" => "%{ExistingFile}"
      }
      merge => {
        "additional.fields" => "existing_file_label"
      }
      on_error => "no_existing_file"
    }
  }

  if [File] != "" {
    mutate {
      replace => {
        "principal.process.file.full_path" => "%{File}"
      }
      on_error => "no_file"
    }
  }

  if [TargetFile] != "" {
    mutate {
      replace => {
        "target.file.full_path" => "%{TargetFile}"
      }
      on_error => "no_file"
    }
  }

  if [TargetProcessExecutable] != "" {
    mutate {
      replace => {
        "target_executable_label.key" => "TargetProcessExecutable"
        "target_executable_label.value.string_value" => "%{TargetProcessExecutable}"
      }
      merge => {
        "additional.fields" => "target_executable_label"
      }
      on_error => "no_target_executable"
    }
  }

  if [TargetProcessSessionID] != "" {
    mutate {
      replace => {
        "target_session_id_label.key" => "TargetProcessSessionID"
        "target_session_id_label.value.string_value" => "%{TargetProcessSessionID}"
      }
      merge => {
        "additional.fields" => "target_session_id_label"
      }
      on_error => "no_target_session_id"
    }
  }

  if [TargetProcessPID] != "" {
    mutate {
      replace => {
        "target.process.pid" => "%{TargetProcessPID}"
      }
      on_error => "no_target_pid"
    }
  }

  if [TargetProcessParentPID] != "" {
    mutate {
      replace => {
        "target.process.parent_process.pid" => "%{TargetProcessParentPID}"
      }
      on_error => "no_target_ppid"
    }
  }

  if [TargetProcessUID] != "" {
    mutate {
      replace => {
        "target.resource.product_object_id" => "%{TargetProcessUID}"
      }
      on_error => "no_target_uid"
    }
  }

  if [TargetProcessRealGID] != "" {
    mutate {
      replace => {
        "printargetcipal.group.product_object_id" => "%{TargetProcessRealGID}"
      }
      on_error => "no_target_gid"
    }
  }

  if [TargetProcessPIDVersion] != "" {
    mutate {
      replace => {
        "target_pid_version_label.key" => "TargetProcessPIDVersion"
        "target_pid_version_label.value.string_value" => "%{TargetProcessPIDVersion}"
      }
      merge => {
        "additional.fields" => "target_pid_version_label"
      }
      on_error => "no_target_pid_version"
    }
  }

  if [TargetProcessCodesigningFlags] != "" {
    mutate {
      replace => {
        "target_code_signing_flags_label.key" => "TargetProcessCodesigningFlags"
        "target_code_signing_flags_label.value.string_value" => "%{TargetProcessCodesigningFlags}"
      }
      merge => {
        "additional.fields" => "target_code_signing_flags_label"
      }
      on_error => "no_target_code_signing_flags"
    }
  }

  if [TargetProcessSigningID] != "" {
    mutate {
      replace => {
        "target_signing_id_label.key" => "TargetProcessSigningID"
        "target_signing_id_label.value.string_value" => "%{TargetProcessSigningID}"
      }
      merge => {
        "additional.fields" => "target_signing_id_label"
      }
      on_error => "no_target_signing_id"
    }
  }

  if [TargetProcessCodeDirectoryHash] != "" {
    mutate {
      replace => {
        "target_code_directory_hash_label.key" => "TargetProcessCodeDirectoryHash"
        "target_code_directory_hash_label.value.string_value" => "%{TargetProcessCodeDirectoryHash}"
      }
      merge => {
        "additional.fields" => "target_code_directory_hash_label"
      }
      on_error => "no_target_code_directory_hash"
    }
  }

  if [TargetProcessESClient] != "" {
    mutate {
      replace => {
        "target_esc_client_label.key" => "TargetProcessESClient"
        "target_esc_client_label.value.string_value" => "%{TargetProcessESClient}"
      }
      merge => {
        "additional.fields" => "target_esc_client_label"
      }
      on_error => "no_target_esc_client"
    }
  }

  if [TargetProcessPlatformBinary] != "" {
    mutate {
      replace => {
        "target_platform_binary_label.key" => "TargetProcessPlatformBinary"
        "target_platform_binary_label.value.string_value" => "%{TargetProcessPlatformBinary}"
      }
      merge => {
        "additional.fields" => "target_platform_binary_label"
      }
      on_error => "no_target_platform_binary"
    }
  }

  if [TargetProcessArgs] != "" {
    mutate {
      replace => {
        "target.process.command_line" => "%{TargetProcessArgs}"
      }
      on_error => "no_process_args"
    }
  }

  mutate {
    replace => {
      "metadata.event_type" => "PROCESS_UNCATEGORIZED"
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "MACOS_ENDPOINT_SECURITY"
      "metadata.vendor_name" => "Apple"
    }
  }
  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

