# Product: Fireeye NX Audit
# Category: AUDIT
# Supported Format: Syslog
# Reference: https://www.commoncriteriaportal.org/files/epfiles/st_vid10641-vr.pdf
# Last Updated: 2024-05-01
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "time" => ""
      "hostname" => ""
      "mgmtd_int" => ""
      "mgmtd_type" => ""
      "audit" => ""
      "action_id" => ""
      "details" => ""
      "param" => ""
      "param_key"=> ""
      "value"=> ""
      "user" => ""
      "cli" => ""
      "priority" => ""
      "session_id"=> ""
      "cli_info" => ""
      "auth_detail" => ""
      "attribute_key"=> ""
      "attribute_value"=> ""
      "attribute_info"=> ""
      "attribute_val"=> ""
      "cli_data"=>""
      "database" => ""
      "config_change_id" =>""
      "items_changed"=> ""
      "security_result" => ""
      "additional_token" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "<%{INT:priority}>%{SYSLOGTIMESTAMP:time} %{HOSTNAME:hostname} mgmtd\\[%{INT:mgmtd_int}\\]: \\[mgmtd.%{DATA:mgmtd_type}\\]: AUDIT: \\(%{DATA:audit}\\) Action ID %{DATA:action_id}: %{GREEDYDATA:details}",
        "<%{INT:priority}>%{SYSLOGTIMESTAMP:time} %{HOSTNAME:hostname} cli\\[%{INT:cli}\\]: \\[cli.%{DATA:cli_type}\\]: AUDIT: \\(%{DATA:audit}\\) user %{DATA:user}: %{GREEDYDATA:cli_info}",
        "<%{INT:priority}>%{SYSLOGTIMESTAMP:time} %{HOSTNAME:hostname} su: \\(to %{DATA:database}\\) %{DATA:user} on",
        "<%{INT:priority}>%{SYSLOGTIMESTAMP:time} %{HOSTNAME:hostname} mgmtd\\[%{INT:mgmtd_int}\\]: \\[mgmtd.%{DATA:mgmtd_type}\\]: AUDIT: \\(%{DATA:audit}\\) Config change ID %{INT:config_change_id}: requested by: \\(%{DATA:user}\\) \\(session ID %{INT:session_id}\\), %{INT:items_changed} item\\(s\\) changed"
      ]
    }
    on_error => "not_grok"
    overwrite => ["priority", "time", "hostname", "mgmtd_int", "mgmtd_type",
     "audit", "action_id","database", "details", "user", "cli", "cli_type",
      "cli_info", "config_change_id", "items_changed", "session_id"]
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "FireEye"
      "event.idm.read_only_udm.metadata.product_name" => "Fireeye NX Audit"
      "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
    }
  }

  if [action_id] != "" {
    mutate {
      replace => {
        "action_id_label.key" => "ACTION ID"
        "action_id_label.value" => "%{action_id}"
      }
      on_error => "action_id_not_present"
    }

    if ![action_id_not_present] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "action_id_label"
        }
      }
    }
  }

  if [hostname] != "" {
    mutate {
        replace => {
            "event.idm.read_only_udm.principal.hostname" => "%{hostname}"
        }
        on_error => "invalid_hostname"
    }
  }

  if [mgmtd_int] != "" {
    mutate {
      replace => {
        "mgmtd_label.key" => "mgmtd"
        "mgmtd_label.value.string_value" => "%{mgmtd_int}"
      }
    }
    mutate {
      merge => {
        "additional_token.fields" => "mgmtd_label"
      }
    }
  }

  if [config_change_id] != "" {
    mutate {
      replace => {
        "config_change_id_label.key" => "config_change_id"
        "config_change_id_label.value.string_value" => "%{config_change_id}"
      }
    }
    mutate {
      merge => {
        "additional_token.fields" => "config_change_id_label"
      }
    }
  }

  if [items_changed] != "" {
    mutate {
      replace => {
        "items_changed_label.key" => "items_changed"
        "items_changed_label.value.string_value" => "%{items_changed}"
      }
    }
    mutate {
      merge => {
        "additional_token.fields" => "items_changed_label"
      }
    }
  }
  if [cli] != "" {
    mutate {
      replace => {
        "cli_label.key" => "cli"
        "cli_label.value.string_value" => "%{cli}"
      }
    }
    mutate {
      merge => {
        "additional_token.fields" => "cli_label"
      }
    }
  }

  if [database] != "" {
    mutate {
      replace => {
        "database_label.key" => "database"
        "database_label.value.string_value" => "%{database}"
      }
    }
    mutate {
      merge => {
        "additional_token.fields" => "database_label"
      }
    }
  }


  if [audit] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.log_type" => "AUDIT %{audit}"
      }
    }
  }

    # details field contains params information.
    grok {
        match => {
            "details" => ["param:\\s*(?P<param_key>.*): \\s*(?P<value>.*)"]
        }
        overwrite => ["param_key", "value"]
        on_error => "no_param"
    }
    mutate {
        gsub => ["param_key", " ", "_"]
    }

    if [param_key] in ["overwrite_existing",
    "curl_resource_file_with_username_and_password", "disable_proxy_url",
     "disable_curl_secure_mode",
     "Type_of_data_that_the_upload_client_should_treat_it_as",
     "path_to_an_additional_resource_file", "final_destination_directory",
      "use_the_filename_from_HTTP_Location_header_as_dst_file_name",
       "download_mode", "whether_to_use_the_default_resource_file",
        "Name_of_HTML_form_field_for_POST_request", "End_time_in_epoch",
         "Start_time_in_epoch", "Debug_options", "background_task_or_not",
          "destination_directory"] {
        mutate {
            replace => {
                "detail.key" => "%{param_key}"
                "detail.value.string_value" => "%{value}"
            }
        }
        mutate {
            merge => {
                "additional_token.fields" => "detail"
            }
        }
    }
    else if [param_key] == "destination_filename" {
        mutate {
            replace => {
                "event.idm.read_only_udm.target.file.full_path" => "%{value}"
            }
        }
    }
    else if [param_key] == "source_path" {
        mutate {
            replace => {
                "event.idm.read_only_udm.src.file.full_path" => "%{value}"
            }
        }
    }
    else if [param_key] == "action" {
        mutate {
            replace => {
                "security_result.action_details" => "%{value}"
            }
        }
    }
    else if [param_key] in ["remote_URL", "destination_URL"] {
        mutate {
            replace => {
                "event.idm.read_only_udm.target.url" => "%{value}"
            }
        }
    }

    # details field contains user and session id information.
    grok {
        match => {
            "details" => "\\s*(?P<attribute_key>.*):\\s*(?P<attribute_value>.*) \\(session ID %{INT:session_id}\\)"
        }
        on_error => "no_session_id"
        overwrite => ["session_id", "attribute_key", "attribute_value"]
    }

    mutate {
        gsub => ["attribute_key", " ", "_"]
    }

    if [attribute_key] == "requested_by" {
      mutate {
            replace => {
                "event.idm.read_only_udm.principal.user.userid"
                => "%{attribute_value}"
            }
        }
    }


    # details field contains descr, status information.
    grok {
        match => {
            "details" => "\\s*(?P<attribute_info>.*):\\s*(?P<attribute_val>.*)"
        }
        on_error => "no_status_or_descr"
        overwrite => ["attribute_info", "attribute_val"]
    }

    mutate {
        gsub => ["attribute_info", " ", "_"]
    }
    if [attribute_info] == "status" {
      mutate {
        replace => {
            "event.idm.read_only_udm.metadata.event_type"
            => "STATUS_UNCATEGORIZED"
        }
    }

      mutate {
            replace => {
                "security_result.summary"
                => "%{attribute_info} %{attribute_val}"
            }
        }
    }

    if [attribute_info] == "descr" {
      mutate {
            replace => {
                "security_result.description" => "%{attribute_val}"
            }
        }
    }

  # details field contains cli information.

  grok {
      match => {
          "cli_info" => "%{DATA:auth_detail} with session ID %{INT:session_id}"
      }
      on_error => "no_login_detail"
      overwrite => ["auth_detail", "session_id"]
  }

  if [cli_info] == "CLI exiting" {
    mutate {
        replace => {
            "event.idm.read_only_udm.metadata.event_type"
            => "SYSTEM_AUDIT_LOG_UNCATEGORIZED"
        }
    }
    mutate {
      replace => {
        "auth_detail_label.key" => "auth_detail"
        "auth_detail_label.value.string_value" => "%{cli_info}"
      }
    }
    mutate {
      merge => {
        "additional_token.fields" => "auth_detail_label"
      }
    }
  }

  if [auth_detail] != "" {
     mutate {
          replace => {
              "event.idm.read_only_udm.metadata.event_type"
              => "USER_UNCATEGORIZED"
          }
      }
    mutate {
      replace => {
        "auth_detail_label.key" => "auth_detail"
        "auth_detail_label.value.string_value" => "%{auth_detail}"
      }
    }
    mutate {
      merge => {
        "additional_token.fields" => "auth_detail_label"
      }
    }
  }

    grok {
        match => {
            "cli_info" => "\\s*(?P<cli_data>.*):\\s*(?P<cli_val>.*)"
        }
        on_error => "no_cli_info"
        overwrite => ["cli_data", "cli_val"]
    }

    mutate {
        gsub => ["cli_data", " ", "_"]
    }

    if [cli_data] == "Executing_command" {
      mutate {
          replace => {
              "event.idm.read_only_udm.metadata.event_type" => "PROCESS_LAUNCH"
          }
        }
      mutate {
            replace => {
                "event.idm.read_only_udm.target.process.command_line"
                => "%{cli_val}"
            }
        }
    }
    if [user] != "" {
      mutate {
            replace => {
                "event.idm.read_only_udm.principal.user.userid" => "%{user}"
            }
        }
    }

  if [session_id] != "" {
      mutate {
            replace => {
                "event.idm.read_only_udm.network.session_id" => "%{session_id}"
            }
      }
    }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  if [additional_token] != "" {
    mutate {
      rename => {
        "additional_token" => "event.idm.read_only_udm.additional"
      }
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
