# Product: MICROSOFT_IAS
# Category: Endpoint Security
# Supported Format: CSV + KV
# Reference: N/A
# Last Updated: 2024-04-25
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "target" => ""
      "metadata" => ""
      "principal" => ""
      "additional" => ""
      "network" => ""
      "security_result" => ""
      "time" => ""
      "nat_ip" => ""
      "userid" => ""
      "date" => ""
      "nas_port" => ""
      "user_name" => ""
      "date_time" => ""
      "auth_type" => ""
      "device-mac" => ""
      "device-type" => ""
      "policy_name" => ""
      "service_name" => ""
      "service_type" => ""
      "computer_name" => ""
      "filter_id" => ""
      "framed_mtu" => ""
      "packet_type" => ""
      "target_port" => ""
      "target_ip" => ""
      "kv_data" => ""
      "coa-push" => ""
      "ac-user-agent" => ""
      "session_id" => ""
      "device-uid" => ""
      "reason_code" => ""
      "reply_message" => ""
      "framed_address" => ""
      "framed_netmask" => ""
      "framed_protocol" => ""
      "framed_routing" => ""
      "nas_identifier" => ""
      "device-platform" => ""
      "session_duration" => ""
      "device-public-mac" => ""
      "called_station_id" => ""
      "calling_station_id" => ""
      "framed_compression" => ""
      "extensible_auth_protocol" => ""
      "device-platform-version" => ""
      "principal_ip" => ""
      "audit-session-id" => ""
      "principal_hostname" => ""
      "principal_present" => "false"
      "target_present" => "false"
      "user_present" => "false"
    }
  }

  mutate {
    gsub => ["message","mdm-tlv=",""]
  }

  grok {
    match => {
      "message" => "%{IP:nat_ip},%{DATA:userid},%{DATA:date},%{DATA:time},%{DATA:service_name},%{DATA:computer_name},%{GREEDYDATA:kv_data}"
    }
    overwrite => ["nat_ip","userid","date","time","service_name","computer_name","kv_data"]
    on_error => "pattern_not_matched"
  }

  if [pattern_not_matched] {
    drop {
      tag => "TAG_UNSUPPORTED"
    }
  }

  mutate {
    gsub => ["kv_data","(.*?),(.*?),","$1=$2,"]
  }
  mutate {
    gsub => ["kv_data","(.*),((.*?),(.*?)$)","$1,$2=$3"]
  }

  mutate {
    replace => {
      "kv_data" => ",%{kv_data}"
    }
    on_error => "failed"
  }

  mutate {
    gsub => ["kv_data",",1=",",user_name="]
  }
  mutate {
    gsub => ["kv_data",",6=",",service_type="]
  }
  mutate {
    gsub => ["kv_data",",7=",",framed_protocol="]
  }
  mutate {
    gsub => ["kv_data",",8=",",framed_address="]
  }
  mutate {
    gsub => ["kv_data",",9=",",framed_netmask="]
  }
  mutate {
    gsub => ["kv_data",",5=",",nat_port="]
  }
  mutate {
    gsub => ["kv_data",",10=",",framed_routing="]
  }
  mutate {
    gsub => ["kv_data",",11=",",filter_id="]
  }
  mutate {
    gsub => ["kv_data",",12=",",framed_mtu="]
  }
  mutate {
    gsub => ["kv_data",",13=",",framed_compression"]
  }
  mutate {
    gsub => ["kv_data",",18=","reply_message"]
  }
  mutate {
    gsub => ["kv_data",",46=",",session_duration="]
  }
  mutate {
    gsub => ["kv_data",",44=",",session_id="]
  }
  mutate {
    gsub => ["kv_data",",14=",",target_ip="]
  }
  mutate {
    gsub => ["kv_data",",16=",",target_port="]
  }
  mutate {
    gsub => ["kv_data",",30=","called_station_id"]
  }
  mutate {
    gsub => ["kv_data",",31=","calling_station_id"]
  }
  mutate {
    gsub => ["kv_data",",32=","nas_identifier"]
  }
  mutate {
    gsub => ["kv_data",",4127=",",auth_type="]
  }
  mutate {
    gsub => ["kv_data",",4128=",",principal_hostname="]
  }
  mutate {
    gsub => ["kv_data",",4108=",",principal_ip="]
  }
  mutate {
    gsub => ["kv_data",",4132=",",extensible_auth_protocol="]
  }
  mutate {
    gsub => ["kv_data",",4136=",",packet_type="]
  }
  mutate {
    gsub => ["kv_data",",4142=",",reason_code="]
  }
  mutate {
    gsub => ["kv_data",",4149=",",policy_name="]
  }
  mutate {
    gsub => ["kv_data","5000=",""]
  }

  kv {
    source => "kv_data"
    field_split => ","
    value_split => "="
    on_error => "kv_failed"
  }

  if [nat_ip] != "" {
    mutate {
      merge => {
        "principal.nat_ip" => "nat_ip"
      }
      on_error => "invalid_nat_ip"
    }
  }

  if [userid] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{userid}"
      }
      on_error => "invalid_userid"
    }
    if not [invalid_userid] {
      mutate {
        replace => {
          "user_present" => "true"
        }
      }
    }
  }

  if [user_name] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{user_name}"
      }
      on_error => "invalid_user_name"
    }
  }

  if [time] != "" and [date] != "" {
    mutate {
      replace => {
        "date_time" => "%{date} %{time}"
      }
      on_error => "invalid_time"
    }
  }

  if [service_name] != "" {
    mutate {
      replace => {
        "target.application" => "%{service_name}"
      }
      on_error => "invalid_column5"
    }
  }

  if [computer_name] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{computer_name}"
        "target.asset.hostname" => "%{computer_name}"
      }
      on_error => "invalid_computername"
    }
    if not [invalid_computername] {
      mutate {
        replace => {
          "target_present" => "true"
        }
      }
    }
  }

  if [principal_hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{principal_hostname}"
        "principal.asset.hostname" => "%{principal_hostname}"
      }
      on_error => "invalid_principal_hostname"
    }
    if not [invalid_principal_hostname] {
      mutate {
        replace => {
          "principal_present" => "true"
        }
      }
    }
  }

  if [principal_ip] != "" {
    grok {
      match => {
        "principal_ip" => "%{IP:principal_ip}"
      }
      overwrite => ["principal_ip"]
      on_error => "principal_ip_not_ip"
    }
    if not [principal_ip_not_ip] {
      mutate {
        merge => {
          "principal.ip" => "principal_ip"
          "principal.asset.ip" => "principal_ip"
        }
        on_error => "invalid_ip"
      }
      if not [invalid_ip] {
        mutate {
          replace => {
            "principal_present" => "true"
          }
        }
      }
    }
  }

  if [calling_station_id] != "" {
    grok {
      match => {
        "calling_station_id" => "%{IP:calling_station_id}"
      }
      overwrite => ["calling_station_id"]
      on_error => "calling_station_id_not_ip"
    }
    if not [calling_station_id_not_ip] {
      mutate {
        merge => {
          "principal.ip" => "calling_station_id"
          "principal.asset.ip" => "calling_station_id"
        }
        on_error => "invalid_ip"
      }
      if not [invalid_ip] {
        mutate {
          replace => {
            "principal_present" => "true"
          }
        }
      }
    }
  }

  if [device-mac] != "" {
    mutate {
      gsub => ["device-mac","-",":"]
    }
    mutate {
      merge => {
        "principal.mac" => "device-mac"
      }
      on_error => "invalid_mac"
    }
    if not [invalid_mac] {
      mutate {
        replace => {
          "principal_present" => "true"
        }
      }
    }
  }

  if [device-public-mac] != "" {
    mutate {
      gsub => ["device-public-mac","-",":"]
    }
    mutate {
      merge => {
        "principal.mac" => "device-public-mac"
      }
      on_error => "invalid_mac"
    }
    if not [invalid_mac] {
      mutate {
        replace => {
          "principal_present" => "true"
        }
      }
    }
  }

  if [device-uid] != "" {
    mutate {
      replace => {
        "principal.resource.product_object_id" => "%{device-uid}"
      }
      on_error => "invalid_uid"
    }
  }

  if [device-platform] in ["Win","win"] {
    mutate {
      replace => {
        "principal.platform" => "WINDOWS"
      }
    }
  }
  else if [device-platform] =~ "mac|iOS" {
    mutate {
      replace => {
        "principal.platform" => "MAC"
      }
    }
  }
  else if [device-platform] =~ "lin" {
    mutate {
      replace => {
        "principal.platform" => "LINUX"
      }
    }
  }

  if [device-platform-version] != "" {
    mutate {
      replace => {
        "principal.platform_version" => "%{device-platform-version}"
      }
      on_error => "invalid_version"
    }
  }

  if [target_ip] != "" {
    grok {
      match => {
        "target_ip" => "%{IP:target_ip}"
      }
      overwrite => ["target_ip"]
      on_error => "target_ip_not_ip"
    }
    if not [target_ip_not_ip] {
      mutate {
        merge => {
          "target.ip" => "target_ip"
          "target.asset.ip" => "target_ip"
        }
        on_error => "invalid_target_ip"
      }
      if not [invalid_target_ip] {
        mutate {
          replace => {
            "target_present" => "true"
          }
        }
      }
    }
  }

  if [called_station_id] != "" {
    grok {
      match => {
        "called_station_id" => "%{IP:called_station_id}"
      }
      overwrite => ["called_station_id"]
      on_error => "called_station_id_not_ip"
    }
    if not [called_station_id_not_ip] {
      mutate {
        merge => {
          "target.ip" => "called_station_id"
          "target.asset.ip" => "called_station_id"
        }
        on_error => "invalid_called_station_id"
      }
      if not [invalid_called_station_id] {
        mutate {
          replace => {
            "target_present" => "true"
          }
        }
      }
    }
  }

  if [target_port] != "" {
    mutate {
      replace => {
        "target.port" => "%{target_port}"
      }
      on_error => "invalid_target_port"
    }
    mutate {
      convert => {
        "target.port" => "integer"
      }
      on_error => "already_integer"
    }
  }

  if [packet_type] != "" {
    mutate {
      replace => {
        "packet_type_label.key" => "Packet-Type"
        "packet_type_label.value.string_value" => "%{packet_type}"
      }
      on_error => "invalid_packet_type"
    }
    if not [invalid_packet_type] {
      mutate {
        merge => {
          "additional.fields" => "packet_type_label"
        }
        on_error => "invalid_packet_type_label"
      }
    }
  }

  if [auth_type] != "" {
    mutate {
      replace => {
        "auth_type_label.key" => "Authentication-Type"
        "auth_type_label.value.string_value" => "%{auth_type}"
      }
      on_error => "invalid_auth_type"
    }
    if not [invalid_auth_type] {
      mutate {
        merge => {
          "additional.fields" => "auth_type_label"
        }
        on_error => "invalid_auth_type_label"
      }
    }
  }

  if [policy_name] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{policy_name}"
      }
      on_error => "invalid_policy_name"
    }
  }

  if [filter_id] != "" {
    mutate {
      replace => {
        "filter_id_label.key" => "Filter-Id"
        "filter_id_label.value.string_value" => "%{filter_id}"
      }
      on_error => "invalid_filter_id"
    }
    if not [invalid_filter_id] {
      mutate {
        merge => {
          "additional.fields" => "filter_id_label"
        }
        on_error => "invalid_filter_id_label"
      }
    }
  }

  if [framed_netmask] != "" {
    mutate {
      replace => {
        "framed_netmask_label.key" => "Framed-Netmask"
        "framed_netmask_label.value.string_value" => "%{framed_netmask}"
      }
      on_error => "invalid_framed_netmask"
    }
    if not [invalid_framed_netmask] {
      mutate {
        merge => {
          "additional.fields" => "framed_netmask_label"
        }
        on_error => "invalid_framed_netmask_label"
      }
    }
  }

  if [framed_address] != "" {
    mutate {
      replace => {
        "framed_address_label.key" => "Framed-Address"
        "framed_address_label.value.string_value" => "%{framed_address}"
      }
      on_error => "invalid_framed_address"
    }
    if not [invalid_framed_address] {
      mutate {
        merge => {
          "additional.fields" => "framed_address_label"
        }
        on_error => "invalid_framed_address_label"
      }
    }
  }

  if [framed_protocol] != "" {
    mutate {
      replace => {
        "framed_protocol_label.key" => "Framed-Protocol"
        "framed_protocol_label.value.string_value" => "%{framed_protocol}"
      }
      on_error => "invalid_framed_protocol"
    }
    if not [invalid_framed_protocol] {
      mutate {
        merge => {
          "additional.fields" => "framed_protocol_label"
        }
        on_error => "invalid_framed_protocol_label"
      }
    }
  }

  if [framed_routing] != "" {
    mutate {
      replace => {
        "framed_routing_label.key" => "Framed-Routing"
        "framed_routing_label.value.string_value" => "%{framed_routing}"
      }
      on_error => "invalid_framed_routing"
    }
    if not [invalid_framed_routing] {
      mutate {
        merge => {
          "additional.fields" => "framed_routing_label"
        }
        on_error => "invalid_framed_routing_label"
      }
    }
  }

  if [framed_mtu] != "" {
    mutate {
      replace => {
        "framed_mtu_label.key" => "Framed-MTU"
        "framed_mtu_label.value.string_value" => "%{framed_mtu}"
      }
      on_error => "invalid_framed_mtu"
    }
    if not [invalid_framed_mtu] {
      mutate {
        merge => {
          "additional.fields" => "framed_mtu_label"
        }
        on_error => "invalid_framed_mtu_label"
      }
    }
  }

  if [framed_compression] != "" {
    mutate {
      replace => {
        "framed_compression_label.key" => "Framed-Compression"
        "framed_compression_label.value.string_value" => "%{framed_compression}"
      }
      on_error => "invalid_framed_compression"
    }
    if not [invalid_framed_compression] {
      mutate {
        merge => {
          "additional.fields" => "framed_compression_label"
        }
        on_error => "invalid_framed_compression_label"
      }
    }
  }

  if [reason_code] != "" {
    mutate {
      replace => {
        "reason_code_label.key" => "Reason-Code"
        "reason_code_label.value.string_value" => "%{reason_code}"
      }
      on_error => "invalid_reason_code"
    }
    if not [invalid_reason_code] {
      mutate {
        merge => {
          "additional.fields" => "reason_code_label"
        }
        on_error => "invalid_reason_code_label"
      }
    }
  }

  if [extensible_auth_protocol] != "" {
    mutate {
      replace => {
        "extensible_auth_protocol_label.key" => "EAP-Friendly-Name"
        "extensible_auth_protocol_label.value.string_value" => "%{extensible_auth_protocol}"
      }
      on_error => "invalid_extensible_auth_protocol"
    }
    if not [invalid_extensible_auth_protocol] {
      mutate {
        merge => {
          "additional.fields" => "extensible_auth_protocol_label"
        }
        on_error => "invalid_extensible_auth_protocol_label"
      }
    }
  }

  if [service_type] != "" {
    mutate {
      replace => {
        "service_type_label.key" => "Service-Type"
        "service_type_label.value.string_value" => "%{service_type}"
      }
      on_error => "invalid_service_type"
    }
    if not [invalid_service_type] {
      mutate {
        merge => {
          "additional.fields" => "service_type_label"
        }
        on_error => "invalid_service_type_label"
      }
    }
  }

  if [nas_port] != "" {
    mutate {
      replace => {
        "nas_port_label.key" => "NAS_PORT"
        "nas_port_label.value.string_value" => "%{nas_port}"
      }
      on_error => "nas_port_error"
    }
    if ![nas_port_error] {
      mutate {
        merge => {
          "additional.fields" => "nas_port_label"
        }
        on_error => "nas_port_merge_error"
      }
    }
  }

  if [reply_message] != "" {
    mutate {
      replace => {
        "reply_message_label.key" => "Reply-message"
        "reply_message_label.value.string_value" => "%{reply_message}"
      }
      on_error => "invalid_reply_message"
    }
    if not [invalid_reply_message] {
      mutate {
        merge => {
          "additional.fields" => "reply_message_label"
        }
        on_error => "invalid_reply_message_label"
      }
    }
  }

  if [nas_identifier] != "" {
    mutate {
      replace => {
        "nas_identifier_label.key" => "NAS-Identifier"
        "nas_identifier_label.value.string_value" => "%{nas_identifier}"
      }
      on_error => "invalid_nas_identifier"
    }
    if not [invalid_nas_identifier] {
      mutate {
        merge => {
          "additional.fields" => "nas_identifier_label"
        }
        on_error => "invalid_nas_identifier_label"
      }
    }
  }

  if [device-type] != "" {
    mutate {
      replace => {
        "device_type_label.key" => "Device-type"
        "device_type_label.value.string_value" => "%{device-type}"
      }
      on_error => "invalid_device_type"
    }
    if not [invalid_device_type] {
      mutate {
        merge => {
          "additional.fields" => "device_type_label"
        }
        on_error => "invalid_device_type_label"
      }
    }
  }

  if [coa-push] != "" {
    mutate {
      replace => {
        "coa-push_label.key" => "coa-push"
        "coa-push_label.value.string_value" => "%{coa-push}"
      }
      on_error => "invalid_coa-push"
    }
    if not [invalid_coa-push] {
      mutate {
        merge => {
          "additional.fields" => "coa-push_label"
        }
        on_error => "invalid_coa-push_label"
      }
    }
  }

  if [audit-session-id] != "" {
    mutate {
      replace => {
        "audit-session-id_label.key" => "audit-session-id"
        "audit-session-id_label.value.string_value" => "%{audit-session-id}"
      }
      on_error => "invalid_audit-session-id"
    }
    if not [invalid_audit-session-id] {
      mutate {
        merge => {
          "additional.fields" => "audit-session-id_label"
        }
        on_error => "invalid_audit-session-id_label"
      }
    }
  }

  if [date_time] != "" {
    date {
      match => ["date_time","MM/dd/yyyy HH:mm:ss"]
      target => "metadata.event_timestamp"
      on_error => "invalid_timestamp"
    }
  }

  if [session_id] != "" {
    mutate {
      replace => {
        "network.session_id" => "%{session_id}"
      }
    }
  }

  if [session_duration] != "" {
    mutate {
      replace => {
        "network.session_duration.seconds" => "%{session_duration}"
      }
    }
    mutate {
      convert => {
        "network.session_duration.seconds" => "integer"
      }
    }
  }

  if [ac-user-agent] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{ac-user-agent}"
      }
      on_error => "invalid_user_agent"
    }
    mutate {
      convert => {
        "ac-user-agent" => "parseduseragent"
      }
      on_error => "invalid_parsed_user_agent"
    }
    if not [invalid_parsed_user_agent] {
      mutate {
        rename => {
          "ac-user-agent" => "network.http.parsed_user_agent"
        }
      }
    }
  }

  mutate {
    replace => {
      "metadata.event_type" => "GENERIC_EVENT"
      "metadata.vendor_name" => "MICROSOFT_IAS"
      "metadata.product_name" => "MICROSOFT_IAS"
    }
  }

  if [principal_present] == "true" and [target_present] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  } else if [principal_present] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "invalid_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
