# Product: Samba SMBD
# Category: Privileged Account Activity
# Supported Format: Syslog
# Reference: https://wiki.samba.org/index.php/Setting_up_Audit_Logging#Standard_Log_Format
# Last Updated: 2023-03-09
# Copyright 2023 Chronicle LLC


filter {
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "security_result" => ""
      "extensions" => ""
      "src_host" => ""
      "ts" => ""
      "cef_extension" => ""
      "userid" => ""
      "target_ip" => ""
      "target_host" => ""
      "command" => ""
      "result" => ""
      "path" => ""
      "msg_data" => ""
      "action" => ""
      "sec_action" => ""
    }
  }

  grok {
  match => {
    "message" => [
      "%{SYSLOGTIMESTAMP:ts} %{DATA:src_host} (smbd_audit|smbd\\[%{INT}\\]): \\[%{GREEDYDATA},\\s+%{INT}\\] %{GREEDYDATA:msg_data}"
      "%{SYSLOGTIMESTAMP:ts} %{DATA:src_host} smbd_audit: %{GREEDYDATA}: \\[ %{GREEDYDATA:cef_extension}\\]",
      "%{SYSLOGTIMESTAMP:ts} %{DATA:src_host} smbd_audit: %{GREEDYDATA:cef_extension}",
      "%{SYSLOGTIMESTAMP:ts} %{DATA:src_host} smbd\\[%{INT}\\]:\\s+check_ntlm_password:\\s+%{GREEDYDATA:msg_data}"
      ]
  }
  overwrite => ["cef_extension", "ts", "src_host", "msg_data"]
  on_error => "not_grok_pattern"
  }
  if [not_grok_pattern] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }

  date {
    match => ["ts", "MMM d HH:mm:ss"]
    rebase => true
  }
  mutate {
    replace => {
      "principal.hostname" => "%{src_host}"
    }
  }
  if [msg_data] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{msg_data}"
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
    grok {
      match => {
        "msg_data" => ["authentication for user %{GREEDYDATA} -> %{GREEDYDATA} -> \\[%{DATA:userid}\\]\\s+%{WORD:action}"]
      }
      on_error => "grok_failed"
      overwrite => ["userid", "action"]
    }
    if [userid] != "" {
      mutate {
        replace => {
          "target.user.userid" => "%{userid}"
          "metadata.event_type" => "USER_LOGIN"
          "extensions.auth.type" => "SSO"
        }
      }
    }
    if [action] != "" {
      if [action] == "succeeded" {
        mutate {
          replace => {
            "sec_action" => "ALLOW"
          }
        }
      }
      else {
        mutate {
          replace => {
            "sec_action" => "BLOCK"
          }
        }
      }
      mutate {
        merge => {
          "security_result.action" => "sec_action"
        }
      }
    }
  }
  else {
    csv {
      source => "cef_extension"
      separator => "|"
      on_error => "csv_failure"
    }
    if [csv_failure] {
      mutate {
        replace => {
          "column1" => "%{cef_extension}"
        }
      }
    }
    mutate {
      replace => {
        "userid" => "%{column1}"
      }
      on_error => "csv_failure"
    }
    mutate {
      replace => {
        "target_ip" => "%{column2}"
      }
      on_error => "csv_failure"
    }
    mutate {
      replace => {
        "target_host" => "%{column3}"
      }
      on_error => "csv_failure"
    }
    mutate {
      replace => {
        "command" => "%{column5}"
      }
      on_error => "csv_failure"
    }
    mutate {
      replace => {
        "result" => "%{column6}"
      }
      on_error => "csv_failure"
    }
    if [csv_failure] {
      grok {
        match => {
          "column1" => ["\\s+%{GREEDYDATA:column1}"]
        }
        overwrite => ["column1"]
      }
      mutate {
        replace => {
          "security_result.description" => "%{column1}"
          "metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      if [command] =~ "(create_file)" {
        mutate {
          replace => {
            "path" => "%{column10}"
          }
          on_error => "no_path"
        }
        mutate {
          replace => {
            "metadata.event_type" => "FILE_CREATION"
          }
        }
      }
      else {
        mutate {
          replace => {
            "path" => "%{column8}"
          }
          on_error => "no_path"
        }
        mutate {
          replace => {
            "metadata.event_type" => "USER_UNCATEGORIZED"
          }
        }
      }
      mutate {
        replace => {
          "target.user.userid" => "%{userid}"
        }
        on_error => "no_userid"
      }
      mutate {
        merge => {
          "target.ip" => "target_ip"
        }
        on_error => "no_target_ip"
      }
      mutate {
        replace => {
          "target.hostname" => "%{target_host}"
        }
        on_error => "no_target_host"
      }
      mutate {
        replace => {
          "target.process.command_line" => "%{command}"
        }
        on_error => "no_command"
      }
      if ![no_path] {
        mutate {
          replace => {
            "target.file.full_path" => "%{path}"
          }
          on_error => "no_path"
        }
      }
      mutate {
        replace => {
          "result_label.key" => "Result"
          "result_label.value" => "%{result}"
        }
        on_error => "no_result"
      }
      if ![no_result] {
        mutate {
          merge => {
            "target.resource.attribute.labels" => "result_label"
          }
        }
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "SMBD"
      "metadata.vendor_name" => "SMBD"
    }
  }

  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

