# Product: NETDOCUMENTS
# Category: Threat Management Firewall
# Supported Format: Cloud-Based Document Management System
# Reference: NA
# Last Updated: 2024-05-06
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "security_result" => ""
      "event_type" => ""
      "metadata" => ""
      "principal" => ""
      "additional" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "has_file" => "false"
      "has_principal_user" => "false"
      "target" => ""
      "network" => ""
      "extensions" => ""
      "date" => ""
      "description" => ""
      "host" => ""
      "name" => ""
      "storageObject.cabinet.name" => ""
      "storageObject.cabinet.id" => ""
      "storageObject.docId" => ""
      "storageObject.name" => ""
      "storageObject.size" => ""
      "storageObject.version" => ""
      "storageObject.fileExtension" => ""
      "storageObject.collabSpace" => ""
      "storageObject.NetBinder" => ""
      "user.id" => ""
      "user.name" => ""
      "user.memberType" => ""
      "user.email" => ""
      "user_email" => ""
      "source.id" => ""
      "source.name" => ""
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [not_json] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [date] != "" {
    date {
      match => ["date","ISO8601","RFC3339","UNIX","SYSLOGTIMESTAMP"]
      target => "metadata.event_timestamp"
      on_error => "invalid_timestamp"
    }
  }

  if [description] not in ["","null"] {
    mutate {
      replace => {
        "metadata.description" => "%{description}"
      }
      on_error => "desc_error"
    }
  }

  if [host] != "" {
    grok {
      match => {
        "host" => ["%{IP:host}"]
      }
      overwrite => ["host"]
      on_error => "not_an_ip"
    }
    if ![not_an_ip] {
      mutate {
        merge => {
          "principal.ip" => "host"
          "principal.asset.ip" => "host"
        }
        on_error => "ip_merge_error"
      }
      if ![ip_merge_error] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
  }
  if [user][id] != "" {
    mutate {
      replace  => {
        "principal.user.userid" => "%{user.id}"
      }
      on_error => "user_id_error"
    }
  }
  if [user][name] != "" {
    mutate {
      replace  => {
        "principal.user.user_display_name" => "%{user.name}"
      }
      on_error => "user_name_error"
    }
  }
  if [user][email] != "" {
    grok {
      match => {
        "user.email" => ["%{EMAILADDRESS:user_email}"]
      }
      on_error => "email_mismatch"
      overwrite => ["user_email"]
    }
    if ![email_mismatch] {
      mutate {
        merge  => {
          "principal.user.email_addresses" => "user_email"
        }
        on_error => "email_error"
      }
    }
  }
  if [source][id] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{source.id}"
        "principal.asset.hostname" => "%{source.id}"
      }
      on_error => "hostname_error"
    }
    if ![hostname_error] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [user][memberType] != "" {
    mutate {
      replace  => {
        "principal.user.role_name" => "%{user.memberType}"
      }
      on_error => "memberType_error"
    }
  }

  if [name] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{name}"
      }
      on_error => "name_error"
    }
  }
  if [storageObject][docId] != "" {
    mutate {
      replace => {
        "target.resource.product_object_id" => "%{storageObject.docId}"
      }
      on_error => "docId_error"
    }
  }
  if [storageObject][name] != "" {
    mutate {
      merge => {
        "target.file.names" => "storageObject.name"
      }
      on_error => "name_error"
    }
    if ![name_error] {
      mutate {
        replace => {
          "has_file" => "true"
        }
      }
    }
  }
  if [storageObject][fileExtension] != "" {
    mutate {
      replace => {
        "target.file.mime_type" => "%{storageObject.fileExtension}"
        "has_file" => "true"
      }
      on_error => "fileExtension_error"
    }
  }

  if [storageObject][size] != "" {
    mutate {
      replace => {
        "target.file.size" => "%{storageObject.size}"
        "has_file" => "true"
      }
      on_error => "file_size_error"
    }
    mutate {
      convert => {
        "target.file.size" => "uinteger"
      }
      on_error => "conversion_error"
    }
  }
  if [storageObject][version] != "" {
    mutate {
      replace => {
        "version_label.key" => "version"
        "version_label.value" => "%{storageObject.version}"
      }
      on_error => "version_label_error"
    }
    if ![version_label_error] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "version_label"
        }
        on_error => "version_label_merge_error"
      }
    }
  }
  if [source][name] != "" {
    mutate {
      replace => {
        "source_name.key" => "source_name"
        "source_name.value" => "%{source.name}"
      }
      on_error => "source_name_error"
    }
    if ![source_name_error] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "source_name"
        }
        on_error => "source_name_merge_error"
      }
    }
  }

  if [storageObject][collabSpace] != "" {
    mutate {
      replace => {
        "collabSpace_label.key" => "collabSpace"
        "collabSpace_label.value" => "%{storageObject.collabSpace}"
      }
      on_error => "collabSpace_label_error"
    }
    if ![collabSpace_label_error] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "collabSpace_label"
        }
        on_error => "collabSpace_label_merge_error"
      }
    }
  }
  if [storageObject][NetBinder] != "" {
    mutate {
      replace => {
        "NetBinder_label.key" => "NetBinder"
        "NetBinder_label.value" => "%{storageObject.NetBinder}"
      }
      on_error => "NetBinder_label_error"
    }
    if ![NetBinder_label_error] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "NetBinder_label"
        }
        on_error => "NetBinder_label_merge_error"
      }
    }
  }

  if [storageObject][cabinet][name] != "" {
    mutate {
      replace => {
        "cabinet_name.key" => "cabinet_name"
        "cabinet_name.value" => "%{storageObject.cabinet.name}"
      }
      on_error => "cabinet_name_error"
    }
    if ![cabinet_name_error] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "cabinet_name"
        }
        on_error => "cabinet_name_merge_error"
      }
    }
  }
  if [storageObject][cabinet][id] != "" {
    mutate {
      replace => {
        "cabinet_id.key" => "cabinet_id"
        "cabinet_id.value" => "%{storageObject.cabinet.id}"
      }
      on_error => "cabinet_id_error"
    }
    if ![cabinet_id_error] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "cabinet_id"
        }
        on_error => "cabinet_id_merge_error"
      }
    }
  }

  if [has_principal] == "true" and [has_file] == "true" and [name] in ["upload","create"] {
    mutate {
      replace => {
        "event_type" => "FILE_CREATION"
      }
    }
  }
  else if [has_principal] == "true" and [has_file] == "true" and ([name] =~ "(?i)rename" or [name] =~ "(?i)change") {
    mutate {
      replace => {
        "event_type" => "FILE_MODIFICATION"
      }
    }
  }
  else if [has_principal] == "true" and [has_file] == "true" and [name] =~ "(?i)open" {
    mutate {
      replace => {
        "event_type" => "FILE_OPEN"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
      on_error => "event_type_error"
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "sec_result_error"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
