# Product: OpenCanary
# Category: Data Security
# Supported Format: SYSLOG + JSON
# Reference: NA
# Last Updated: 2024-03-11
# Copyright 2024 Chronicle LLC
filter {
  mutate {
    replace => {
      "node_id" => ""
      "logtype" => ""
      "loglevel" => ""
      "dst_host" => ""
      "dst_port" => ""
      "src_host" => ""
      "src_port" => ""
      "utc_time" => ""
      "local_time" => ""
      "json_message" => ""
      "logdata.PATH" => ""
      "logdata.DOMAIN" => ""
      "logdata.SMBVER" => ""
      "logdata.PASSWORD" => ""
      "logdata.USERNAME" => ""
      "logdata.REQUESTS" => ""
      "logdata.HOSTNAME" => ""
      "logdata.FILENAME" => ""
      "logdata.USERAGENT" => ""
      "logdata.LOCALNAME" => ""
      "logdata.REMOTENAME" => ""
      "logdata.COMMUNITY_STRING" => ""
      "logdata.REMOTEVERSION" => ""
      "logdata.LOCALVERSION" => ""
      "logdata.HEADERS.from" => ""
      "logdata.HEADERS.to" => ""
      "local_time_adjusted" => ""
      "target" => ""
      "network" => ""
      "metadata" => ""
      "principal" => ""
      "extensions" => ""
      "security_result" => ""
      "user_present" => "false"
      "event_type_set" => "false"
      "target_present" => "false"
      "principal_present" => "false"
      "target_file_present" => "false"
    }
  }

  grok {
    match => {
      "message" => [
        "%{DATA} %{LOGLEVEL:loglevel} %{GREEDYDATA:json_message}"
      ]
    }
    overwrite => ["loglevel","json_message"]
    on_error => "invalid_pattern"
  }

  if [invalid_pattern] {
    drop {
      tag => "TAG_UNSUPPORTED"
    }
  }

  if [json_message] != "" {
    mutate {
      gsub => ["json_message","\\x00",""]
    }
    json {
      source => "json_message"
      array_function => "split_columns"
      on_error => "invalid_json"
    }
    if [invalid_json] {
      drop {
        tag => "TAG_UNSUPPORTED"
      }
    }
  }

  if [local_time] != "" {
    date {
      match => ["local_time","yyyy-MM-ddHH:mm:SSS"]
      on_error => "date_pattern_not_matched"
    }
  }

  if [node_id] != "" {
    mutate {
      replace => {
        "principal.asset.asset_id" => "id:%{node_id}"
      }
      on_error => "invalid_node_id"
    }
  }

  if [logtype] != "" {
    mutate {
      convert => {
        "logtype" => "string"
      }
      on_error => "conversion_failure"
    }
    mutate {
      replace => {
        "logtype_label.key" => "logtype"
        "logtype_label.value" => "%{logtype}"
      }
      on_error => "invalid_logtype"
    }
    if not [invalid_logtype] {
      mutate {
        merge => {
          "security_result.detection_fields" => "logtype_label"
        }
        on_error => "invalid_logtype"
      }
    }
  }

  if [utc_time] != "" {
    mutate {
      replace => {
        "utc_time_label.key" => "utc_time"
        "utc_time_label.value" => "%{utc_time}"
      }
      on_error => "invalid_utctime"
    }
    if not [invalid_utctime] {
      mutate {
        merge => {
          "security_result.detection_fields" => "utc_time_label"
        }
        on_error => "invalid_utctime"
      }
    }
  }

  if [local_time_adjusted] != "" {
    mutate {
      replace => {
        "local_time_adjusted_label.key" => "local_time_adjusted"
        "local_time_adjusted_label.value" => "%{local_time_adjusted}"
      }
      on_error => "invalid_local_time_adjusted"
    }
    if not [invalid_local_time_adjusted] {
      mutate {
        merge => {
          "security_result.detection_fields" => "local_time_adjusted_label"
        }
        on_error => "invalid_local_time_adjusted"
      }
    }
  }

  if [dst_host] != "" {
    grok {
      match => {
        "dst_host" => "%{IP:dst_host}"
      }
      overwrite => ["dst_host"]
      on_error => "not_ip"
    }
    if not [not_ip] {
      mutate {
        merge => {
          "target.ip" => "dst_host"
          "target.asset.ip" => "dst_host"
        }
        on_error => "invalid_dst_host"
      }
      if not [invalid_dst_host] {
        mutate {
          replace => {
            "target_present" => "true"
          }
        }
      }
    }
  }

  if [logdata][USERNAME] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{logdata.USERNAME}"
      }
      on_error => "invalid_userid"
    }
    if [dst_port] == 22 and (not [invalid_userid]) {
      mutate {
        replace => {
          "metadata.event_type" => "USER_LOGIN"
          "event_type_set" => "true"
        }
      }
    }
  }

  if [logdata][PASSWORD] != "" {
    mutate {
      replace => {
        "auth_mechanism" => "USERNAME_PASSWORD"
      }
    }

    mutate {
      merge => {
        "auth.mechanism" => "auth_mechanism"
      }
      on_error => "invalid_auth"
    }

    mutate {
      rename => {
        "auth" => "extensions.auth"
      }
    }
  }

  if [logdata][LOCALVERSION] != "" {
    mutate {
      replace => {
        "principal.platform_version" => "%{logdata.LOCALVERSION}"
      }
      on_error => "invalid_version"
    }
  }

  if [logdata][REMOTEVERSION] != "" {
    mutate {
      replace => {
        "target.platform_version" => "%{logdata.REMOTEVERSION}"
      }
      on_error => "invalid_version"
    }
  }

  if [logdata][COMMUNITY_STRING] != "" {
    mutate {
      replace => {
        "community_string.key" => "COMMUNITY_STRING"
        "community_string.value" => "%{logdata.COMMUNITY_STRING}"
      }
      on_error => "invalid_communtiy_string"
    }
    if not [invalid_communtiy_string] {
      mutate {
        merge => {
          "security_result.detection_fields" => "community_string"
        }
        on_error => "invalid_communtiy_string"
      }
    }
  }

  if [logdata][HOSTNAME] != "" {
    grok {
      match => {
        "logdata.HOSTNAME" => "%{IP:ip}"
      }
      overwrite => ["ip"]
      on_error => "invalid_ip"
    }
    if not [invalid_ip] {
      mutate {
        merge => {
          "principal.ip" => "logdata.HOSTNAME"
          "principal.asset.ip" => "logdata.HOSTNAME"
        }
        on_error => "invalid_principal_ip"
      }
    } else {
      mutate {
        replace => {
          "principal.hostname" => "%{logdata.HOSTNAME}"
          "principal.asset.hostname" => "%{logdata.HOSTNAME}"
        }
        on_error => "invalid_hostname"
      }
    }
    mutate {
      replace => {
        "principal_present" => "true"
      }
    }
  }

  if [logdata][USERAGENT] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{logdata.USERAGENT}"
      }
      on_error => "no_useragent"
    }
    mutate {
      convert => {
        "logdata.USERAGENT" => "parseduseragent"
      }
      on_error => "invalid_conversion"
    }
    if not [invalid_conversion] {
      mutate {
        rename => {
          "logdata.USERAGENT" => "network.http.parsed_user_agent"
        }
      }
    }
  }

  if [logdata][PATH] != "" {
    mutate {
      replace => {
        "network.http.referral_url" => "%{logdata.PATH}"
      }
      on_error => "invalid_path"
    }
  }

  if [logdata][FILENAME] != "" {
    mutate {
      replace => {
        "target.file.full_path" => "%{logdata.FILENAME}"
      }
      on_error => "invalid_filename"
    }
    if not [invalid_filename] {
      mutate {
        replace => {
          "target_file_present" => "true"
        }
      }
    }
  }

  if [logdata][DOMAIN] != "" {
    mutate {
      replace => {
        "principal.administrative_domain" => "%{logdata.DOMAIN}"
      }
      on_error => "invalid_domain"
    }
  }

  if [logdata][REMOTENAME] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{logdata.REMOTENAME}"
        "target.asset.hostname" => "%{logdata.REMOTENAME}"
      }
      on_error => "invalid_hostname"
    }
    if not [invalid_hostname] {
      mutate {
        replace => {
          "target_present" => "true"
        }
      }
    }
  }

  if [logdata][LOCALNAME] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{logdata.LOCALNAME}"
        "principal.asset.hostname" => "%{logdata.LOCALNAME}"
      }
      on_error => "invalid_hostname"
    }
    if not [invalid_hostname] {
      mutate {
        replace => {
          "principal_present" => "true"
        }
      }
    }
  }

  if [logdata][SMBVER] != "" {
    mutate {
      replace => {
        "network.application_protocol" => "SMB"
      }
    }
  }

  if [loglevel] != "" {
    mutate {
      uppercase => ["loglevel"]
    }
    if [loglevel] == "WARNING" {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
      }
    } else if [loglevel] =~ "(information|info)" {
      mutate {
        replace => {
          "security_result.severity" => "LOW"
        }
      }
    }
  }

  if [dst_port] != "" {
    mutate {
      convert => {
        "dst_port" => "string"
      }
      on_error => "conversion_failure"
    }
    mutate {
      replace => {
        "target.port" => "%{dst_port}"
      }
      on_error => "invalid_dst_port"
    }
    mutate {
      convert => {
        "target.port" => "integer"
      }
      on_error => "invalid_conversion"
    }
  }

  if [src_host] != "" {
    grok {
      match => {
        "src_host" => "%{IP:src_host}"
      }
      overwrite => ["src_host"]
      on_error => "not_ip"
    }
    if not [not_ip] {
      mutate {
        merge => {
          "principal.ip" => "src_host"
          "principal.asset.ip" => "src_host"
        }
        on_error => "invalid_src_host"
      }
      if not [invalid_src_host] {
        mutate {
          replace => {
            "principal_present" => "true"
          }
        }
      }
    }
  }

  if [src_port] != "" {
    mutate {
      convert => {
        "src_port" => "integer"
      }
      on_error => "conversion_failure"
    }

    mutate {
      rename => {
        "src_port" => "principal.port"
      }
      on_error => "invalid_src_port"
    }
  }

  if [event_type_set] == "false" {
    if [dst_port] in ["80","443"] and [principal_present] == "true" and [target_present] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_HTTP"
          "network.application_protocol" => "HTTP"
        }
      }
    } else if [target_file_present] == "true" and [principal_present] == "true" and [target_present] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "FILE_OPEN"
        }
      }
    } else if [principal_present] == "true" and [target_present] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_CONNECTION"
        }
      }
    } else if [principal_present] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "STATUS_UPDATE"
        }
      }
    } else {
      mutate {
        replace => {
          "metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "OPENCANARY"
      "metadata.product_name" => "OPENCANARY"
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "invalid_security_result"
    }
  }

  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
