# Product: IBM SAFENET
# Category: IT infrastructure
# Supported Format: SYSLOG
# Reference : https://www.ibm.com/docs/en/dsm?topic=configuration-safenet-datasecure
# Last Updated: 2026-03-05
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "inner_msg" => ""
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "timestamp" => ""
      "principal_ip" => ""
      "principal_hostname" => ""
      "severity" => ""
      "application" => ""
      "process_id" => ""
      "kv_data" => ""
      "user" => ""
      "folder" => ""
      "cmd_data" => ""
      "status" => ""
      "source_ip" => ""
      "source_port" => ""
      "destination_ip" => ""
      "destination_port" => ""
      "metadata_event_type" => ""
      "ip_protocol" => ""
      "result" => ""
      "description" => ""
      "network" => ""
      "geoState" => ""
      "bytes_in" => ""
      "bytes_out" => ""
      "geoCountry" => ""
      "role" => ""
      "host_ip" => ""
      "security_result_action" => ""
      "security_result" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "(<%{DATA}>)?%{SYSLOGTIMESTAMP:timestamp} (%{IP:principal_ip} )?%{DATA:principal_hostname} %{WORD:severity} %{DATA:application}\\[%{INT:process_id}\\]\:\\s+%{GREEDYDATA:inner_msg}",
        "(<%{DATA}>)?%{SYSLOGTIMESTAMP:timestamp} (%{IP:principal_ip} )?%{DATA:principal_hostname} %{DATA:application}: %{GREEDYDATA:inner_msg}"
        "(<%{DATA}>)?%{SYSLOGTIMESTAMP:timestamp} (%{IP:principal_ip} )?%{DATA:principal_hostname} %{GREEDYDATA:description}"
      ]
    }
    on_error => "grok_parse_failure"
    overwrite => ["timestamp", "principal_ip", "principal_hostname", "severity", "application", "process_id", "inner_msg", "description"]
  }

  if [inner_msg] != "" {
    mutate {
      gsub => [
        "inner_msg", "^\\d+:\\d+:\\s+", ""
      ]
    }
  }
  if [description] != "" {
    grok {
      match => {
        "description" => [
        "%{DATA:cmd_data}\\[%{INT:process_id} %{WORD:status} %{WORD:application}"
        ]
      }
      on_error => "description_grok_failed"
      overwrite => ["cmd_data", "process_id", "status", "application"]
    }
    mutate {
      replace => {
        "security_result.description" => "%{description}"
      }
      on_error => "description_replace_failed"
    }
  }

  if [timestamp] != "" {
    date {
      match => ["timestamp", "MMM dd HH:mm:ss", "MMM  d HH:mm:ss"]
      rebase => true
      on_error => "timestamp_parse_failed"
    }
  }

  if [principal_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "principal_ip"
      }
    }
  }

  if [principal_hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{principal_hostname}"
      }
      on_error => "principal_hostname_replace_failed"
    }
  }

  if [application] != "" {
    mutate {
      replace => {
        "principal.application" => "%{application}"
      }
      on_error => "application_replace_failed"
    }
  }

  if [process_id] != "" {
    mutate {
      replace => {
        "principal.process.pid" => "%{process_id}"
      }
      on_error => "process_id_replace_failed"
    }
  }

  if [application] == "tmsh" {
    grok {
      match => {
        "inner_msg" => [
          "%{WORD:desc_tmsh} - %{GREEDYDATA:kv_data}"
          "%{GREEDYDATA:description}"
        ]
      }
      overwrite => ["kv_data"]
    }

    if [kv_data] != "" {
      mutate {
        gsub => ["kv_data", "(\\w+)=", "^$1="]
      }

      kv {
        source => "kv_data"
        value_split => "="
        field_split => "^"
      }
    }
  }
  else if [application] =~ "tmm" {
    grok {
      match => {
        "inner_msg" => [
          "(?P<description>SSL Handshake\\s+%{WORD:result}\\s+\\w+\\s+%{WORD:ip_protocol}\\s+%{IP:source_ip}:%{INT:source_port}\\s+->\\s+%{IP:destination_ip}:%{INT:destination_port})"
          "New session from client IP %{IP:source_ip} \\(ST=%{DATA:geoState}\\/CC=%{DATA:geoCountry}\\/C=%{DATA:geoContinent}\\) at VIP %{IP:destination_ip} %{GREEDYDATA}"
          "bytes in: %{INT:bytes_in},\\s+bytes out: %{INT:bytes_out}"
        ]
      }
      overwrite => ["ip_protocol", "source_ip" , "destination_ip", "result", "destination_port", "source_port", "description", "geoCountry", "geoState", "bytes_in", "bytes_out"]
      on_error => "tmm_grok_parse_failure"
    }

    if [tmm_grok_parse_failure] {
      mutate {
        replace => {
          "description" => "%{inner_msg}"
        }
      }
    }

    if [geoState] != "" {
      mutate {
        replace => {
          "principal.location.state" => "%{geoState}"
        }
      }
    }

    if [geoCountry] != "" {
      mutate {
        replace => {
          "principal.location.country_or_region" => "%{geoCountry}"
        }
      }
    }

    if [ip_protocol] != "" {
      mutate {
        replace => {
          "network.ip_protocol" => "%{ip_protocol}"
        }
      }
    }

    if [bytes_in] != "" {
      mutate {
        replace => {
          "network.received_bytes" => "%{bytes_in}"
        }
      }
      mutate{
        convert =>{
          "network.received_bytes" =>"uinteger"
        }
      }
    }

    if [bytes_out] != "" {
      mutate {
        replace => {
          "network.sent_bytes" => "%{bytes_out}"
        }
      }
      mutate{
        convert =>{
          "network.sent_bytes" =>"uinteger"
        }
      }
    }

    if [source_ip] != "" {
      mutate {
        merge => {
          "principal.ip" => "source_ip"
        }
      }
    }

    if [destination_ip] != "" {
      mutate {
        merge => {
          "target.ip" => "destination_ip"
        }
      }
    }

    if [source_ip] != "" and [destination_ip] != "" {
      mutate {
        replace => {
          "metadata_event_type" => "NETWORK_CONNECTION"
        }
      }
    }

    if [source_port] != "" {
      mutate {
        replace => {
          "principal.port" => "%{source_port}"
        }
      }
      mutate {
        convert => {
          "principal.port" => "integer"
        }
      }
    }

    if [destination_port] != "" {
      mutate {
        replace => {
          "target.port" => "%{destination_port}"
        }
      }
      mutate {
        convert => {
          "target.port" => "integer"
        }
      }
    }

    if [result] == "failed" {
      mutate {
        replace => {
          "security_result_action" => "BLOCK"
        }
      }
    }
  }
  else if [application] =~ "apmd" {
    grok {
      match => {
        "inner_msg" => [
          "(?P<description>.*?Username '%{DATA:user}'.*?)"
          "%{GREEDYDATA:description}"
        ]
      }
      overwrite => ["user", "description"]
    }
  }
  else if [application] == "httpd" {
    grok {
      match => {
        "inner_msg" => [
          "user=%{DATA:user}\\(.*?\\s+level=%{DATA:role}\\s+tty=%{DATA}\\s+host=%{IP:host_ip}"
        ]
      }
      overwrite => ["user", "role", "host_ip"]
      on_error => "httd_grok_parse_failure"
    }

    if [httd_grok_parse_failure] {
      mutate {
        replace => {
          "description" => "%{inner_msg}"
        }
      }
    }

    if [role] != "" {
      mutate {
        replace => {
          "user_role.name" => "%{role}"
        }
      }

      if [role] =~ "(?i)admin" {
        mutate {
          replace => {
            "user_role.type" => "ADMINISTRATOR"
          }
        }
      }

      mutate {
        merge => {
          "principal.user.attribute.roles" => "user_role"
        }
      }
    }
  }
  else {
    mutate {
      replace => {
        "description" => "%{inner_msg}"
      }
    }
  }

  if [cmd_data] != "" {
    mutate{
      replace =>{
        "principal.process.command_line" => "%{cmd_data}"
      }
      on_error => "cmd_data_replace_failed"
    }
  }
  if [user] != "" {
    mutate {
      gsub => ["user", "(id|ID)\\\\", ""]
    }
    mutate {
      replace => {
        "principal.user.userid" => "%{user}"
      }
    }
  }

  if [folder] != "" {
    mutate {
      replace => {
        "principal.process.file.full_path" => "%{folder}"
      }
    }
  }

  if [status] != "" {
    mutate {
      gsub => ["status", "\\[|\\]", ""]
    }
    mutate {
      replace => {
        "security_result.summary" => "%{status}"
      }
      on_error => "status_replace_failed"
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{description}"
      }
    }
  }

  if [security_result_action] != "" {
    mutate {
      merge => {
        "security_result.action" => "security_result_action"
      }
    }
  }

  if [severity] != "" {
    mutate {
      replace => {
        "security_result.severity_details" => "%{severity}"
      }
    }
    mutate {
      uppercase => [ "severity" ]
    }
  }

  if [severity] == "CRITICAL" {
    mutate {
      replace => {
        "security_result.severity" => "CRITICAL"
      }
    }
  }
  else if [severity] =~ "(?i)ERR" {
     mutate {
      replace => {
        "security_result.severity" => "ERROR"
      }
    }
  }
  else if [severity] in ["ALERT", "EMERGENCY"] {
     mutate {
      replace => {
       "security_result.severity" => "HIGH"
      }
    }
  }
  else if [severity] in ["INFO", "NOTICE"] {
     mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  }
  else if [severity] == "DEBUG" {
     mutate {
      replace => {
        "security_result.severity" => "LOW"
      }
    }
  }
  else if [severity] =~ "(?i)WARN" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
    }
  }

  if [metadata_event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{metadata_event_type}"
      }
    }
  }
  else if [user] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [principal_ip] != "" or [principal_hostname] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "IBM_SAFENET"
      "metadata.vendor_name" => "IBM"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
