# Product: STEALTHBITS_PAM
# Category: Privileged Access Management Solution
# Supported Format: CEF + KV
# Reference: N/A
# Last Updated: 2023-11-07
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "timestamp" => ""
      "vendor_name" => ""
      "product_name" => ""
      "product_version" => ""
      "main_message" => ""
      "event_type" => ""
      "security_result" => ""
      "security_category" => ""
      "auth_mechanism" => ""
      "has_principal_userid" => "false"
      "has_principal_ip" => "false"
      "has_principal_resource" => "false"
      "has_principal_hostname" => "false"
      "has_target_userid" => "false"
      "has_target_hostname" => "false"
      "has_target_ip" => "false"
      "has_target_userdisplayname" => "false"
      "auth_type" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "extensions" => ""
      "metadata" => ""
      "no_kv_present" => ""
      "EventTimeUtc" => ""
      "EventLoggedInUserName" => ""
      "EventLoggedInFromIPAddress" => ""
      "EventAccessPolicyName" => ""
      "EventSourceHost" => ""
      "EventServiceType" => ""
      "EventType" => ""
      "EventStatus" => ""
      "EventMessage" => ""
      "ActivitySessionCreatedByUserName" => ""
      "ActivitySessionCreateFromAddress" => ""
      "ActivitySessionCreatedDateTimeUtc" => ""
      "ActivitySessionLoginAccountName" => ""
      "ActivitySessionSattus" => ""
      "ActivitySessionStatusDescription" => ""
      "ManagedAccountName" => ""
      "ManagedAccounttype" => ""
      "ManagedResourceName" => ""
      "ManagedResourceType" => ""
      "ManagedSourceHostName" => ""
      "ManagedResourceHostDistinguishedName" => ""
      "ManagedResourceHostIPAddress" => ""
      "ManagedResourceHostOS" => ""
      "ManagedResourceHostDNSHostName" => ""
      "ManagedResourceHostNetBIOSName" => ""
      "drop_logs" => "false"
    }
  }

  if [message] =~ "CEF:1.0" {
    grok {
      match => {
        "message" => [
          "%{TIMESTAMP_ISO8601:timestamp}\\|%{DATA}\\|%{DATA}CEF:1.0\\|%{DATA:vendor_name}\\|%{DATA:product_name}\\|%{DATA:product_version}\\|%{DATA}\\|%{INT}\\|%{GREEDYDATA:main_message}"
          ]
      }
      on_error => "grok_fail"
      overwrite  => ["timestamp","vendor_name","product_name","product_version","main_message"]
    }
  }

  if ![grok_fail] and [main_message] != "" {
    kv {
      "source" => "main_message"
      "field_split" => "|"
      "value_split" => "="
      on_error => "not_kv"
    }
    if [not_kv] {
      mutate {
        replace => {
          "drop_logs" => "true"
        }
      }
    }
  }
  else {
    mutate {
      replace => {
        "drop_logs" => "true"
      }
    }
  }

  if [drop_logs] == "true" {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [EventTimeUtc] != "" {
    date {
      match => ["EventTimeUtc", "LDAP", "UNIX", "ISO8601"]
      target => "metadata.event_timestamp"
      on_error => "no_match_for_timestamp"
    }
  }

  if [vendor_name] != "" {
    mutate {
      replace => {
        "metadata.vendor_name" => "%{vendor_name}"
      }
      on_error => "vendor_name_not_present"
    }
  }

  if [product_name] != "" {
    mutate {
      replace => {
        "metadata.product_name" => "%{product_name}"
      }
      on_error => "product_name_not_present"
    }
  }

  if [product_version] != "" {
    mutate {
      replace => {
        "metadata.product_version" => "%{product_version}"
      }
      on_error => "product_version_not_present"
    }
  }

  if [EventLoggedInUserName] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{EventLoggedInUserName}"
        "has_target_userid" => "true"
      }
      on_error => "no_username"
    }
  }

  if [EventLoggedInFromIPAddress] != "" {
    mutate {
      merge => {
        "target.ip" => "EventLoggedInFromIPAddress"
      }
      replace => {
        "has_target_ip" => "true"
      }
      on_error => "not_an_ip"
    }
  }

  if [EventAccessPolicyName] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{EventAccessPolicyName}"
      }
      on_error => "invalid_policy"
    }
  }

  if [EventSourceHost] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{EventSourceHost}"
        "has_target_hostname" => "true"
      }
      on_error => "hostname_not_present"
    }
  }

  if [EventType] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{EventType}"
      }
      on_error => "product_event_type_not_present"
    }
  }

  if [EventStatus] =~ "(?i)inform" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  }
  else if [EventStatus] =~ "(?i)Error" {
    mutate {
      replace => {
        "security_result.severity" => "ERROR"
      }
    }
  }
  else if [EventStatus] =~ "(?i)Warning" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
    }
  }
  else {
    mutate {
      replace => {
        "security_result.severity" => "UNKNOWN_SEVERITY"
      }
    }
  }

  if [EventMessage] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{EventMessage}"
      }
      on_error => "event_description_not_present"
    }
  }

  if [ActivitySessionCreatedByUserName] != "" {
    mutate {
      replace => {
        "Activity_Session_UserName_label.key" => "ActivitySessionCreatedByUserName"
        "Activity_Session_UserName_label.value" => "%{ActivitySessionCreatedByUserName}"
      }
      merge => {
        "target.user.attribute.labels" => "Activity_Session_UserName_label"
      }
    }
  }

  if [ActivitySessionCreatedDateTimeUtc] != "" {
    mutate {
      replace => {
        "Activity_Session_Time_label.key" => "ActivitySessionCreatedDateTimeUtc"
        "Activity_Session_Time_label.value" => "%{ActivitySessionCreatedDateTimeUtc}"
      }
      merge => {
        "target.user.attribute.labels" => "Activity_Session_Time_label"
      }
    }
  }

  if [ActivitySessionCreateFromAddress] != "" {
    mutate {
      replace => {
        "Activity_Session_IP_label.key" => "ActivitySessionCreateFromAddress"
        "Activity_Session_IP_label.value" => "%{ActivitySessionCreateFromAddress}"
      }
      merge => {
        "target.user.attribute.labels" => "Activity_Session_IP_label"
      }
    }
  }

  if [ActivitySessionLoginAccountName] != "" {
    mutate {
      replace => {
        "Activity_Session_Login_Name_label.key" => "ActivitySessionLoginAccountName"
        "Activity_Session_Login_Name_label.value" => "%{ActivitySessionLoginAccountName}"
      }
      merge => {
        "target.user.attribute.labels" => "Activity_Session_Login_Name_label"
      }
    }
  }

  if [ActivitySessionSattus] != "" {
    mutate {
      replace => {
        "Activity_Session_Status_label.key" => "ActivitySessionSattus"
        "Activity_Session_Status_label.value" => "%{ActivitySessionSattus}"
      }
      merge => {
        "target.user.attribute.labels" => "Activity_Session_Status_label"
      }
    }
  }

  if [ActivitySessionStatusDescription] != "" {
    mutate {
      replace => {
        "Activity_Session_Status_Description_label.key" => "ActivitySessionStatusDescription"
        "Activity_Session_Status_Description_label.value" => "%{ActivitySessionStatusDescription}"
      }
      merge => {
        "target.user.attribute.labels" => "Activity_Session_Status_Description_label"
      }
    }
  }

  if [ManagedAccountName] != "" {
    mutate {
      replace => {
        "target.user.user_display_name" => "%{ManagedAccountName}"
        "has_target_userdisplayname" => "true"
      }
      on_error => "no_display_name"
    }
  }

  if [ManagedAccounttype] != "" {
    mutate {
      replace => {
        "target.user.role_name" => "%{ManagedAccounttype}"
      }
      on_error => "account_type_not_present"
    }
  }

  if [ManagedResourceName] != "" {
    mutate {
      replace => {
        "principal.resource.name" => "%{ManagedResourceName}"
        "has_principal_resource" => "true"
      }
      on_error => "resource_name_not_present"
    }
  }

  if [ManagedResourceType] != "" {
    mutate {
      replace => {
        "Resource_Type_Label.key" => "Resource Type"
        "Resource_Type_Label.value" => "%{ManagedResourceType}"
      }
      merge => {
        "principal.resource.attribute.labels" => "Resource_Type_Label"
      }
      on_error => "resource_type_not_present"
    }
  }

  if [ManagedResourceHostIPAddress] != "" {
    mutate {
      merge => {
        "principal.ip" => "ManagedResourceHostIPAddress"
      }
      replace => {
        "has_principal_ip" => "true"
      }
      on_error => "not_an_ip"
    }
  }

  if [ManagedResourceHostOS] != "" {
    mutate {
      replace => {
        "principal.platform_version" => "%{ManagedResourceHostOS}"
      }
      on_error => "host_os_not_present"
    }
  }

  if [ManagedResourceHostDNSHostName] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{ManagedResourceHostDNSHostName}"
        "has_principal_hostname" => "true"
      }
      on_error => "hostname_not_present"
    }
  }

  if [ManagedResourceHostDistinguishedName] != "" {
    mutate {
      merge => {
        "principal.user.group_identifiers" => "ManagedResourceHostDistinguishedName"
      }
      on_error => "group_identifiers_not_present"
    }
  }

  if [ManagedResourceHostNetBIOSName] != "" {
    mutate {
      replace => {
        "additonal_network_labels.key" => "NET BIOS"
        "additonal_network_labels.value.string_value" => "%{ManagedResourceHostNetBIOSName}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additonal_network_labels"
      }
      on_error => "netbios_not_present"
    }
  }

  if [has_target_userid] == "true" or [has_principal_userid] == "true" and [target] != ""{
    mutate {
      replace => {
        "event_type" => "USER_LOGIN"
      }
    }
    mutate {
      replace => {
        "extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
        "auth_mechanism" => "USERNAME_PASSWORD"
      }
    }
    mutate {
      merge => {
        "extensions.auth.mechanism" => "auth_mechanism"
      }
    }
  }
  else if [has_principal_userid] == "true" and [target] == "" {
    mutate {
      replace => {
        "event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if ([has_principal_ip] == "true" or [has_principal_hostname] == "true") and [target] == "" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "sec_result_error"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
