# Product: CIENA_ROUTER
# Category: Application server logs
# Supported Format: SYSLOG
# Reference: NA
# Last Updated: 2025-01-16
# Copyright 2025 Chronicle LLC

filter {
  mutate {
    replace => {
      "event_time" => ""
      "prin_ip" => ""
      "mac_add" => ""
      "prin_host" => ""
      "product_event" => ""
      "chassis_type" => ""
      "app" => ""
      "app_protocol" => ""
      "app_pid" => ""
      "msg" => ""
      "msg1" => ""
      "msg2" => ""
      "tar_ip" => ""
      "prin_port" => ""
      "tar_port" =>""
      "description" =>""
      "method" => ""
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "extensions" => ""
      "network" => ""
      "has_principal" => "false"
      "vlan_id" => ""
      "service_id" => ""
      "has_target" => "false"
      "user_id"=>""
      "tar_path" => ""
    }
  }
  if [message] != ""  {
    grok {
      match => {
        "message" => [
          '%{IP:prin_ip} - %{DATA:prin_host} \\[%{DATA:event_time}\\] \\"%{DATA:method} %{DATA}\\" %{GREEDYDATA}'
          "<%{INT}>%{SYSLOGTIMESTAMP:event_time} \\[%{DATA}\\] %{IP:prin_ip} %{MAC:mac_add} %{DATA:prin_host} %{DATA:product_event}: chassis\\(%{INT:chassis_type}\\): :%{DATA:app}\\[%{INT:app_pid}\\]: %{GREEDYDATA:msg}"
          "<%{INT}>%{SYSLOGTIMESTAMP:event_time} \\[%{DATA}\\] %{IP:prin_ip} %{MAC:mac_add} %{DATA:prin_host} %{DATA:product_event}: chassis\\(%{INT:chassis_type}\\): :%{GREEDYDATA:msg2}"
          "<%{INT}>%{SYSLOGTIMESTAMP:event_time} \\[%{DATA}\\] %{IP:prin_ip} %{MAC:mac_add} %{DATA:prin_host} %{DATA:product_event}: chassis\\(%{INT:chassis_type}\\): %{GREEDYDATA:msg1}"
          "<%{INT}>%{SYSLOGTIMESTAMP:event_time} \\[%{DATA}\\] %{IP:prin_ip} %{MAC:mac_add} %{DATA:prin_host} %{DATA:product_event}: %{DATA}\\(%{DATA:vlan}%{INT:vlan_id}\\): :%{DATA}%{DATA:service_id}, %{GREEDYDATA:description}"

        ]
      }
      overwrite => ["event_time","prin_ip","mac_add", "prin_host", "product_event", "chassis_type", "app", "app_pid", "msg","msg1", "msg2","method","vlan_id", "service_id","description","vlan"]
      on_error => "not_matched"
    }
  }
  if [msg] !="" {
      grok {
        match => {
          "msg" => [
            "%{DATA:description} from %{IP:tar_ip} port %{INT:tar_port} on %{IP} port %{INT:prin_port}"
            "%{DATA:description} from %{IP:tar_ip} port %{INT:tar_port} ssh2"
            "%{GREEDYDATA:description}"
          ]
        }
        overwrite => ["description","tar_ip","prin_port","tar_port"]
        on_error => "msg_accepted_no_matched"
      }
  }
  if [msg1] != "" {
    grok {
      match => {
        "msg1" => [
          "%{DATA:app_protocol} %{DATA}%{IP:tar_ip} %{DATA:description} %{IP:ip}%{GREEDYDATA}"
          "User %{DATA:user_id}:%{GREEDYDATA:description}"
          "%{DATA:app_protocol} %{DATA} %{IP:tar_ip} %{GREEDYDATA:description}"
        ]
      }
      overwrite => ["app_protocol","tar_ip","description","user_id"]
      on_error => "msg1_accepted_no_matched"
    }
  }
  if [msg2] != "" {
    grok {
      match => {
        "msg2" => [
        "%{DATA:description} %{IP:tar_ip} %{GREEDYDATA}"
        "%{DATA:app_protocol} %{DATA:description} %{IP:tar_ip}%{GREEDYDATA}"
        ]
      }
      overwrite => ["tar_ip","description","app_protocol"]
      on_error => "msg2_accepted_no_matched"
    }
  }
  if [event_time] != "" {
    date {
      match => ["event_time", "ISO8601", "MMM dd HH:mm:ss", "MMM d HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      rebase => true
      on_error => "timestamp_error"
    }
  }
    if [product_event] != "" {
    mutate {
      replace ={
        "event.idm.read_only_udm.metadata.product_event_type" => "%{product_event}"
      }
      on_error => "product_event_error"
    }
  }
  if [description] != "" {
    mutate {
      replace => {
      "event.idm.read_only_udm.metadata.description" => "%{description}"
      }
      on_error => "description_error"
    }
  }
  if [prin_ip] != "" {
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "prin_ip"
      }
      on_error => "prin_ip_error"
    }
  }
  if [mac_add] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.mac" => "mac_add"
      }
      on_error => "mac_add_error"
    }
  }
  if [prin_host] != "" {
        mutate {
      replace => {
        "has_principal" => "true"
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.hostname" => "%{prin_host}"
        "event.idm.read_only_udm.principal.hostname" => "%{prin_host}"
      }
      on_error => "prin_host_error"
    }
  }
  if [prin_port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.port" => "%{prin_port}"
      }
      on_error => "prin_port_principal_error"
    }
  }
  if [prin_host] != "" {
     mutate {
      convert => {
        "event.idm.read_only_udm.principal.port" => "integer"
      }
      on_error => "prin_port_convert_error"
    }
  }
  if [tar_ip] != "" {
    mutate {
      replace => {
        "has_target" => "true"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "tar_ip"
      }
      on_error => "tar_ip_error"
    }
  }
  if [tar_port] != "" {
    mutate {
      replace => {
        "has_target" => "true"
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.target.port" => "%{tar_port}"
      }
      convert => {
        "event.idm.read_only_udm.target.port" => "integer"
      }
    }
  }
  if [app_pid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.pid" => "%{app_pid}"
      }
    }
  }
  if [description] != "" {
    grok {
      match => {
        "msg1" => [
          "User %{DATA:user_id}:File transfer result: DownloadManager: File %{DATA:tar_path}transferred %{GREEDYDATA}"
          "User %{DATA:user_id}:%{GREEDYDATA:description}"
        ]
      }
      overwrite => ["user_id","tar_path","description"]
      on_error => "description_user_id_no_matched"
    }
  }
  if [user_id] != ""{
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{user_id}"
      }
      on_error => "user_id_error"
    }
  }
  if [tar_path] != ""{
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{tar_path}"
      }
      on_error => "tar_path_error"
    }
  }
  if [chassis_type] != "" {
    mutate {
      replace => {
        "chassis_type_label.key" => "chassis_type"
        "chassis_type_label.value.string_value" => "%{chassis_type}"
      }
      on_error => "chassis_type_error"
    }
    if ![chassis_type_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "chassis_type_label"
        }
        on_error => "chassis_type_merge_failure"
      }
    }
  }
  if [vlan_id] != "" {
    mutate {
      replace => {
        "vlan_id_label.key" => "vlan_id"
        "vlan_id_label.value.string_value" => "%{vlan_id}"
      }
      on_error => "vlan_id_error"
    }
    if ![vlan_id_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "vlan_id_label"
        }
        on_error => "vlan_id_merge_failure"
      }
    }
  }
  if [service_id] != "" {
    mutate {
      replace => {
        "service_id_label.key" => "service_id"
        "service_id_label.value.string_value" => "%{service_id}"
      }
      on_error => "service_id_error"
    }
    if ![service_id_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "service_id_label"
        }
        on_error => "service_id_merge_failure"
      }
    }
  }
  if [method] in ["GET", "HEAD", "POST", "PUT", "DELETE",
                  "CONNECT", "OPTIONS", "TRACE", "PATCH",
                  "CCM_POST", "CERTVERIFY"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{method}"
      }
      on_error => "method_error"
    }
  }
  if [app] == "sshd" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "SSH"
      }
    }
  }
  if [app_protocol] !="" and [app_protocol] in ["SSH", "SNMP"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "%{app_protocol}"
      }
      on_error => "app_protocol_error"
    }
  }
   if [app_protocol] == "snmp" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "SNMP"
      }
    }
  }
  if [has_target]== "true" and [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  mutate {
        replace => {
          "event.idm.read_only_udm.metadata.vendor_name" => "CIENA_ROUTER"
          "event.idm.read_only_udm.metadata.product_name" => "CIENA_ROUTER"
        }
      }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
