# Product: Stealthbits
# Category: File system monitoring
# Supported Format: JSON
# Reference: see below
# Last Updated: 2021-11-09
# Copyright 2022 Chronicle LLC


# Additional references:
# https://stealthbits.com/file-activity-monitoring-solution/
# https://www.stealthbits.com/jdownloads/Documentation%20User%20Guides%20PDF/Stealthbits_SI_AdminConsoleUserGuide.pdf

filter {
  mutate {
    replace => {
      "file_path" => ""
      "target_administrative_domain" => ""
      "target_ip" => ""
      "target_hostname" => ""
      "intermediary_domain" => ""
      "product_event_type" => ""
      "event_type" => ""
      "event_description" => ""
      "event_timestamp" => ""
      "kv_data" => ""
      "security_result" => ""
      "blocked_event" => ""
      "successful_change" => ""
      "additional_field" => ""
      "additional_old_value" => ""
      "additional_new_value" => ""
      "process_name" => ""
      "OldAttributeValue" => ""
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "Stealthbits"
      "event.idm.read_only_udm.metadata.product_name" => "StealthINTERCEPT"
    }
  }

  grok {
    match => {
      "message" => [
           "%{TIMESTAMP_ISO8601} %{DATA:intermediary_domain} (?P<event_timestamp>\\d{4}\-\\d{2}\-\\d{2}\ \\d{2}\:\\d{2}\:\\d{2}\.\\d{3}) %{DATA} - %{DATA:product_event_type} - PolicyName=\\\"%{DATA:event_description}\\\" %{GREEDYDATA:kv_data}"
          ]
    }
    overwrite => ["event_timestamp", "intermediary_domain", "product_event_type", "event_description", "kv_data"]
  }

  date {
    match => ["event_timestamp","yyyy-MM-dd HH:mm:ss.SSS"]
  }

  mutate {
    gsub => [
       "kv_data", "\"", ""
    ]
  }

  kv {
    source => "kv_data"
    field_split => " "
    value_split => "="
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.description"                     => "%{event_description}"
      "event.idm.read_only_udm.metadata.product_event_type"              => "%{product_event_type}"
    }
  }

  if [product_event_type] == "Windows File System Update" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type"              =>        "FILE_MODIFICATION"
      }
    }
  }
  else if [product_event_type] == "Active Directory Object Modified" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type"              =>        "USER_UNCATEGORIZED"
      }
    }
  }
  else if [product_event_type] == "Windows File System Read" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type"              =>        "FILE_READ"
      }
    }
  }

  if [TargetHostIP] != "n/a" {
    mutate {
      replace => {
        "target_ip"        => "%{TargetHostIP}"
        "target_hostname"  => "%{TargetHost}"
      }
    }
  }
  else {
    mutate {
      replace => {
        "target_ip"         => "%{ServerAddress}"
        "target_hostname"   => "%{Server}"
      }
    }
  }

  mutate {
    merge => {
      "event.idm.read_only_udm.principal.ip" => "ClientAddress"
    }
  }

  mutate {
    replace   => {
      "event.idm.read_only_udm.principal.hostname" => "%{ClientHost}"
    }
  }

  mutate {
    gsub => [
       "target_hostname", "(\\w+)\\\\", ""
    ]
  }

  mutate {
    merge => {
      "event.idm.read_only_udm.target.ip" => "target_ip"
    }
  }

  mutate {
    replace   => {
      "event.idm.read_only_udm.target.hostname" => "%{target_hostname}"
    }
  }

  mutate {
    replace => {
      "target_administrative_domain"      => "%{Domain}"
      "file_path"                         => "%{DistinguishedName}"
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.target.administrative_domain"             => "%{target_administrative_domain}"
    }
  }

  if [ModifiedObject] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.name"  => "%{ModifiedObject}"
      }
    }
  }

    mutate {
      replace => {
        "additional_field.key" => "Perpetrator"
        "additional_field.value.string_value" => "%{Perpetrator}"
      }
    }

    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_field"
      }
    }

  if [Operation] == "Change" {
    mutate {
      replace => {
        "additional_old_value.key" => "%{AttributeName} - old_value"
        "additional_old_value.value.string_value" => "%{OldAttributeValue}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_old_value"
      }
    }

    mutate {
      replace => {
        "additional_new_value.key" => "%{AttributeName} - new_value"
        "additional_new_value.value.string_value" => "%{NewAttributeValue}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_new_value"
      }
    }
   }

  if [Operation] == "" {
    if [AttributeName] == "ProcessName" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.command_line" => "%{NewAttributeValue}"
        }
      }
    }
  }

  mutate {
    rename => {
      "file_path" => "event.idm.read_only_udm.target.file.full_path"
    }
  }

  mutate {
    replace => {
      "intermediary.hostname" => "%{intermediary_domain}"
    }
  }

  mutate {
    merge => {
      "event.idm.read_only_udm.intermediary" => "intermediary"
    }
  }

  if [BlockedEvent] == "False" {
    mutate {
      replace => {
        "blocked_event" => "ALLOW"
      }
    }
  }
  else {
    mutate {
      replace => {
        "blocked_event" => "BLOCK"
      }
    }
  }

  mutate {
    merge => {
      "security_result.action"  => "blocked_event"
    }
  }

  if [Operation] != "" {
    mutate {
      merge => {
        "security_result.category_details"  => "Operation"
      }
    }
  }

  mutate {
    merge => {
      "event.idm.read_only_udm.security_result"  => "security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
 }
