# Product: CISCO_UMBRELLA_SWG_DLP
# Category: DLP
# Supported Format: CSV
# Reference: NA
# Last Updated: 2025-10-07
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "security_result" => ""
      "extensions" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "column1" => ""
      "column2" => ""
      "column3" => ""
      "column4" => ""
      "column6" => ""
      "column7" => ""
      "column8" => ""
      "column9" => ""
      "column10" => ""
      "column14" => ""
      "column17" => ""
      "column25" => ""
      "has_user" => "false"
      "intermediary" => ""
      "action" => ""
      "column41" => ""
      "column44" => ""
      "column49" => ""
      "column16" => ""
      "column24" => ""
      "timestamp" => ""
      "hostname" => ""
      "program" => ""
      "message_id" => ""
      "val1" => ""
      "val2" => ""
      "kv_data" => ""
      "app_protocol_output" => ""
    }
  }
  mutate {
    gsub => ["message", ">", ""]
  }
  mutate {
    gsub => ["message", "<", ""]
  }
  mutate {
    gsub => ["message", ' "Confidential', '"Confidential']
  }
  csv {
    source => "message"
    seperator => ","
    on_error => "csv_failed"
  }

  if [csv_failed] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  if [column1] != "" {
    date {
      match => ["column1", "ISO8601", "yyyy-MM-dd HH:mm:ss"]
      on_error => "date_failed"
    }
  }
  if [column2] =~ "DBSG" {
    if [column2] != "" {
      mutate {
        replace => {
          "principal.hostname" => "%{column2}"
          "principal.asset.hostname" => "%{column2}"
          "has_principal" => "true"
        }
        on_error => "no_principal_hostname"
      }
    }
    if [column3] != "" {
      mutate {
        merge => {
          "principal.ip" => "column3"
          "principal.asset.ip" => "column3"
        }
        on_error => "no_principal_ip"
      }
      if ![no_principal_ip] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }

    if [column4] != "" {
      mutate {
        merge => {
          "target.ip" => "column4"
          "target.asset.ip" => "column4"
        }
        on_error => "no_target_ip"
      }
      if ![no_target_ip] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }

    if [column5] != "" {
      mutate {
        merge => {
          "intermediary.ip" => "column5"
        }
        on_error => "no_intermediary_ip"
      }
    }

    if [column6] != "" {
      mutate {
        replace => {
          "principal.file.mime_type" => "%{column6}"
        }
        on_error => "no_content_type"
      }
    }

    if [column7] == "ALLOWED" {
      mutate {
        replace => {
          "action" => "ALLOW"
        }
        on_error => "no_action"
      }
    }

    if [action] != "" {
      mutate {
        merge => {
          "security_result.action" => "action"
        }
        on_error => "no_action"
      }
    }

    if [column8] != "" {
      mutate {
        replace => {
          "target.url" => "%{column8}"
        }
        on_error => "no_url"
      }
    }

    if [column9] != "" {
      mutate {
        replace => {
          "network.http.referral_url" => "%{column9}"
        }
        on_error => "no_referral_url"
      }
    }

    # User Agent
    if [column10] != "" {
      mutate {
        replace => {
          "network.http.user_agent" => "%{column10}"
        }
        on_error => "no_user_agent"
      }
      mutate {
        convert => {
          "column10" => "parseduseragent"
        }
        on_error => "http_user_agent_conversion_failure"
      }
      if ![http_user_agent_conversion_failure] {
        mutate {
          rename => {
            "column10" => "network.http.parsed_user_agent"
          }
        }
      }
    }

    # HTTP Status Code
    if [column11] != "" {
      mutate {
        replace => {
          "network.http.response_code" => "%{column11}"
        }
        on_error => "no_response_code"
      }
      mutate {
        convert => {
          "network.http.response_code" => "integer"
        }
        on_error => "no_response_code"
      }
    }

    if [column15] != "" {
      mutate {
        replace => {
          "security_result.about.file.sha256" => "%{column15}"
        }
        on_error => "no_asset_id"
      }
    }

    if [column16] != "" {
      mutate {
        replace => {
          "metadata.product_event_type" => "%{column16}"
        }
        on_error => "no_product_event_type"
      }
    }

    if [column22] != "" {
      mutate {
        replace => {
          "security_result.summary" => "%{column22}"
        }
        on_error => "no_summary"
      }
    }

    if [column26] != "" {
      mutate {
        replace => {
          "network.http.method" => "%{column26}"
        }
        on_error => "no_method"
      }
    }

    if [column29] != "" {
      mutate {
        replace => {
          "file_type_label.key" => "File Type"
          "file_type_label.value.string_value" => "%{column29}"
        }
        on_error => "no_file_type"
      }
      if ![no_file_type] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "file_type_label"
          }
          on_error => "no_file_type"
        }
      }
    }

    if [column41] != "" {
      mutate {
        replace => {
          "principal.asset.asset_id" => "asset:%{column41}"
        }
        on_error => "no_asset_id"
      }
    }

    if [column44] != "" {
      mutate {
        replace => {
          "principal.user.userid" => "%{column44}"
          "has_user" => "true"
        }
        on_error => "no_url"
      }
    }

    if [column49] != "" {
      mutate {
        replace => {
          "metadata.product_log_id" => "%{column49}"
        }
        on_error => "no_product_log_id"
      }
    }

  }
  else {
    if [column2] != "" {
      mutate {
        replace => {
          "metadata.product_event_type" => "%{column2}"
        }
        on_error => "no_product_event_type"
      }
    }
    else {
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }
    if [column2] =~ "Real Time|SaaS API" {
      if [column11] != "" {
        mutate {
          replace => {
            "security_result.rule_name" => "%{column11}"
          }
          on_error => "no_rule_name"
        }
      }

      if [column12] != "" {
        mutate {
          merge => {
            "security_result.category_details" => "column12"
          }
          on_error => "no_category"
        }
      }
      if [column24] =~ "^[0-9]+$" {
        mutate {
          replace => {
            "target.port" => "%{column24}"
          }
          on_error => "no_target_port"
        }
        if ![no_target_port] {
          mutate {
            convert => {
              "target.port" => "integer"
            }
            on_error => "target_port_conversion_failure"
          }
        }
      }

      if [column22] != "" {
        mutate {
          replace => {
            "app_protocol_src" => "%{column22}"
            "app_protocol_output" => ""
          }
          on_error => "no_app_protocol_src"
        }
        # This file contains application protocol parsing logic
        # Interface:
        # app_protocol_src (required): string that contains application protocol or a
        # port number
        # app_protocol_output: string that is either empty or contains application
        # protocol compatible to ApplicationProtocol enum in
        # udm.proto
        mutate {
          uppercase => [ "app_protocol_src" ]
        }

        if [app_protocol_src] in [ "22", "SSH", "SSHD" ] {
          mutate {
            replace => {
              "app_protocol_output" => "SSH"
            }
          }
        }
        else if [app_protocol_src] in [ "25", "SMTP" ] {
          mutate {
            replace => {
              "app_protocol_output" => "SMTP"
            }
          }
        }
        else if [app_protocol_src] in [ "53", "DNS" ] {
          mutate {
            replace => {
              "app_protocol_output" => "DNS"
            }
          }
        }
        else if [app_protocol_src] in [ "80", "8080", "HTTP" ] {
          mutate {
            replace => {
              "app_protocol_output" => "HTTP"
            }
          }
        }
        else if [app_protocol_src] in [ "443", "HTTPS", "TLS" ] {
          mutate {
            replace => {
              "app_protocol_output" => "HTTPS"
            }
          }
        }
        else if [app_protocol_src] in [ "7400", "7401", "7402", "DDS" ] {
          mutate {
            replace => {
              "app_protocol_output" => "DDS"
            }
          }
        }
        else if [app_protocol_src] in [ "SMB", "SMBV1" ] {
          mutate {
            replace => {
              "app_protocol_output" => "SMB"
            }
          }
        }
        else if [app_protocol_src] in [
          "UNKNOWN_APPLICATION_PROTOCOL", "AFP", "APPC", "AMQP", "ATOM", "BEEP",
          "BITCOIN", "BIT_TORRENT", "CFDP", "COAP", "DEVICE_NET", "DHCP", "E_DONKEY",
          "ENRP", "FAST_TRACK", "FINGER", "FREENET", "FTAM", "GOPHER", "HL7", "H323",
          "IRCP", "KADEMLIA", "LDAP", "LPD", "MIME", "MODBUS", "MQTT", "NETCONF",
          "NFS", "NIS", "NNTP", "NTCIP", "NTP", "OSCAR", "PNRP", "QUIC", "RDP", "RELP",
          "RIP", "RLOGIN", "RPC", "RTMP", "RTP", "RTPS", "RTSP", "SAP", "SDP", "SIP",
          "SLP", "SNTP", "SSMS", "STYX", "TCAP", "TDS", "TOR", "TSP", "VTP", "WHOIS",
          "WEB_DAV", "X400", "X500", "XMPP", "IEC104", "DCERPC"
        ] {
          mutate {
            replace => {
              "app_protocol_output" => "%{app_protocol_src}"
            }
          }

        } else {
          mutate {
            replace => {
              "app_protocol_output" => ""
            }
          }
        }
        if [app_protocol_output] != "" {
          mutate {
            replace => {
              "network.application_protocol" => "%{app_protocol_output}"
            }
            on_error => "no_app_protocol"
          }
        }
      }
      if [column20] != "" {
        mutate {
          replace => {
            "security_result.rule_set" => "%{column20}"
          }
          on_error => "no_rule_set"
        }
      }
      if [column15] != "" {
        mutate {
          replace => {
            "target.file.size" => "%{column15}"
          }
          on_error => "no_file_size"
        }
        mutate {
          convert => {
            "target.file.size" => "uinteger"
          }
          on_error => "file_size_conversion_failure"
        }
      }
      if [column13] != "" {
        mutate {
          replace => {
            "security_result.threat_name" => "%{column13}"
          }
          on_error => "no_threat_name"
        }
      }
      if [column10] != "" {
        mutate {
          replace => {
            "security_result.action_details" => "%{column10}"
          }
          on_error => "no_action"
        }
      }
      if [column5] != "" {
        mutate {
          replace => {
            "column5_label.key" => "policy_group"
            "column5_label.value.string_value" => "%{column5}"
          }
          on_error => "no_source"
        }
        if ![no_source] {
          mutate {
            merge => {
              "event.idm.read_only_udm.additional.fields" => "column5_label"
            }
            on_error => "source_label_error"
          }
        }
      }
      if [column23] != "" {
        mutate {
          merge => {
            "principal.ip" => "column23"
            "principal.asset.ip" => "column23"
          }
          on_error => "principal_ip_empty"
        }
        if ![principal_ip_empty] {
          mutate {
            replace => {
              "has_principal" => "true"
            }
          }
        }
      }
      if [column4] != "" {
        mutate {
          uppercase => ["column4"]
        }
        if [column4] == "LOW" {
          mutate {
            replace => {
              "security_result.severity" => "LOW"
            }
          }
        }
        else if [column4] == "MEDIUM" {
          mutate {
            replace => {
              "security_result.severity" => "MEDIUM"
            }
          }
        }
        else if [column4] == "HIGH" {
          mutate {
            replace => {
              "security_result.severity" => "HIGH"
            }
          }
        }
        else if [column4] == "CRITICAL" {
          mutate {
            replace => {
              "security_result.severity" => "CRITICAL"
            }
          }
        }
      }
      if [column16] =~ "^[0-9a-f]{64}$" {
        mutate {
          replace => {
            "target.process.file.sha256" => "%{column16}"
          }
          on_error => "column16_empty"
        }
      }
      if [column19] == "OUTBOUND" {
        mutate {
          replace => {
            "network.direction" => "OUTBOUND"
          }
        }
      }
      else if [column19] == "INBOUND" {
        mutate {
          replace => {
            "network.direction" => "INBOUND"
          }
        }
      }
    }
    if [column3] != "" {
      mutate {
        replace => {
          "target.asset.asset_id" => "asset:%{column3}"
        }
        on_error => "no_asset_id"
      }
    }
    if [column4] == "INFO" {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
        on_error => "no_severity"
      }
    }
    if [column6] =~ "^.+@.+$" {
      mutate {
        merge => {
          "target.user.email_addresses" => "column6"
        }
        on_error => "no_email"
      }
      if ![no_email] {
        mutate {
          replace => {
            "has_user" => "true"
          }
        }
      }
    }
    if [column7] != "" {
      mutate {
        replace => {
          "target.file.full_path" => "%{column7}"
        }
        on_error => "no_file_path"
      }
    }
    if [column8] != "" {
      mutate {
        replace => {
          "target.application" => "%{column8}"
        }
        on_error => "no_application"
      }
    }
    if [column9] != "" {
      mutate {
        replace => {
          "target.url" => "%{column9}"
        }
        on_error => "no_url"
      }
    }
    if [column10] == "MONITOR" {
      mutate {
        replace => {
          "security_result.action_details" => "%{column10}"
        }
        on_error => "no_action_details"
      }
    }
    if [column14] != "" {
      mutate {
        replace => {
          "target.file.mime_type" => "%{column14}"
        }
        on_error => "no_mime_type"
      }
    }
    if [column17] != "" {
      mutate {
        replace => {
          "column17_label.key" => "Access"
          "column17_label.value.string_value" => "%{column17}"
        }
        on_error => "no_access"
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "column17_label"
        }
        on_error => "no_access"
      }
    }
    if [column25] != "" {
      mutate {
        replace => {
          "metadata.product_log_id" => "%{column25}"
        }
        on_error => "no_product_log_id"
      }
    }
  }

  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
      on_error => "no_event_type"
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "UMBRELLA_SWG_DLP"
      "metadata.vendor_name" => "CISCO"
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
      on_error => "no_principal"
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
      on_error => "no_target"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
      on_error => "no_metadata"
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
      on_error => "no_network"
    }
  }

  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
      on_error => "no_extensions"
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
      on_error => "no_intermediary"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
