# Product: Talon
# Category: Security
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2023-12-21
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "batchId" => ""
      "device.ipAddress" => ""
      "device.userAgent" => ""
      "device.deviceUuid" => ""
      "device.hostname" => ""
      "device.os.type" => ""
      "device.browserType" => ""
      "device.browserVersion" => ""
      "device.browserBrand" => ""
      "event_platform" => ""
      "policy.ruleId" => ""
      "policy.ruleDescription" => ""
      "policy.action" => ""
      "user.externalId" => ""
      "user.name" => ""
      "user.id" => ""
      "user.email" => ""
      "user.tenantId" => ""
      "user.tenantExternalId" => ""
      "user.tenantName" => ""
      "network.http.method" => ""
      "network.protocol" => ""
      "network.url" => ""
      "principal" => ""
      "target" => ""
      "network1" => ""
      "metadata" => ""
      "additional" => ""
      "security_result" => ""
      "timestamp" => ""
      "prin_ip" => ""
      "has_principal" => "false"
      "has_target" => "false"
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [not_json] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [timestamp] != "" {
    date {
      match => ["timestamp", "ISO8601", "yyyy-MM-ddTHH:mm:ss.SSSSSSSSSZ"]
      on_error => "invalid_format"
    }
  }

  if [device][ipAddress] != "" {
    grok {
      match => {
        "device.ipAddress" => ["%{IP:prin_ip}"]
      }
      overwrite => ["prin_ip"]
      on_error => "prin_ip_failure"
    }
    if [prin_ip] != "" {
      mutate {
        merge => {
          "principal.ip" => "prin_ip"
        }
        on_error => "ipAddress_empty"
      }
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [user][email] =~ "^.+@.+$" {
    mutate {
      merge => {
        "principal.user.email_addresses" => "user.email"
      }
      on_error => "email_empty"
    }
  }
  if [user][id] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{user.id}"
      }
      on_error => "id_empty"
    }
  }
  if [user][name] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{user.name}"
      }
      on_error => "name_empty"
    }
  }
  if [device][hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{device.hostname}"
      }
      on_error => "hostname_empty"
    }
  }
  if [type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{type}"
      }
      on_error => "type_empty"
    }
  }
  if [device][deviceUuid] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{device.deviceUuid}"
      }
      on_error => "no_product_logid_found"
    }
  }
  if [user][tenantId] != "" {
    mutate {
      replace => {
        "metadata.product_deployment_id" => "%{user.tenantId}"
      }
      on_error => "tenantId_empty"
    }
  }
  if [network][http][method] != "" {
    mutate {
      replace => {
        "network1.http.method" => "%{network.http.method}"
      }
      on_error => "http_method_empty"
    }
  }
  if [device][userAgent] != "" {
    mutate {
      replace => {
        "network1.http.user_agent" => "%{device.userAgent}"
      }
      on_error => "http_user_agent_empty"
    }
    mutate {
      convert => {
        "device.userAgent" => "parseduseragent"
      }
      on_error => "http_user_agent_conversion_failure"
    }
    mutate {
      rename => {
        "device.userAgent" => "network1.http.parsed_user_agent"
      }
    }
  }
  if [network][protocol] =~ "(?i)https" {
    mutate {
      replace => {
        "network1.application_protocol" => "HTTPS"
      }
    }
  }
  if [device][os][type] == "windows" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.platform" => "WINDOWS"
      }
    }
  }
  else if [event_platform] in ["Mac","iOS"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.platform" => "MAC"
      }
    }
  }
  else if [event_platform] == "Lin" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.platform" => "LINUX"
      }
    }
  }

  if [user][externalId] != "" {
    mutate {
      replace => {
        "externalId_label.value.string_value" => "%{user.externalId}"
      }
      on_error => "externalId_empty"
    }
    if ![externalId_empty] {
      mutate {
        replace => {
          "externalId_label.key" => "externalId"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "externalId_label"
        }
        on_error => "externalId_label_empty"
      }
    }
  }
  if [user][tenantExternalId] != "" {
    mutate {
      replace => {
        "tenantExternalId_label.value.string_value" => "%{user.tenantExternalId}"
      }
      on_error => "tenantExternalId_empty"
    }
    if ![tenantExternalId_empty] {
      mutate {
        replace => {
          "tenantExternalId_label.key" => "tenantExternalId"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "tenantExternalId_label"
        }
        on_error => "tenantExternalId_label_empty"
      }
    }
  }
  if [policy][action] != "" {
    mutate {
      replace => {
        "action_label.value.string_value" => "%{policy.action}"
      }
      on_error => "action_empty"
    }
    if ![action_empty] {
      mutate {
        replace => {
          "action_label.key" => "action"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "action_label"
        }
        on_error => "action_label_empty"
      }
    }
  }

  if [device][browserType] != "" {
    mutate {
      replace => {
        "browser_type_label.value" => "%{device.browserType}"
      }
      on_error => "browserType_emtpy"
    }
    if ![browserType_emtpy] {
      mutate {
        replace => {
          "browser_type_label.key" => "Browser-Type"
        }
      }
      mutate {
        merge => {
          "security_result.about.resource.attribute.labels" => "browser_type_label"
        }
        on_error => "browser_type_label_empty"
      }
    }
  }
  if [device][browserVersion] != "" {
    mutate {
      replace => {
        "browserVersion_label.value" => "%{device.browserVersion}"
      }
      on_error => "browserVersion_emtpy"
    }
    if ![browserVersion_emtpy] {
      mutate {
        replace => {
          "browserVersion_label.key" => "browserVersion"
        }
        merge => {
          "security_result.about.resource.attribute.labels" => "browserVersion_label"
        }
        on_error => "browserVersion_label_empty"
      }
    }
  }
  if [device][browserBrand] != "" {
    mutate {
      replace => {
        "browserBrand_label.value" => "%{device.browserBrand}"
      }
      on_error => "browserBrand_emtpy"
    }
    if ![browserBrand_emtpy] {
      mutate {
        replace => {
          "browserBrand_label.key" => "browserBrand"
        }
        merge => {
          "security_result.about.resource.attribute.labels" => "browserBrand_label"
        }
        on_error => "browserBrand_label_empty"
      }
    }
  }

  if [batchId] != "" {
    mutate {
      replace => {
        "batchId_label.value" => "%{batchId}"
      }
      on_error => "batchId_emtpy"
    }
    if ![batchId_emtpy] {
      mutate {
        replace => {
          "batchId_label.key" => "batchId"
        }
        merge => {
          "security_result.about.resource.attribute.labels" => "batchId_label"
        }
        on_error => "batchId_label_empty"
      }
    }
  }

  if [policy][ruleDescription] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{policy.ruleDescription}"
      }
      on_error => "ruleDescription_empty"
    }
  }

  if [policy][ruleId] != "" {
    mutate {
      replace => {
        "security_result.rule_id" => "%{policy.ruleId}"
      }
      on_error => "rule_id_empty"
    }
  }

  if [user][tenantName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.observer.hostname" => "%{user.tenantName}"
      }
      on_error => "tenantname_not_empty"
    }
  }
  if [has_principal] == "true" and [has_target] == "false" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate {
    replace => {
      "metadata.vendor_name" => "TALON"
      "metadata.product_name" => "Talon"
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network1] != "" {
    mutate {
      rename => {
        "network1" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_empty"
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  # Generate output
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
