# Product: Tanium Reveal
# Category: Tanium Specific
# Supported Format: JSON
# Reference: https://docs.tanium.com/reveal/reveal/index.html
# Last Updated: 2021-11-15
# Copyright 2021 Chronicle LLC


filter {
  mutate {
    replace => {
      "event_type" => ""
      "kv_msg" => ""
      "rule_name" => ""
      "Time" => ""
    }
  }

  mutate {gsub => ["message", "Rule Name", "Rule-Name"]}
  mutate {gsub => ["message", "Files Matched", "Files-Matched"]}
  mutate {gsub => ["message", "Total Matches", "Total-Matches"]}
  mutate {gsub => ["message", "Unverified Matches", "Unverified-Matches"]}
  mutate {gsub => ["message", "Scan Progress", "Scan-Progress"]}
  mutate {gsub => ["message", "Computer Name", "Computer-Name"]}
  mutate {gsub => ["message", "Computer ID", "Computer-ID"]}
  mutate {gsub => ["message", "Reveal - Endpoints with Confirmed Sensitive Data", "Reveal---Endpoints-with-Confirmed-Sensitive-Data"]}

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_valid_json"
  }

  if [not_valid_json] {
    drop{
      tag => "TAG_UNSUPPORTED"
    }
  }

  if [Time] != "" {
    date {
      match => ["Time", "RFC3339"]
      rebase => true
    }
  }

  if [Computer-ID] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.id" => "%{Computer-ID}"
        "event.idm.read_only_udm.target.resource.resource_type" => "DEVICE"
        "event.idm.read_only_udm.target.asset.type" => "SERVER"
      }
    }
  }

  if [Computer-Name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{Computer-Name}"
      }
    }
  }

  if [Rule-Name] != "" {
    for i,rule in Rule-Name {
      mutate {
        replace => {
          "sec_result" => ""
        }
      }
      mutate {
        replace => {
          "sec_result.rule_name" => "%{rule}"
        }
      }

      # Since the labels (key and values) need to unique, done the data population with the following hack
      if [i] == 0 {
        mutate {
          replace => {
            "filematch0.key" => "Files-Matched"
            "filematch0.value" => "%{Files-Matched.0}"
            "total0.key" => "Total-Matches"
            "total0.value" => "%{Total-Matches.0}"
            "scan0.key" => "Scan-Progress"
            "scan0.value" => "%{Scan-Progress.0}"
            "unverifiedmatches.key" => "Unverified-Matches"
            "unverifiedmatches.value" => "%{Unverified-Matches.0}"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "filematch0"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "total0"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "unverifiedmatches"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "scan0"
          }
        }
      }
      else if [i] == 1 {
        mutate {
          replace => {
            "filematch1.key" => "Files-Matched"
            "filematch1.value" => "%{Files-Matched.1}"
            "total1.key" => "Total-Matches"
            "total1.value" => "%{Total-Matches.1}"
            "scan1.key" => "Scan-Progress"
            "scan1.value" => "%{Scan-Progress.1}"
            "unverifiedmatches1.key" => "Unverified-Matches"
            "unverifiedmatches1.value" => "%{Unverified-Matches.1}"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "filematch1"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "total1"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "unverifiedmatches1"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "scan1"
          }
        }
      }
      else if [i] == 2 {
        mutate {
          replace => {
            "filematch2.key" => "Files-Matched"
            "filematch2.value" => "%{Files-Matched.2}"
            "total2.key" => "Total-Matches"
            "total2.value" => "%{Total-Matches.2}"
            "scan2.key" => "Scan-Progress"
            "scan2.value" => "%{Scan-Progress.2}"
            "unverifiedmatches2.key" => "Unverified-Matches"
            "unverifiedmatches2.value" => "%{Unverified-Matches.2}"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "filematch2"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "total2"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "unverifiedmatches2"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "scan2"
          }
        }
      }
      else if [i] == 3 {
        mutate {
          replace => {
            "filematch3.key" => "Files-Matched"
            "filematch3.value" => "%{Files-Matched.3}"
            "total3.key" => "Total-Matches"
            "total3.value" => "%{Total-Matches.3}"
            "scan3.key" => "Scan-Progress"
            "scan3.value" => "%{Scan-Progress.3}"
            "unverifiedmatches3.key" => "Unverified-Matches"
            "unverifiedmatches3.value" => "%{Unverified-Matches.3}"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "filematch3"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "total3"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "unverifiedmatches3"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "scan3"
          }
        }
      }
      else if [i] == 4 {
        mutate {
          replace => {
            "filematch4.key" => "Files-Matched"
            "filematch4.value" => "%{Files-Matched.4}"
            "total4.key" => "Total-Matches"
            "total4.value" => "%{Total-Matches.4}"
            "scan4.key" => "Scan-Progress"
            "scan4.value" => "%{Scan-Progress.4}"
            "unverifiedmatches4.key" => "Unverified-Matches"
            "unverifiedmatches4.value" => "%{Unverified-Matches.4}"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "filematch4"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "total4"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "unverifiedmatches4"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "scan4"
          }
        }
      }
      else if [i] == 5 {
        mutate {
          replace => {
            "filematch5.key" => "Files-Matched"
            "filematch5.value" => "%{Files-Matched.5}"
            "total5.key" => "Total-Matches"
            "total5.value" => "%{Total-Matches.5}"
            "scan5.key" => "Scan-Progress"
            "scan5.value" => "%{Scan-Progress.5}"
            "unverifiedmatches5.key" => "Unverified-Matches"
            "unverifiedmatches5.value" => "%{Unverified-Matches.5}"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "filematch5"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "total5"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "unverifiedmatches5"
          }
        }
        mutate {
          merge => {
            "sec_result.detection_fields" => "scan5"
          }
        }
      }
      mutate {
        merge => {

          "event.idm.read_only_udm.security_result" => "sec_result"
        }
      }
    }
  }


  if [Reveal---Endpoints-with-Confirmed-Sensitive-Data] != "" {
    mutate {
      replace => {
        "confirmed_sensitive.key" => "Reveal - Endpoints with Confirmed Sensitive Data"
        "confirmed_sensitive.value" => "%{Reveal---Endpoints-with-Confirmed-Sensitive-Data}"
      }
    }
    mutate {
      merge => {
        "sec_result1.detection_fields" => "confirmed_sensitive"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "sec_result1"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "Tanium"
      "event.idm.read_only_udm.metadata.product_name" => "Reveal"
      "event.idm.read_only_udm.metadata.event_type" => "SCAN_HOST"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
