# Product: VYOS
# Category: DHCP
# Supported Format: SYSLOG
# Reference: https://docs.vyos.io/en/equuleus/configuration/system/syslog.html
# Last Updated: 2022-10-12
# Copyright 2022 Chronicle LLC


filter {
  # define all the variables used
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "network" => ""
      "target" => ""
      "observer" => ""
      "security_result" => ""
      "about" => ""
      "dst_ipaddress" => ""
      "src_ipaddress" => ""
      "eventType" => ""
      "clientIp" => ""
      "clientMac" => ""
      "msg" => ""
      "process" => ""
      "rem_msg" => ""
      "pri_host" => ""
    }
  }

  grok {
    match => {
      "message" => ["<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{DATA:hostname} (?P<process>kernel): \\[%{DATA:value}\\] %{GREEDYDATA:msg}"
      "<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{DATA:hostname} (?P<process>dhcpd): ((%{DATA:eventType} %{GREEDYDATA:msg})|%{GREEDYDATA:msg})"
      "<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{DATA:hostname} (?P<process>puppet-agent)\\[%{INT}\\]: %{GREEDYDATA:msg}"
      "<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{DATA:hostname} (?P<process>.*?)\\[%{DATA:value}\\]: %{GREEDYDATA:msg}"
      "<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{DATA:hostname} (?P<path>.*?) %{GREEDYDATA:msg}"
      ]
    }
    overwrite => ["eventType", "msg", "process"]
  }
  if [msg] == "" {
   drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }
  grok {
    match => {
      "msg" => ["IPv4: martian destination %{IPV4:dst_ipaddress}\\s*from\\s*(%{IPV4:src_ipaddress}|), %{GREEDYDATA}"
      "IPv4: host %{IPV4:src_ipaddress}.*? %{IPV4:dst_ipaddress}"
      "Link State Update.*?%{IPV4:src_ipaddress}.*?%{IPV4:dst_ipaddress}"
      "from %{IP:clientIp} via %{DATA}:.*? %{IPV4:ServerIp}"
      "for %{IP:clientIp} .*?from %{MAC:clientMac} (\\(%{HOST:pri_host}\\)|)"
      "on %{IP:clientIp} to %{MAC:clientMac} (\\(%{HOST:pri_host}\\)|)"
      "%{GREEDYDATA} %{IPV4:dst_ipaddress}"
      "%{GREEDYDATA:rem_msg}"
      ]
    }
    overwrite => ["dst_ipaddress","src_ipaddress", "clientMac", "clientIp", "rem_msg", "pri_host"]
  }
  date {
    match => ["datetime", "MMM  d HH:mm:ss"]
    rebase => true
    on_error => "date_failure"
  }
  if [hostname] != "" {
    mutate {
      replace => {
        "observer.hostname" => "%{hostname}"
      }
    }
  }
  if [process] == "dhcpd" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_DHCP"
        "network.application_protocol" => "DHCP"
        "metadata.product_event_type" => "DHCP Event"
      }
    }
    if [pri_host] != "" {
      mutate {
        replace => {
          "principal.hostname" => "%{pri_host}"
        }
      }
    }
    if [eventType] IN [ "DHCPREQUEST","REQUEST" ] {
      mutate {
        replace => {
          "network.dhcp.ciaddr" => "%{clientIp}"
          "network.dhcp.chaddr" => "%{clientMac}"
          "network.dhcp.type" => "REQUEST"
          "network.dhcp.opcode" => "BOOTREQUEST"
        }
      }
      mutate {
        merge => {
          "principal.mac" => "clientMac"
        }
      }
      mutate {
        merge => {
          "principal.ip" => "clientIp"
        }
      }
      mutate {
        replace => {
          "network.dhcp.giaddr" => "%{dhcpServerIp}"
        }
        on_error => "none"
      }
    }
    else if [eventType] IN [ "DHCPACK", "DHCPOFFER" ] {
      if [eventType] == "DHCPACK" {
        mutate {
          replace => {
            "network.dhcp.type" => "ACK"
            "network.dhcp.opcode" => "BOOTREPLY"
          }
        }
      }
      else if [eventType] == "DHCPOFFER" {
        mutate {
          replace => {
            "network.dhcp.type" => "OFFER"
          }
        }
      }
      mutate {
        replace => {
          "network.dhcp.yiaddr" => "%{clientIp}"
          "network.dhcp.chaddr" => "%{clientMac}"
          "network.dhcp.opcode" => "BOOTREPLY"
        }
      }
      mutate {
        merge => {
          "principal.ip" => "clientIp"
        }
      }
      mutate {
        merge => {
          "principal.mac" => "clientMac"
        }
      }
    }
    else if [eventType] == "DHCPINFORM" {
      mutate {
        replace => {
          "network.dhcp.type" => "INFORM"
          "network.dhcp.opcode" => "BOOTREQUEST"
        }
      }
      mutate {
        merge => {
          "principal.ip" => "clientIp"
        }
      }
    }
    else if [eventType] == "DHCPNAK" {
      mutate {
        replace => {
          "network.dhcp.type" => "NAK"
          "network.dhcp.opcode" => "BOOTREPLY"
        }
      }
      mutate {
        merge => {
          "principal.mac" => "clientMac"
        }
      }
    }
    else {
      mutate {
        replace => {
          "metadata.description" => "%{eventType} %{rem_msg}"
          "metadata.event_type" => "GENERIC_EVENT"
        }
      }
      if [pri_host] == "" {
        mutate {
          replace => {
            "metadata.event_type" => "GENERIC_EVENT"
          }
        }
      }
      else {
        mutate {
          replace => {
            "metadata.event_type" => "STATUS_UPDATE"
          }
        }
      }
    }
  }
  else if [process] == "kernel" {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
        "metadata.description" => "%{msg}"
      }
    }
    if [dst_ipaddress] != "" {
      mutate {
        merge => {
          "target.ip" => "dst_ipaddress"
        }
      }
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_CONNECTION"
        }
      }
    }
    if [src_ipaddress] != "" {
      mutate {
        merge => {
          "principal.ip" => "src_ipaddress"
        }
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
        "metadata.description" => "%{msg}"
      }
    }
    if [rem_msg] != "" {
      mutate {
        replace => {
          "metadata.description" => "%{rem_msg}"
        }
      }
    }
    if [dst_ipaddress] != "" {
      mutate {
        merge => {
          "target.ip" => "dst_ipaddress"
        }
      }
    }
    if [src_ipaddress] != "" {
      mutate {
        merge => {
          "principal.ip" => "src_ipaddress"
        }
      }
      mutate {
        replace => {
          "metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }
  }
  mutate {
    replace => {
      "metadata.product_name" => "VYOS DHCP"
      "metadata.vendor_name" => "VYOS"
    }
  }
  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [observer] != "" {
    mutate {
      rename => {
        "observer" => "event.idm.read_only_udm.observer"
      }
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
