# Product: Ion Spectrum
# Category: Automation
# Supported Format: CSV
# References: N/A
# Last Updated: 2025-10-10
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "event" => ""
      "principal" => ""
      "target" => ""
      "security_result" => ""
      "has_principal" => "false"
      "has_target_user" => "false"
      "action" => ""
      "metadata" => ""
      "column1" => ""
      "column2" => ""
      "column3" => ""
      "column4" => ""
      "src_ip" => ""
      "column5" => ""
      "column6" => ""
      "column7" => ""
    }
  }
  mutate {
    gsub => ["message","\\s+(;)","$1"]
  }
  csv {
    source => "message"
    separator => ";"
    on_error => "csv_failed"
  }

  if [column1] == "LOGIN LOCATION" {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [column1] != "" {
    grok {
      match => {
        "column1" => "%{IP:src_ip}"
      }
      overwrite => ["src_ip"]
      on_error => "invalid_ip"
    }
    if ![invalid_ip] {
      mutate {
        merge => {
          "principal.ip" => "src_ip"
          "principal.asset.ip" => "src_ip"
        }
        on_error => "no_ip"
      }
      if ![no_ip] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    else {
      mutate {
        replace => {
          "principal.hostname" => "%{column1}"
          "principal.asset.hostname" => "%{column1}"
        }
        on_error => "no_column1"
      }
      if ![no_column1] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
  }

  if [column2] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{column2}"
        "has_target_user" => "true"
      }
      on_error => "no_column2"
    }
  }

  if [column3] != "" {
    mutate {
      replace => {
        "target.user.user_display_name" => "%{column3}"
      }
      on_error => "no_column3"
    }
  }

  if [column4] != "" {
    mutate {
      merge => {
        "target.user.group_identifiers" => "column4"
      }
      on_error => "no_column4"
    }
  }

  if [column5] != "" {
    date {
      match => ["column5","dd/MM/yy HH:mm:ss", "yyyy/MM/dd HH:mm:ss"]
      on_error => "date_pattern_failed"
    }
  }

  if [column6] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{column6}"
      }
      on_error => "no_column6"
    }
  }

  if [column7] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{column7}"
      }
      on_error => "no_column7"
    }
  }

  if [column7] == "SUCCESSFUL" {
    mutate {
      replace => {
        "action" => "ALLOW"
      }
    }
  }

  if [action] != "" {
    mutate {
      merge => {
        "security_result.action" => "action"
      }
      on_error => "no_action"
    }
  }

  if [has_principal] == "true" and [has_target_user] == "true" and [column6] =~ "LOGIN" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "ION_SPECTRUM"
      "metadata.vendor_name" => "ION_SPECTRUM"
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
