# MICROSOFT SCEP Parser
# Category: Malware Detection
# Supported Format: KV
# Reference: N/A
# Last Updated: 2025-02-24
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "about" => ""
      "security_result" => ""
      "UserName" => ""
      "Path" => ""
      "source_url" => ""
      "file_path" => ""
      "Process" => ""
      "path_available" => "false"
      "target_file" => ""
      "hostname" => ""
      "user" => ""
      "time" => ""
      "kv_data" => ""
      "DetectionID" => ""
      "ResourceID" => ""
      "action" => ""
      "temp_action" => ""
      "action_type" => ""
      "dest_name" => ""
      "has_target" => "false"
      "has_principal" => "false"
      "detection_source" => ""
      "category" => ""
      "pending_action" => ""
      "severity" => ""
      "signature" => ""
      "kv_data1" => ""
      "kv_data2" => ""
      "timestamp" => ""
      "resourceid" => ""
      "detectionid" => ""
      "detectiontime" => ""
      "dest_nt_domain" => ""
      "has_user" => "false"
      "my_string" => ""
      "my_string1" => ""
      "file_path1" => ""
      "source_url1" => ""
    }
  }

  mutate {
    gsub => ["message", "(,\\\s*)([0-9a-zA-Z_.-]+?)=", "^$2="]
  }
  mutate {
    gsub => ["message", "\\t", "^"]
  }
  mutate {
    gsub => ["message", "\\r\\n", " "]
  }

  grok {
    match => {
      "message" => ["<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} %{GREEDYDATA:kv_data}"]
    }
    overwrite => ["hostname", "kv_data", "time"]
    on_error => "no_url1"
  }
  json {
    source => "message"
    trim_values => true
    on_error => "json_error"
    array_function => "split_columns"
  }
  kv {
    source => "kv_data"
    field_split => "^"
    value_split => ":"
    on_error => "invalid_kv_values1"
  }

  if [invalid_kv_values1] {
    grok {
      match => {
        "kv_data" => "%{GREEDYDATA:kv_data1}user:%{DATA:user}\\^%{GREEDYDATA:kv_data2}"
      }
      overwrite => ["kv_data1", "kv_data2","user"]
      on_error => "grok_failed_2"
    }
    mutate {
      replace => {
        "kv_data" => "%{kv_data1}%{kv_data2}"
      }
      on_error => "invalid_kv_values_not_found1"
    }
    kv {
      source => "kv_data"
      field_split => "^"
      value_split => ":"
      on_error => "invalid_kv_values2"
    }
    if [invalid_kv_values2] {
      grok {
        match => {
          "kv_data" => "%{GREEDYDATA:kv_data1}file_path:%{DATA:file_path}\\^%{GREEDYDATA:kv_data2}"
        }
        overwrite => ["kv_data1", "kv_data2", "file_path"]
        on_error => "grok_failed_3"
      }
      mutate {
        replace => {
          "kv_data" => "%{kv_data1}%{kv_data2}"
        }
        on_error => "kv_data_not_found"
      }
      kv {
        source => "kv_data"
        field_split => "^"
        value_split => ":"
        on_error => "invalid_kv_values3"
      }
    }
  }
  if [time] != "" {
    date {
      match => ["time", "MMM dd HH:mm:ss"]
      rebase => true
      on_error => "no_date"
    }
  }
  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
        "principal.asset.hostname" => "%{hostname}"
      }
      on_error => "no_hostname"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [DetectionID] != "" {
    mutate {
      replace => {
        "DetectionID_field.key" => "DetectionID"
        "DetectionID_field.value" => "%{DetectionID}"
      }
      on_error => "DetectionID_empty"
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "DetectionID_field"
      }
      on_error => "DetectionID_empty"
    }
  }
  if [detectionid] != "" {
    mutate {
      replace => {
        "detectionid_field.key" => "detectionid"
        "detectionid_field.value" => "%{detectionid}"
      }
      on_error => "detectionid_empty"
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "detectionid_field"
      }
      on_error => "detectionid_empty"
    }
  }
  if [ResourceID] != "" {
    mutate {
      replace => {
        "target.resource.name" => "%{ResourceID}"
      }
      on_error => "ResourceID_empty"
    }
  }
  if [dest_nt_domain] != "" {
    mutate {
      replace => {
        "target.administrative_domain" => "%{dest_nt_domain}"
      }
      on_error => "no_dest_nt_domain"
    }
  }
  if [user] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{user}"
        "has_user" => "true"
      }
      on_error => "no_user"
    }
  }
  if [resourceid] != "" {
    mutate {
      replace => {
        "target.resource.name" => "%{resourceid}"
      }
      on_error => "resourceid_empty"
    }
  }
  if [action]!= "" {
      if [action] in ["success", "created", "started", "delivered", "allowed"] {
        mutate {
          replace => {
            "temp_action" => "ALLOW"
          }
        }
      }
      else if [action] in ["failure", "blocked", "teardown", "deferred",
      "deleted", "rejected", "dropped", "error","locked"] {
        mutate {
          replace => {
            "temp_action" => "BLOCK"
          }
        }
      }
      else if [action] in ["acl_modified", "modified"] {
        mutate {
          replace => {
            "temp_action" => "ALLOW_WITH_MODIFICATION"
          }
        }
      }
      else if [action] == "quarantined" {
        mutate {
          replace => {
            "temp_action" => "QUARANTINE"
          }
        }
      }
      else {
        mutate {
          replace => {
            "temp_action" => ""
          }
        }
      }

    if [temp_action] != "" {
      mutate {
        merge => {
          "security_result.action" => "temp_action"
        }
        on_error => "action_merge_failed"
      }
    }
  }
  if [action_type] != "" {
    mutate {
      replace => {
        "action_type_label.key" => "ACTION_TYPE"
        "action_type_label.value" => "%{action_type}"
      }
      on_error => "actionType_invalid"
    }
    if ![actionType_invalid] != "" {
      mutate {
        merge => {
          "principal.group.attribute.labels" => "action_type_label"
        }
        on_error => "action_type_label_merge_failed"
      }
    }
  }
  if [dest_name] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{dest_name}"
        "target.asset.hostname" => "%{dest_name}"
        "has_target" => "true"
      }
      on_error => "dest_name_empty"
    }
  }
  if [detection_source] != "" {
    mutate {
      replace => {
        "detection_source_labels.key" => "detection_source"
        "detection_source_labels.value" => "%{detectionSource}"
      }
      on_error => "detection_source_label_merge_failed"
    }
    if ![detection_source_label_merge_failed] {
      mutate {
        merge => {
          "security_result.detection_fields" => "detection_source_labels"
        }
        on_error => "detection_source_label_merge_failed"
      }
    }
  }
  if [pending_action] != "" {
    mutate {
      replace => {
        "pending_action_labels.key" => "pending_action"
        "pending_action_labels.value" => "%{pending_action}"
      }
      on_error => "pending_action_label_merge_failed"
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "pending_action_labels"
      }
      on_error => "pending_action_label_merge_failed"
    }
  }
  if [severity] != "" {
    mutate {
      uppercase => ["severity"]
    }
    if [severity] in ["0", "1", "2", "3", "LOW"] {
        mutate {
          replace => {
            "security_result.severity" => "LOW"
          }
        }
    }
    else if [severity] in ["4", "5", "6", "MEDIUM", "SUBSTANTIAL", "INFO"] {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    else if [severity] in ["7", "8", "HIGH", "SEVERE"] {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
      }
    }
    else if [severity] in ["9", "10", "VERY-HIGH", "CRITICAL"] {
      mutate {
        replace => {
          "security_result.severity" => "CRITICAL"
        }
      }
    }
  }
  if [signature] != "" {
    mutate {
      replace => {
        "signature_labels.key" => "signature"
        "signature_labels.value.string_value" => "%{signature}"
      }
      on_error => "signature_label_merge_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "signature_labels"
      }
      on_error => "signature_label_merge_failed"
    }
  }
  if [category] != "" {
    mutate {
      merge => {
        "security_result.category_details" => "category"
      }
      on_error => "category_label_merge_failed"
    }
  }

  kv {
    source => "message"
    field_split => "^"
    value_split => "="
    whitespace => "strict"
    on_error => "invalid_kv_values"
  }

  if [invalid_kv_values] and [invalid_kv_values1] and [invalid_kv_values2] and [invalid_kv_values3] {
    drop {
      tag => "TAG_UNSUPPORTED"
    }
  }
  if [Path] != "" {
    grok {
      match => {
        "Path" => [
          "containerfile:%{DATA:file_path};file:.*(?P<source_url>(https|http).*)\\|"
          "file:%{DATA:file_path};webfile:.*\\|(?P<source_url>(https|http).*)"
          "file:%{DATA:file_path}\\|(?P<source_url>(https|http).*)"
          "file:%{DATA:file_path}$"
          ]
      }
      overwrite => ["source_url", "file_path"]
      on_error => "no_container_file"
    }
  }
  if [source_url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.src.url" => "%{source_url}"
      }
      on_error => "no_url"
    }
  }
  if [file_path] != "" {
    mutate {
      replace => {
        "target.file.full_path" => "%{file_path}"
        "target_file" => "present"
      }
      on_error => "no_file_path"
    }
    if ![no_file_path] and [file_path] != "" {
      mutate {
        replace => {
          "path_available" => "true"
        }
      }
    }
    else if [file_path] == "" {
      mutate {
        replace => {
          "target.file.full_path" => "%{Path}"
        }
        on_error => "no_path"
      }
      if ![no_path] {
        mutate {
          replace => {
            "path_available" => "true"
          }
        }
      }
    }
  }
  if [Path] != "" {
    mutate {
      replace => {
        "path_array" => "{\"json_array\":[%{Path}]}"
      }
      on_error => "no_path_array"
    }
    mutate {
      gsub => ["path_array", ';', '", "']
    }
    mutate {
      gsub => ["path_array", '\\[', '\["']
    }
    mutate {
      gsub => ["path_array", '\\]', '"\]']
    }
    mutate {
      gsub => ["path_array", "\\\\", "\\\\"]
    }
  }
  json {
    source => "path_array"
    on_error => "not_json_1"
    array_function => "split_columns"
  }
  for index , each in json_array {
    mutate {
      gsub => ["each", "containerfile:_", ""]
    }
    mutate {
      gsub => ["each", "webfile:_", ""]
    }
    mutate {
      gsub => ["each", "file:_", ""]
    }
    mutate {
      gsub => ["each", "^([a-zA-Z0-9]+):_", ""]
    }
    mutate {
      convert => {
        "index" => "string"
      }
      on_error => "index_conversion_error"
    }
    if [each] =~ "http" {
      grok {
        match => {
          "each" => [
            "(?P<file_path1>.*)\\|(?P<source_url1>(https|http).*)\\|"
            ]
        }
        overwrite => ["file_path1", "source_url1"]
        on_error => "no_container_file"
      }
      mutate {
        replace => {
          "my_string" => "%{my_string},%{file_path1}"
        }
        on_error => "no_file_path1"
      }
      mutate {
        replace => {
          "my_string1" => "%{my_string1},%{source_url1}"
        }
        on_error => "no_source_url1"
      }
    }
    else {
      mutate {
        replace => {
          "my_string" => "%{my_string},%{each}"
        }
        on_error => "no_my_string"
      }
    }
  }

  if [my_string] != "" {
    grok {
      match => {
        "my_string" => [
          ",%{GREEDYDATA:my_string}"
          ]
      }
      overwrite => ["my_string"]
      on_error => "no_container_file"
    }
    mutate {
      replace => {
        "target.file.full_path" => "%{my_string}"
        "target_file" => "present"
      }
      on_error => "no_file_path"
    }
    if ![no_file_path] {
      mutate {
        replace => {
          "path_available" => "true"
        }
      }
    }
  }
  if [my_string1] != "" {
    grok {
      match => {
        "my_string1" => [
          ",%{GREEDYDATA:my_string1}"
          ]
      }
      overwrite => ["my_string1"]
      on_error => "no_container_file"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.src.url" => "%{my_string1}"
      }
      on_error => "no_url"
    }
  }

  if [source_url] != "" and [file_path] != "" and [Path] != "" {
    mutate {
      replace => {
        "detection_Path.value" => "%{Path}"
      }
      on_error => "Path_empty"
    }
    if ![Path_empty] {
      mutate {
        replace => {
          "detection_Path.key" => "Path"
        }
      }
      mutate {
        merge => {
          "security_result.detection_fields" => "detection_Path"
        }
        on_error => "detection_Path_empty"
      }
    }
  }

  mutate {
    replace => {
      "principal.hostname" => "%{TargetHost}"
      "principal.asset.hostname" => "%{TargetHost}"
    }
    on_error => "no_target_host"
  }
  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else if ![no_target_host] and [path_available] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "SCAN_FILE"
      }
    }
  }
  else if ![no_target_host] {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UNCATEGORIZED"
      }
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "MICROSOFT SYSTEM CENTER ENDPOINT PROTECTION"
      "metadata.vendor_name" => "MICROSOFT"
    }
  }


  mutate {
    merge => {
      "security_result.category_details" => "Category"
    }
    on_error => "no_category"
  }

  mutate {
    replace => {
      "security_result.threat_id" => "%{ThreatID}"
    }
    on_error => "no_threat_id"
  }

  mutate {
    replace => {
      "about.url" => "%{_DB_URL}"
    }
    on_error => "no_db_url"
  }

  mutate {
    replace => {
      "metadata.product_log_id" => "%{DetectionID}"
    }
    on_error => "no_detection_id"
  }

  if [Process] != "" {
    mutate {
      replace => {
        "principal.process.file.full_path" => "%{Process}"
      }
      on_error => "Process_empty"
    }
  }

  mutate {
    replace => {
      "security_result.threat_name" => "%{ThreatName}"
    }
    on_error => "no_threat_name"
  }

  mutate {
    replace => {
      "pending_action.value.string_value" => "%{PendingAction}"
    }
    on_error => "no_pending_action"
  }
  if ![no_pending_action] and [PendingAction] != "" {
    mutate {
      replace => {
        "pending_action.key" => "PendingAction"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "pending_action"
      }
    }
  }

  mutate {
    replace => {
      "security_result.severity_details" => "%{SeverityID}"
    }
    on_error => "no_severity_id"
  }

  if ![no_severity_id] and [SeverityID] != "" {
    if [SeverityID] == "1" {
      mutate {
        replace => {
          "security_result.severity" => "LOW"
        }
      }
    }
    else if [SeverityID] == "2" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    else if [SeverityID] == "4" {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
      }
    }
    else if [SeverityID] == "5" {
      mutate {
        replace => {
          "security_result.severity" => "CRITICAL"
        }
      }
    }
    else {
      mutate {
        replace => {
          "security_result.severity" => "UNKNOWN_SEVERITY"
        }
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_event_type" => "%{Name}"
    }
    on_error => "no_name"
  }

  mutate {
    replace => {
      "malicious_file_ct.malicious_count" => "%{MaliciousFileCt}"
    }
    on_error => "no_malicious_file_ct"
  }
  if ![no_malicious_file_ct] and [MaliciousFileCt] != "" {
    mutate {
      convert => {
        "malicious_file_ct.malicious_count" => "integer"
      }
      on_error => "malicious_file_ct_conversion_error"
    }
    if ![malicious_file_ct_conversion_error] {
      mutate {
        merge => {
          "security_result.verdict_info" => "malicious_file_ct"
        }
      }
    }
  }

  mutate {
    replace => {
      "principal.administrative_domain" => "%{NTdomain}"
    }
    on_error => "no_nt_domain"
  }

  mutate {
    replace => {
      "about.resource.name" => "%{_DB_DRIVER}"
    }
    on_error => "no_db_driver"
  }

  mutate {
    replace => {
      "about.port" => "%{_DB_PORT}"
    }
    on_error => "no_db_port"
  }
  if ![no_db_port] {
    mutate {
      convert => {
        "about.port" => "integer"
      }
    }
  }

  mutate {
    replace => {
      "security_result.action_details" => "%{CleanAction}"
    }
    on_error => "no_clean_action"
  }
  if ![no_clean_action] and [CleanAction] != "" {
    if [CleanAction] =~ "Failed" {
      mutate {
        merge => {
          "security_result.action" => "FAIL"
        }
      }
    }
    else if [CleanAction]  =~ "Quarantined" {
      mutate {
        merge => {
          "security_result.action" => "QUARANTINE"
        }
      }
    }
    else if [CleanAction] =~ "Allowed" {
      mutate {
        merge => {
          "security_result.action" => "ALLOW"
        }
      }
    }
    else if [CleanAction] =~ "Blocked" {
      mutate {
        merge => {
          "security_result.action" => "BLOCK"
        }
      }
    }
  }

  mutate {
    replace => {
      "execution_status.value.string_value" => "%{ExecutionStatus}"
    }
    on_error => "no_execution_status"
  }
  if ![no_execution_status] and [ExecutionStatus] != "" {
    mutate {
      replace => {
        "execution_status.key" => "ExecutionStatus"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "execution_status"
      }
    }
  }

  date {
    match => ["DetectionTime", "UNIX_MS"]
    on_error => "no_detection_time"
  }
  date {
    match => ["detectiontime", "UNIX_MS"]
    on_error => "no_detection_time"
  }

  mutate {
    replace => {
      "about.hostname" => "%{_DB_HOST}"
    }
    on_error => "no_db_host"
  }

  mutate {
    replace => {
      "record_id.value.string_value" => "%{RecordID}"
    }
    on_error => "no_record_id"
  }
  if ![no_record_id] and [RecordID] != "" {
    mutate {
      replace => {
        "record_id.key" => "RecordID"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "record_id"
      }
    }
  }

  mutate {
    replace => {
      "error_code.value.string_value" => "%{ErrorCode}"
    }
    on_error => "no_error_code"
  }
  if ![no_error_code] and [ErrorCode] != "" {
    mutate {
      replace => {
        "error_code.key" => "ErrorCode"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "error_code"
      }
    }
  }

  mutate {
    replace => {
      "action_success.value.string_value" => "%{ActionSuccess}"
    }
    on_error => "no_action_success"
  }
  if ![no_action_success] and [ActionSuccess] != "" {
    mutate {
      replace => {
        "action_success.key" => "ActionSuccess"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "action_success"
      }
    }
  }

  mutate {
    replace => {
      "principal.user.user_display_name" => "%{USERNAME}"
    }
    on_error => "no_username"
  }

  if [UserName] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{UserName}"
      }
      on_error => "UserName_empty"
    }
  }

  mutate {
    rename => {
      "metadata" => "event.idm.read_only_udm.metadata"
      "principal" => "event.idm.read_only_udm.principal"
      "target" => "event.idm.read_only_udm.target"
      "additional" => "event.idm.read_only_udm.additional"
    }
  }

  if [about] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.about" => "about"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
