# Product: THREATX_WAF
# Category: WAF
# Supported Format: SYSLOG, JSON
# Reference: NA
# Last Updated: 2025-01-28
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "event_type" => "GENERIC_EVENT"
      "principal" => ""
      "security_result" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "additional" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "has_principal_user" => "false"
      "user_agent" => ""
      "user_id" => ""
      "args" => ""
      "category" => ""
      "user_email" => ""
      "ip" => ""
      "dst_host" => ""
      "uri" => ""
      "request_id" => ""
      "tls_fingerprint" => ""
      "description" => ""
      "action" => ""
      "msg_type" => ""
      "msg_id" => ""
      "subscription_id" => ""
      "app_name" => ""
      "hostname" => ""
      "facility" => ""
      "entity" => ""
      "request_method" => ""
      "matches" => ""
      "status_code" => ""
      "version" => ""
      "severity" => ""
      "priority" => ""
      "msg1" => ""
      "dst_domain" => ""
      "tenant_name" => ""
      "random_id" => ""
      "cookie" => ""
      "js_fingerprint" => ""
      "risk" => ""
      "content_type" => ""
      "content_length" => ""
      "response_length" => ""
      "upstream_response_time" => ""
      "postblock_event" => ""
      "ssl" => ""
      "username" => ""
      "old_value" => ""
      "new_value" => ""
      "count" => ""
      "rule.description" => ""
      "rule.classification" => ""
      "rule.state" => ""
      "rule.contrib_score" => ""
      "rule.beta" => ""
      "rule.blocking" => ""
      "rule.id" => ""
      "timestamp" => ""
    }
  }
  mutate {
    gsub => ["message", "message", "msg1"]
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "invalid_json"
  }

  if [timestamp] not in ["", "null" , "N/A" , " "] {
    date {
      match => ["timestamp", "ISO8601"]
      on_error => "not_in_unix_or_iso_format"
    }
  }

  if [version] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "version" => "string"
      }
      on_error => "no_version_convert"
    }
    mutate {
      replace => {
        "version_label.key" => "version"
        "version_label.value.string_value" => "%{version}"
      }
      on_error => "no_version"
    }
    if ![no_version] {
      mutate {
        merge => {
          "additional.fields" => "version_label"
        }
        on_error => "no_version_label"
      }
    }
  }
  for rule in rules {
    mutate {
      replace => {
        "rule_id_label" => ""
        "rule_classification_label" => ""
        "rule_state_label" => ""
        "rule_contrib_score_label" => ""
        "rule_beta_label" => ""
        "rule_blocking_label" => ""
        "rule_description_label" => ""
      }
    }
    if [rule][id] not in ["", "null" , "N/A" , " "] {
      mutate {
        convert => {
          "rule.id" => "string"
        }
        on_error => "no_rule_id_convert"
      }
      mutate {
        replace => {
          "rule_id_label.key" => "rule_id"
          "rule_id_label.value" => "%{rule.id}"
        }
        on_error => "no_rule_id"
      }
      if ![no_rule_id] {
        mutate {
          merge => {
            "security_result.detection_fields" => "rule_id_label"
          }
          on_error => "no_rule_id_label"
        }
      }
    }
    if [rule][description] not in ["", "null" , "N/A" , " "] {
      mutate {
        replace => {
          "metadata.description" => "%{rule.description}"
        }
        on_error => "no_rule_description"
      }
    }
    if [rule][description] not in ["", "null" , "N/A" , " "] {
      mutate {
        replace => {
          "rule_description_label.key" => "rule_description"
          "rule_description_label.value" => "%{rule.description}"
        }
        on_error => "no_rule_description"
      }
      if ![no_rule_description] {
        mutate {
          merge => {
            "security_result.detection_fields" => "rule_description_label"
          }
          on_error => "no_rule_description_label"
        }
      }
    }
    if [rule][classification] not in ["", "null" , "N/A" , " "] {
      mutate {
        replace => {
          "rule_classification_label.key" => "rule_classification"
          "rule_classification_label.value" => "%{rule.classification}"
        }
        on_error => "no_rule_classification"
      }
      if ![no_rule_classification] {
        mutate {
          merge => {
            "security_result.detection_fields" => "rule_classification_label"
          }
          on_error => "no_rule_classification_label"
        }
      }
    }
    if [rule][state] not in ["", "null" , "N/A" , " "] {
      mutate {
        replace => {
          "rule_state_label.key" => "rule_state"
          "rule_state_label.value" => "%{rule.state}"
        }
        on_error => "no_rule_state"
      }
      if ![no_rule_state] {
        mutate {
          merge => {
            "security_result.detection_fields" => "rule_state_label"
          }
          on_error => "no_rule_state_label"
        }
      }
    }
    if [rule][contrib_score] not in ["", "null" , "N/A" , " "] {
      mutate {
        convert => {
          "rule.contrib_score" => "string"
        }
        on_error => "no_rule_contrib_score_convert"
      }
      mutate {
        replace => {
          "rule_contrib_score_label.key" => "rule_contrib_score"
          "rule_contrib_score_label.value" => "%{rule.contrib_score}"
        }
        on_error => "no_rule_contrib_score"
      }
      if ![no_rule_contrib_score] {
        mutate {
          merge => {
            "security_result.detection_fields" => "rule_contrib_score_label"
          }
          on_error => "no_rule_contrib_score_label"
        }
      }
    }
    if [rule][beta] not in ["", "null" , "N/A" , " "] {
      mutate {
        convert => {
          "rule.beta" => "string"
        }
        on_error => "no_rule_beta_convert"
      }
      mutate {
        replace => {
          "rule_beta_label.key" => "rule_beta"
          "rule_beta_label.value" => "%{rule.beta}"
        }
        on_error => "no_rule_beta"
      }
      if ![no_rule_beta] {
        mutate {
          merge => {
            "security_result.detection_fields" => "rule_beta_label"
          }
          on_error => "no_rule_beta_label"
        }
      }
    }

    if [rule][blocking] not in ["", "null" , "N/A" , " "] {
      mutate {
        convert => {
          "rule.blocking" => "string"
        }
        on_error => "no_rule_blocking_convert"
      }
      mutate {
        replace => {
          "rule_blocking_label.key" => "rule_blocking"
          "rule_blocking_label.value" => "%{rule.blocking}"
        }
        on_error => "no_rule_blocking"
      }
      if ![no_rule_blocking] {
        mutate {
          merge => {
            "security_result.detection_fields" => "rule_blocking_label"
          }
          on_error => "no_rule_blocking_label"
        }
      }
    }
  }

  if [action] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "action_label.key" => "action"
        "action_label.value.string_value" => "%{action}"
      }
      on_error => "no_action"
    }
    if ![no_action] {
      mutate {
        merge => {
          "additional.fields" => "action_label"
        }
        on_error => "no_action_label"
      }
    }
  }
  if [tenant_name] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "tenant_name_label.key" => "tenant_name"
        "tenant_name_label.value.string_value" => "%{tenant_name}"
      }
      on_error => "no_tenant_name"
    }
    if ![no_tenant_name] {
      mutate {
        merge => {
          "additional.fields" => "tenant_name_label"
        }
        on_error => "no_tenant_name_label"
      }
    }
  }
  if [random_id] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "random_id" => "string"
      }
      on_error => "no_version_convert"
    }
    mutate {
      replace => {
        "random_id_label.key" => "random_id"
        "random_id_label.value.string_value" => "%{random_id}"
      }
      on_error => "no_random_id"
    }
    if ![no_random_id] {
      mutate {
        merge => {
          "additional.fields" => "random_id_label"
        }
        on_error => "no_random_id_label"
      }
    }
  }
  if [cookie] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "cookie_label.key" => "cookie"
        "cookie_label.value.string_value" => "%{cookie}"
      }
      on_error => "no_cookie"
    }
    if ![no_cookie] {
      mutate {
        merge => {
          "additional.fields" => "cookie_label"
        }
        on_error => "no_cookie_label"
      }
    }
  }
  if [js_fingerprint] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "js_fingerprint" => "string"
      }
      on_error => "no_version_convert"
    }
    mutate {
      replace => {
        "js_fingerprint_label.key" => "js_fingerprint"
        "js_fingerprint_label.value.string_value" => "%{js_fingerprint}"
      }
      on_error => "no_js_fingerprint"
    }
    if ![no_js_fingerprint] {
      mutate {
        merge => {
          "additional.fields" => "js_fingerprint_label"
        }
        on_error => "no_js_fingerprint_label"
      }
    }
  }
  if [content_type] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "content_type_label.key" => "content_type"
        "content_type_label.value.string_value" => "%{content_type}"
      }
      on_error => "no_content_type"
    }
    if ![no_content_type] {
      mutate {
        merge => {
          "additional.fields" => "content_type_label"
        }
        on_error => "no_content_type_label"
      }
    }
  }
  if [postblock_event] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "postblock_event" => "string"
      }
      on_error => "no_postblock_event_convert"
    }
    mutate {
      replace => {
        "postblock_event_label.key" => "postblock_event"
        "postblock_event_label.value.string_value" => "%{postblock_event}"
      }
      on_error => "no_postblock_event"
    }
    if ![no_postblock_event] {
      mutate {
        merge => {
          "additional.fields" => "postblock_event_label"
        }
        on_error => "no_postblock_event_label"
      }
    }
  }
  if [ssl] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "ssl" => "string"
      }
      on_error => "no_ssl_convert"
    }
    mutate {
      replace => {
        "ssl_label.key" => "ssl"
        "ssl_label.value.string_value" => "%{ssl}"
      }
      on_error => "no_ssl"
    }
    if ![no_ssl] {
      mutate {
        merge => {
          "additional.fields" => "ssl_label"
        }
        on_error => "no_ssl_label"
      }
    }
  }
  if [content_length] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "content_length" => "string"
      }
      on_error => "no_content_length_convert"
    }
    mutate {
      replace => {
        "content_length_label.key" => "content_length"
        "content_length_label.value.string_value" => "%{content_length}"
      }
      on_error => "no_content_length"
    }
    if ![no_content_length] {
      mutate {
        merge => {
          "additional.fields" => "content_length_label"
        }
        on_error => "no_content_length_label"
      }
    }
  }
  if [count] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "count" => "string"
      }
      on_error => "no_count_convert"
    }
    mutate {
      replace => {
        "count_label.key" => "count"
        "count_label.value.string_value" => "%{count}"
      }
      on_error => "no_count"
    }
    if ![no_count] {
      mutate {
        merge => {
          "additional.fields" => "count_label"
        }
        on_error => "no_count_label"
      }
    }
  }
  if [upstream_response_time] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "upstream_response_time" => "string"
      }
      on_error => "no_upstream_response_time_convert"
    }
    mutate {
      replace => {
        "upstream_response_time_label.key" => "upstream_response_time"
        "upstream_response_time_label.value.string_value" => "%{upstream_response_time}"
      }
      on_error => "no_upstream_response_time"
    }
    if ![no_upstream_response_time] {
      mutate {
        merge => {
          "additional.fields" => "upstream_response_time_label"
        }
        on_error => "no_upstream_response_time_label"
      }
    }
  }
  if [response_length] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "response_length" => "string"
      }
      on_error => "no_response_length_convert"
    }
    mutate {
      replace => {
        "response_length_label.key" => "response_length"
        "response_length_label.value.string_value" => "%{response_length}"
      }
      on_error => "no_response_length"
    }
    if ![no_response_length] {
      mutate {
        merge => {
          "additional.fields" => "response_length_label"
        }
        on_error => "no_response_length_label"
      }
    }
  }
  if [risk] != "" {
    mutate {
      rename => {
        "risk" => "security_result.risk_score"
      }
      on_error => "risk_score_invalid"
    }
  }

  mutate {
    convert => {
      "severity" => "string"
    }
    on_error => "no_severity_convert"
  }

  if [severity] == "6" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
      on_error => "no_severity"
    }
  }

  if [facility] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "facility_label.key" => "facility"
        "facility_label.value.string_value" => "%{facility}"
      }
      on_error => "no_facility"
    }
    if ![no_facility] {
      mutate {
        merge => {
          "additional.fields" => "facility_label"
        }
        on_error => "no_facility_label"
      }
    }
  }

  mutate {
    convert => {
      "priority" => "string"
    }
    on_error => "no_priority_convert"
  }

  if [priority] == "14" {
    mutate {
      replace => {
        "security_result.priority" => "HIGH_PRIORITY"
      }
      on_error => "no_priority"
    }
  }

  if [subscription_id] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "subscription_ID_label.key" => "subscription_id"
        "subscription_ID_label.value" => "%{subscription_id}"
      }
      on_error => "no_subscription_ID_value"
    }
    if ![no_subscription_ID_value] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "subscription_ID_label"
        }
        on_error => "no_id"
      }
    }
  }

  if [app_name] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "app_name_label.key" => "app_name"
        "app_name_label.value.string_value" => "%{app_name}"
      }
      on_error => "no_app_name"
    }
    if ![no_app_name] {
      mutate {
        merge => {
          "additional.fields" => "app_name_label"
        }
        on_error => "no_app_name_label"
      }
    }
  }

  if [hostname] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "principal.asset.hostname" => "%{hostname}"
        "principal.hostname" => "%{hostname}"
        "has_principal" => "true"
      }
      on_error => "no_hostname"
    }
  }

  if [msg_id] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{msg_id}"
      }
      on_error => "no_msg_id"
    }
  }

  if [msg1] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "principal.url" => "%{msg1}"
      }
      on_error => "no_message"
    }
  }
  if [msg_type] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "msg_type_label.key" => "msg_type"
        "msg_type_label.value.string_value" => "%{msg_type}"
      }
      on_error => "no_msg_type"
    }
    if ![no_msg_type] {
      mutate {
        merge => {
          "additional.fields" => "msg_type_label"
        }
        on_error => "no_msg_type_label"
      }
    }
  }

  if [user_agent] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "network.http.user_agent" => "%{user_agent}"
      }
      on_error => "no_user_agent"
    }
    mutate {
      convert => {
        "user_agent" => "parseduseragent"
      }
      on_error => "user_agent_conversion_failure"
    }
    mutate {
      rename => {
        "user_agent" => "network.http.parsed_user_agent"
      }
    }
  }


  if [ip] not in ["", "null" , "N/A" , " "] {
    mutate {
      merge => {
        "principal.asset.ip" => "ip"
        "principal.ip" => "ip"
      }
      on_error => "no_ip"
    }
    if ![no_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [dst_host] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "target.hostname" => "%{dst_host}"
        "target.asset.hostname" => "%{dst_host}"
        "has_target" => "true"
      }
      on_error => "no_dst_host"
    }
  }
  if [dst_domain] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "target.hostname" => "%{dst_domain}"
        "target.asset.hostname" => "%{dst_domain}"
        "has_target" => "true"
      }
      on_error => "no_dst_domain"
    }
  }
  if [username] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "target.hostname" => "%{username}"
        "target.asset.hostname" => "%{username}"
        "has_target" => "true"
      }
      on_error => "no_username"
    }
  }
  if [old_value] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "old_value" => "string"
      }
      on_error => "no_old_value_convert"
    }
    mutate {
      replace => {
        "old_value_label.key" => "old_value"
        "old_value_label.value.string_value" => "%{old_value}"
      }
      on_error => "no_old_value"
    }
    if ![no_old_value] {
      mutate {
        merge => {
          "additional.fields" => "old_value_label"
        }
        on_error => "no_old_value_label"
      }
    }
  }
  if [new_value] not in ["", "null" , "N/A" , " "] {
    mutate {
      convert => {
        "new_value" => "string"
      }
      on_error => "no_new_value_convert"
    }
    mutate {
      replace => {
        "new_value_label.key" => "new_value"
        "new_value_label.value.string_value" => "%{new_value}"
      }
      on_error => "no_new_value"
    }
    if ![no_new_value] {
      mutate {
        merge => {
          "additional.fields" => "new_value_label"
        }
        on_error => "no_new_value_label"
      }
    }
  }

  if [uri] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "uri_label.key" => "uri"
        "uri_label.value" => "%{uri}"
      }
      on_error => "no_uri_value"
    }
    if ![no_uri_value] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "uri_label"
        }
        on_error => "no_uri"
      }
    }
  }

  if [request_id] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "request_id_label.key" => "request_id"
        "request_id_label.value" => "%{request_id}"
      }
      on_error => "no_request_id_value"
    }
    if ![no_request_id_value] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "request_id_label"
        }
        on_error => "no_request_id"
      }
    }
  }

  if [tls_fingerprint] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "tls_fingerprint_label.key" => "tls_fingerprint"
        "tls_fingerprint_label.value.string_value" => "%{tls_fingerprint}"
      }
      on_error => "no_tls_fingerprint"
    }
    if ![no_tls_fingerprint] {
      mutate {
        merge => {
          "additional.fields" => "tls_fingerprint_label"
        }
        on_error => "no_tls_fingerprint_label"
      }
    }
  }

  if [user_id] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "principal.user.userid" => "%{user_id}"
        "has_principal_user" => "true"
      }
      on_error => "no_user_id"
    }
  }

  if [category] not in ["", "null" , "N/A" , " "] {
    mutate {
      merge => {
        "security_result.category_details" => "category"
      }
      on_error => "no_category"
    }
  }

  if [user_email] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "principal.email" => "%{user_email}"
      }
      on_error => "no_user_email"
    }
  }

  if [action] =~ "block" {
    mutate {
      replace => {
        "act_value" => "BLOCK"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "act_value"
      }
      on_error => "no_action"
    }
  }

  if [description] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "metadata.description" => "%{description}"
      }
      on_error => "no_description"
    }
  }

  if [entity] != "" {
    if [entity][codename] not in ["", "null" , "N/A" , " "] {
      mutate {
        replace => {
          "entity_codename_label.key" => "entity_codename"
          "entity_codename_label.value.string_value" => "%{entity.codename}"
        }
        on_error => "no_entity_codename"
      }
      if ![no_entity_codename] {
        mutate {
          merge => {
            "additional.fields" => "entity_codename_label"
          }
          on_error => "no_entity_codename_label"
        }
      }
    }

    if [entity][hash] not in ["", "null" , "N/A" , " "] {
      mutate {
        replace => {
          "entity_hash_label.key" => "entity_hash"
          "entity_hash_label.value.string_value" => "%{entity.hash}"
        }
        on_error => "no_entity_hash"
      }
      if ![no_entity_hash] {
        mutate {
          merge => {
            "additional.fields" => "entity_hash_label"
          }
          on_error => "no_entity_hash_label"
        }
      }
    }

    if [entity][ip_address] not in ["", "null" , "N/A" , " "] {
      mutate {
        merge => {
          "principal.asset.ip" => "entity.ip_address"
          "principal.ip" => "entity.ip_address"
        }
        on_error => "no_entity_ip"
      }
      if ![no_entity_ip] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
  }

  if [request_method] != "" {
    mutate {
      replace => {
        "network.http.method" => "%{request_method}"
      }
      on_error => "no_request_method"
    }
  }

  if [matches] != "" {
    for index,data in matches {
      mutate {
        replace => {
          "id_label" => ""
          "risk_label" => ""
          "contrib_score_label" => ""
          "description_label" => ""
          "classification_label" => ""
          "state_label" => ""
        }
      }
      mutate {
        convert => {
          "index" => "string"
        }
      }

      if [data][description] != "" {
        mutate {
          replace => {
            "description_label.key" => "description_%{index}"
            "description_label.value" => "%{data.description}"
          }
          on_error => "no_matches_description"
        }
        if ![no_matches_description] {
          mutate {
            merge => {
              "security_result.detection_fields" => "description_label"
            }
            on_error => "no_description_label"
          }
        }
      }

      if [data][classification] != "" {
        mutate {
          replace => {
            "classification_label.key" => "classification_%{index}"
            "classification_label.value" => "%{data.classification}"
          }
          on_error => "no_matches_classification"
        }
        if ![no_matches_classification] {
          mutate {
            merge => {
              "security_result.detection_fields" => "classification_label"
            }
            on_error => "no_classification_label"
          }
        }
      }

      if [data][state] != "" {
        mutate {
          replace => {
            "state_label.key" => "state_%{index}"
            "state_label.value" => "%{data.state}"
          }
          on_error => "no_matches_state"
        }
        if ![no_matches_state] {
          mutate {
            merge => {
              "security_result.detection_fields" => "state_label"
            }
            on_error => "no_state_label"
          }
        }
      }

      if [data][id] != "" {
        mutate {
          convert => {
            "data.id" => "string"
          }
        }
        mutate {
          replace => {
            "id_label.key" => "id_%{index}"
            "id_label.value" => "%{data.id}"
          }
          on_error => "no_matches_id"
        }
        if ![no_matches_id] {
          mutate {
            merge => {
              "security_result.detection_fields" => "id_label"
            }
            on_error => "no_id_label"
          }
        }
      }

      if [data][risk] != "" {
        mutate {
          convert => {
            "data.risk" => "string"
          }
        }
        mutate {
          replace => {
            "risk_label.key" => "risk_%{index}"
            "risk_label.value" => "%{data.risk}"
          }
          on_error => "no_risk"
        }
        if ![no_risk] {
          mutate {
            merge => {
              "security_result.detection_fields" => "risk_label"
            }
          }
        }
      }

      if [data][contrib_score] != "" {
        mutate {
          convert => {
            "data.contrib_score" => "string"
          }
        }
        mutate {
          replace => {
            "contrib_score_label.key" => "contrib_score_%{index}"
            "contrib_score_label.value" => "%{data.contrib_score}"
          }
          on_error => "no_contrib_score"
        }
        if ![no_contrib_score] {
          mutate {
            merge => {
              "security_result.detection_fields" => "contrib_score_label"
            }
          }
        }
      }
    }
  }

  if [args] not in ["", "null" , "N/A" , " "] {
    mutate {
      replace => {
        "args_label.key" => "args"
        "args_label.value.string_value" => "%{args}"
      }
      on_error => "no_args"
    }
    if ![no_args] {
      mutate {
        merge => {
          "additional.fields" => "args_label"
        }
        on_error => "no_args_label"
      }
    }
  }

  if [status_code] != "" {
    mutate {
      convert => {
        "status_code" => "integer"
      }
      on_error => "status_code_conversion_error"
    }
    if ![status_code_conversion_error] {
      mutate {
        rename => {
          "status_code" => "network.http.response_code"
        }
        on_error => "status_code_not_found"
      }
    }
  }

  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "THREATX_WAF"
      "metadata.product_name" => "THREATX_WAF"
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
      on_error => "event_type_invalid"
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_invalid"
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
# output the built event
  mutate {
    merge=> {
      "@output" => "event"
    }
  }
}
