# Product: CA_SSO_WEB
# Category: SSO
# Supported Format: JSON, SYSLOG + KV
# Reference: NA
# Last Updated: 2026-04-17
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "event1.idm.read_only_udm.metadata.product_name" => "Web Access Management"
      "event1.idm.read_only_udm.metadata.vendor_name" => "Siteminder"
      "event1.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
      "event1.idm.read_only_udm.extensions.auth.type" => "SSO"
      "_action" => "ALLOW"
      "UserName" => ""
      "Action" => ""
      "AgentName" => ""
      "client_ip" => ""
      "sm_user" => ""
      "sm_group" => ""
      "logstash.collect.host" => ""
      "user_info" => ""
      "hostname" => ""
      "time" => ""
      "src_ip" => ""
      "method" => ""
      "url" => ""
      "Event" => ""
      "DomainName" => ""
      "Resource" => ""
      "SessionId" => ""
      "ClientIp" => ""
      "Hostname" => ""
      "syslog_priority" => ""
      "syslog_host" => ""
      "prod_log_id" => ""
      "logstash.process.host" => ""
      "intermediary" => ""
      "syslog_host_ip" => ""
      "target_app" => ""
    }
  }

  mutate {
    gsub => ["message", "@timestamp", "timestamp"]
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  #Parse Message
  grok {
    match => {
      "message" => "\\[(?P<Category>[^\\]]*)\\]\\[(?P<Event>[^\\]]*)\\]\\[(?P<Reason>[^\\]]*)\\]\\[(?P<Hostname>[^\\]]*)\\]\\[(?P<Time>[^\\]]*)\\]\\[(?P<AgentName>[^\\]]*)\\]\\[(?P<SessionId>[^\\]]*)\\]\\[(?P<UserName>[^\\]]*)\\]\\[(?P<DomainOid>[^\\]]*)\\]\\[(?P<RealmName>[^\\]]*)\\]\\[(?P<RealmOid>[^\\]]*)\\]\\[(?P<ClientIp>[^\\]]*)\\]\\[(?P<Resource>[^\\]]*)\\]\\[(?P<Action>[^\\]]*)\\]\\[(?P<AuthDirName>[^\\]]*)\\]\\[(?P<AuthDirServer>[^\\]]*)\\]\\[(?P<AuthDirNamespace>[^\\]]*)\\]\\[(?P<TransactionId>[^\\]]*)\\]\\[(?P<StatusMsg>[^\\]]*)\\]\\[(?P<DomainName>[^\\]]*)\\]\\[(?P<ImpersonatorName>[^\\]]*)\\]\\[(?P<ImpersonatorDirName>[^\\]]*)\\]\\[(?P<ObjName>[^\\]]*)\\]\\[(?P<ObjOid>[^\\]]*)\\]\\[(?P<FieldDesc>[^\\]]*)\\]"
    }
    overwrite => ["UserName","Action", "AgentName","Event", "DomainName", "SessionId", "Hostname", "Time", "ClientIp", "Resource"]
    on_error => "pattern_not_matched"
  }

  if [not_json] and [pattern_not_matched] {
    grok {
      match => {
        "message" =>[
          '^<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP} %{DATA:syslog_host} Siteminder: %{WORD:Event} %{DATA:hostname} \\[%{HTTPDATE:time}\\] \\\"%{IP:src_ip} %{GREEDYDATA:UserName}\\\" \\\"%{DATA:target_app}\\s+%{DATA:method}\\s+%{DATA:url}\\" \\[%{DATA:prod_log_id}\\] \\[%{INT}\\]'
          '%{WORD:Event} %{DATA:hostname} \\[%{DATA:time}\\] "%{IP:src_ip} %{DATA:UserName}" "%{DATA} %{WORD:method} %{DATA:url}"'
        ]
      }
      overwrite => ["target_app", "syslog_priority", "Event", "hostname", "time", "src_ip", "UserName", "method", "url", "syslog_host", "prod_log_id"]
      on_error => "pattern1_not_matched"
    }
    if [pattern1_not_matched] {
      drop {
        tag => "TAG_MALFORMED_ENCODING"
      }
    }
  }
  if [target_app] != "" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.target.application" => "%{target_app}"
      }
      on_error => "target_app_replace_failed"
    }
  }
  if [prod_log_id] != "" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.metadata.product_log_id" => "%{prod_log_id}"
      }
      on_error => "prod_log_id_replace_failed"
    }
  }
  if [syslog_priority] != "" {
    mutate {
      replace => {
        "_security_result.priority_details" => "%{syslog_priority}"
      }
      on_error => "priority_replace_failed"
    }
  }
  if [syslog_host] != "" {
    grok {
      match => {
        "syslog_host" => "%{IP:syslog_host_ip}"
      }
      overwrite => ["syslog_host_ip"]
      on_error => "syslog_host_not_ip"
    }
    if ![syslog_host_not_ip] {
      mutate {
        merge => {
          "intermediary.ip" => "syslog_host_ip"
          "intermediary.asset.ip" => "syslog_host_ip"
        }
        on_error => "syslog_host_ip_merge_failed"
      }
    }
    else {
      mutate {
        replace => {
          "intermediary.hostname" => "%{syslog_host}"
          "intermediary.asset.hostname" => "%{syslog_host}"
        }
        on_error => "syslog_host_replace_failed"
      }
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.principal.hostname" => "%{hostname}"
        "event1.idm.read_only_udm.principal.asset.hostname" => "%{hostname}"
      }
      on_error => "hostname_merge_failed"
    }
  }
  if [user_info] != "" {
    grok {
      match => {
        "user_info" => "CN=%{DATA:username},%{GREEDYDATA:user_group}"
      }
      overwrite => ["username", "user_group"]
      on_error => "no_username"
    }
    mutate {
      replace => {
        "event1.idm.read_only_udm.target.user.userid" => "%{username}"
      }
      on_error => "username_merge_failed"
    }
  }
  date {
    match => ["time", "dd/MMM/yyyy:HH:mm:ss Z"]
    on_error => "timestamp_error"
  }
  if [src_ip] != "" {
    mutate {
      merge => {
        "event1.idm.read_only_udm.principal.ip" => "src_ip"
        "event1.idm.read_only_udm.principal.asset.ip" => "src_ip"
      }
      on_error => "src_ip_merge_failed"
    }
  }
  if [method] != "" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.network.http.method" => "%{method}"
      }
      on_error => "method_replace_failed"
    }
  }
  if [url] != "" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.target.url" => "%{url}"
      }
      on_error => "url_replace_failed"
    }
  }


  if [logstash][process][host] != "" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{logstash.process.host}"
      }
      on_error => "intermediary_hostname_replace_failed"
    }
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event1.idm.read_only_udm.intermediary" => "intermediary"
      }
      on_error => "intermediary_merge_failed"
    }
  }
  if [logstash][collect][host] != "" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.observer.hostname" => "%{logstash.collect.host}"
      }
      on_error => "observer_hostname_replace_failed"
    }
  }

  date {
    match => [ "Time", "dd/MMM/yyyy:HH:mm:ss Z", "yyyy-MM-d HH:mm:ss Z", "yyyy-MM-ddTHH:mm:ss.SSSZ", "ISO8601"]
    on_error => "date_not_matched"
  }


  if [Event] == "AuthReject" or [Event] == "ValidateReject" {
    mutate {
      replace => {
        "_action" => "BLOCK"
      }
    }
  } else if [Event] == "AuthLogout" or [Event] == "AdminLogout" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.metadata.event_type" => "USER_LOGOUT"
      }
    }
  } else if [Event] == "AzAccept" or [Event] == "AzReject" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
    if  [Event] == "AzReject" {
      mutate {
        replace => {
            "_action" => "BLOCK"
        }
      }
    }
  } else if [Event] == "AssertionGenerate" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        "event1.idm.read_only_udm.metadata.description" => "%{message}"
      }
    }
  }

  if [AgentName] == "Session Services" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        "event1.idm.read_only_udm.metadata.description" => "%{message}"
      }
    }
  }

  if [UserName] =~ /^uid=*/ or [UserName] =~ /^CN=*/ {
    grok {
      match => {
        "UserName" => "^\\w+=(?P<sm_user>[^,]+),"
      }
      overwrite => ["sm_user"]
      on_error => "no_sm_user"
    }
    grok {
      match => {
        "UserName" => ",%{GREEDYDATA:sm_group}"
      }
      overwrite => ["sm_group"]
      on_error => "no_sm_group"
    }
    if [sm_user] =~ "^.+@.+$" {
      mutate {
        merge => {
          "event1.idm.read_only_udm.target.user.email_addresses" => "sm_user"
        }
      }
    }
    if [sm_user] != "" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.target.user.userid" => "%{sm_user}"
        }
        on_error => "sm_user_replace_failed"
      }
    }

    if [sm_group] != "" {
      mutate {
        merge => {
          "event1.idm.read_only_udm.target.user.group_identifiers" => "sm_group"
        }
      }
    }
  } else {
    if [UserName] =~ "^.+@.+$" {
      mutate {
        merge => {
          "event1.idm.read_only_udm.target.user.email_addresses" => "UserName"
        }
      }
    }
    mutate {
      replace => {
        "event1.idm.read_only_udm.target.user.userid" => "%{UserName}"
      }
      on_error => "username_replace_failed"
    }
  }

  if [Action] == "Visit" {
     mutate {
       replace => {
         "Action" => "GET"
       }
     }
  }

  mutate {
    rename => {
      "AgentName" => "event1.idm.read_only_udm.target.hostname"
      "Event" => "event1.idm.read_only_udm.metadata.product_event_type"
      "DomainName" => "event1.idm.read_only_udm.target.administrative_domain"
      "SessionId" =>  "event1.idm.read_only_udm.network.session_id"
    }
  }
  if [Resource] != "" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.target.url" => "%{Resource}"
      }
      on_error => "resource_replace_failed"
    }
  }

  if [Action] != "" {
    mutate {
      rename => {
        "Action" => "event1.idm.read_only_udm.network.http.method"
      }
    }
  }

  grok {
    match => {
      "ClientIp" => "%{IP:client_ip}"
    }
    on_error => "not_an_ip"
    overwrite => ["client_ip"]
  }
  if ![not_an_ip] and [client_ip] != "" {
    mutate {
      merge => {
        "event1.idm.read_only_udm.principal.ip" => "client_ip"
      }
    }
  }

  mutate {
    merge => {
      "_security_result.action" => "_action"
    }
  }
  mutate {
    merge => {
      "event1.idm.read_only_udm.security_result" => "_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event1"
    }
  }
}
