# Product: Nokia Router
# Category: Switches and Routers
# Supported Format: SYSLOG + KV
# Reference: N/A
# Last Updated: 2025-05-15
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "date_time" => ""
      "src_ip" => ""
      "host_name" => ""
      "sequence_id" => ""
      "router_name" => ""
      "application" => ""
      "severity" => ""
      "event_name" => ""
      "event_id" => ""
      "subject" => ""
      "message1" => ""
      "event_type" => ""
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "security_result" => ""
      "network" => ""
      "remote_index" => ""
      "port_id" => ""
      "dest_mac" => ""
      "dest_host" => ""
      "mac_type" => ""
      "local_port_id" => ""
      "dest_ip" => ""
      "level" => ""
      "mtid" => ""
      "type" => ""
      "flag" => ""
      "algo" => ""
      "sid" => ""
      "dest_port" => ""
      "description" => ""
      "ca" => ""
      "sub_port_id" => ""
      "mi_sci" => ""
      "src_port" => ""
      "SrcIP" => ""
      "DstIP" => ""
      "intermediary" => ""
    }
  }

  mutate {
    gsub => [
      "message", "\\n", " "
    ]
  }

  grok {
    match => {
      "message" => "<%{INT}>%{SYSLOGTIMESTAMP:date_time} %{IP:src_ip} %{HOSTNAME:host_name}: %{INT:sequence_id} %{DATA:router_name} %{DATA:application}-%{WORD:severity}-%{DATA:event_name}-%{INT:event_id} \\[%{GREEDYDATA:subject}\\]:\\s*%{GREEDYDATA:message1}"
    }
    overwrite => ["date_time", "src_ip", "host_name", "sequence_id", "router_name", "application", "severity", "event_name", "event_id", "subject", "message1"]
    on_error => "grok_fail"
  }

  if [grok_fail] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  date {
    match => ["date_time", "yyyy-MM-dd HH:mm:ss", "MMM dd HH:mm:ss","MMM  d HH:mm:ss", "RFC3339"]
    rebase => true
    on_error => "date_match_failed"
  }

  if [sequence_id] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{sequence_id}"
      }
      on_error => "sequence_id_not_present"
    }
  }

  if [router_name] != "" {
    mutate {
      replace => {
        "metadata.product_name" => "%{router_name}"
      }
      on_error => "router_name_missing"
    }
  }


  if [event_name] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{event_name}"
      }
      on_error => "event_name_missing"
    }
  }

  if [host_name] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host_name}"
      }
      on_error => "missing_hostname"
    }
  }

  if [event_id] != "" {
    mutate {
      convert => {
        "event_id" => "string"
      }
      on_error => "event_id_already_string"
    }
    mutate {
      replace => {
        "event_id_label.value.string_value" => "%{event_id}"
        "event_id_label.key" => "Event Id"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "event_id_label"
      }
      on_error => "additional_field_not_set"
    }
  }

  if [application] != "" {
    mutate {
      replace => {
        "target.application" => "%{application}"
      }
      on_error => "application_missing"
    }
  }

  if [severity] in ["CLEARED", "INFO"] {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  }

  else if [severity] == "MINOR" {
    mutate {
      replace => {
        "security_result.severity" => "ERROR"
      }
    }
  }

  else if [severity] == "WARNING" {
    mutate {
      replace => {
        "security_result.severity" => "LOW"
      }
    }
  }
  else if [severity] == "MAJOR" {
    mutate {
      replace => {
        "security_result.severity" => "HIGH"
      }
    }
  }

  else if [severity] == "CRITICAL" {
    mutate {
      replace => {
        "security_result.severity" => "CRITICAL"
      }
    }
  }

  if [event_name] in ["bgpRemoteEndClosedConn", "bgpBackwardTransNotification",
                      "sendNotification", "recieveNotification",
                    "bgpEstablishedNotification", "tBgpNgBackwardTransition", "tBgpNgEstablished"] {

    if [router_name] =~ "vprn" {
        mutate {
          replace => {
            "network.ip_protocol" => "TCP"
          }
        }
      }
    if [message1] != "" {
      mutate {
        gsub => ["message1", "\\n", ""]
      }
      grok {
        match => {
          "message1" => "%{GREEDYDATA}: Group %{NOTSPACE:group_id}: %{WORD} %{IP:dest_ip}: %{GREEDYDATA:desc}"
        }
        on_error => "grok_fail"
        overwrite => ["group_id", "dest_ip", "desc"]
      }
    }

    if [group_id] != "" {
      mutate {
        replace => {
          "target.group.product_object_id" => "%{group_id}"
        }
        on_error => "group_id_missing"
      }
    }

    if [dest_ip] != "" {
      mutate {
        merge => {
          "target.ip" => "dest_ip"
        }
        on_error => "target_ip_missing"
      }
    }

    if [desc] != "" {
      mutate {
        replace => {
          "security_result.description" => "%{desc}"
        }
        on_error => "description_missing"
      }
    }
  }

  else if [event_name] in ["tmnxPhysChassPwrSupInputFeedClr", "tmnxEqPhysChassPowerSupInFailClr", "tmnxEqPhysChassPowerSupOutFailCl"] {
    if [message1] != "" {
      mutate {
        replace => {
          "security_result.description" => "%{message1}"
        }
      }
    }
  }

  else if [event_name] == "sapStatusChanged" {
    mutate {
      replace => {
        "sap_id" => ""
        "service_id" => ""
        "customer_id" => ""
        "admin_status" => ""
        "operation_status" => ""
        "flag" => ""
      }
    }
    mutate {
      replace => {
        "network.application_protocol" => "SAP"
      }
    }
    grok {
      match => {
        "message1" => "%{GREEDYDATA} SAP %{DATA:sap_id} in service %{INT:service_id} \\(customer %{INT:customer_id}\\) %{GREEDYDATA} admin=%{WORD:admin_status} oper=%{WORD:operation_status} flags=%{WORD:flag}"
      }
      overwrite => ["sap_id", "service_id", "customer_id", "admin_status", "operation_status", "flag"]
      on_error => "grok_fail_for_sap"
    }

    if ![grok_fail_for_sap] {
      if [sap_id] != "" {
        mutate {
          convert => {
            "sap_id" => "string"
          }
          on_error => "sap_id_already_string"
        }
        mutate {
          replace => {
            "sap_id_label.value.string_value" => "%{sap_id}"
            "sap_id_label.key" => "SAP Id"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "sap_id_label"
          }
          on_error => "additional_field_not_set"
        }
      }

      if [service_id] != "" {
        mutate {
          convert => {
            "service_id" => "string"
          }
          on_error => "service_id_already_string"
        }
        mutate {
          replace => {
            "service_id_label.value.string_value" => "%{service_id}"
            "service_id_label.key" => "Service Id"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "service_id_label"
          }
          on_error => "additional_field_not_set"
        }
      }

      if [customer_id] != "" {
        mutate {
          convert => {
            "customer_id" => "string"
          }
          on_error => "customer_id_already_string"
        }
        mutate {
          replace => {
            "customer_id_label.value.string_value" => "%{customer_id}"
            "customer_id_label.key" => "Customer Id"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "customer_id_label"
          }
          on_error => "additional_field_not_set"
        }
      }

      if [admin_status] != "" {
        mutate {
          convert => {
            "admin_status" => "string"
          }
          on_error => "admin_status_already_string"
        }
        mutate {
          replace => {
            "admin_status_label.value.string_value" => "%{admin_status}"
            "admin_status_label.key" => "Admin Status"
          }
          merge => {
            "event.idm.read_only_udm.additional.fields" => "admin_status_label"
          }
          on_error => "additional_field_not_set"
        }
      }

      if [operation_status] != "" {
        mutate {
          convert => {
            "operation_status" => "string"
          }
          on_error => "operation_status_already_string"
        }
        mutate {
          replace => {
            "operation_status_label.value.string_value" => "%{operation_status}"
            "operation_status_label.key" => "Operation Status"
          }
          merge => {
            "event.idm.read_only_udm.additional.fields" => "operation_status_label"
          }
          on_error => "additional_field_not_set"
        }
      }

      if [flag] != "" {
        mutate {
          convert => {
            "flag" => "string"
          }
          on_error => "flag_already_string"
        }
        mutate {
          replace => {
            "flag_label.value.string_value" => "%{flag}"
            "flag_label.key" => "Flag"
          }
          merge => {
            "event.idm.read_only_udm.additional.fields" => "flag_label"
          }
          on_error => "additional_field_not_set"
        }
      }
    }
  }

  else if [event_name] == "tmnxMkaSessionEstablished" {
    if [application] =~ "MAC" {
      mutate {
        replace => {
          "principal.platform" => "MAC"
        }
      }
    }
    if [message1] != "" {
      grok {
        match => {
          "message1" => "%{GREEDYDATA:desc} with MI:SCI %{DATA:mi_sci} on port %{DATA:port_id} sub-port %{INT:sub_port_id} CA %{INT:ca} EAPOL-destination %{MAC:dest_mac} %{GREEDYDATA:description}"
        }
        overwrite => ["desc", "mi_sci", "port_id", "sub_port_id", "ca", "dest_mac", "description"]
        on_error => "grok_fail_for_mac"
      }
      if [desc] != "" {
        mutate {
          replace => {
            "security_result.description" => "%{desc}"
          }
          on_error => "description_missing"
        }
      }
      if [dest_mac] != "" {
        mutate {
          merge => {
            "target.mac" => "dest_mac"
          }
          on_error => "dest_mac_not_present"
        }
      }
      if [description] != "" {
        mutate {
          replace => {
            "metadata.description" => "%{description}"
          }
        }
      }
      if [mi_sci] != "" {
        mutate {
          convert => {
            "mi_sci" => "string"
          }
          on_error => "mi_sci_already_string"
        }
        mutate {
          replace => {
            "mi_sci_label.value.string_value" => "%{mi_sci}"
            "mi_sci_label.key" => "MI:SCI"
          }
          merge => {
            "event.idm.read_only_udm.additional.fields" => "mi_sci_label"
          }
          on_error => "additional_field_not_set"
        }
      }
      if [port_id] != "" {
        mutate {
          convert => {
            "port_id" => "string"
          }
          on_error => "port_id_already_string"
        }
        mutate {
          replace => {
            "port_id_label.value.string_value" => "%{port_id}"
            "port_id_label.key" => "Port Id"
          }
          merge => {
            "event.idm.read_only_udm.additional.fields" => "port_id_label"
          }
          on_error => "additional_field_not_set"
        }
      }
      if [sub_port_id] != "" {
        mutate {
          convert => {
            "sub_port_id" => "string"
          }
          on_error => "sub_port_id_already_string"
        }
        mutate {
          replace => {
            "sub_port_id_label.value.string_value" => "%{sub_port_id}"
            "sub_port_id_label.key" => "Sub-port Id"
          }
          merge => {
            "event.idm.read_only_udm.additional.fields" => "sub_port_id_label"
          }
          on_error => "additional_field_not_set"
        }
      }
      if [ca] != "" {
        mutate {
          convert => {
            "ca" => "string"
          }
          on_error => "ca_already_string"
        }
        mutate {
          replace => {
            "ca_label.value.string_value" => "%{ca}"
            "ca_label.key" => "CA"
          }
          merge => {
            "event.idm.read_only_udm.additional.fields" => "ca_label"
          }
          on_error => "additional_field_not_set"
        }
      }
    }
  }

  else if [event_name] in ["tmnxLldpRemEntryPeerAdded", "tmnxLldpRemEntryPeerRemoved",
                            "tmnxIsisSidError", "tmnxLldpRemManAddrEntryAdded",
                            "tmnxLldpRemManAddrEntryRemoved"] {
    grok {
      match => {
        "message1" => ["%{DATA:desc}, local port-id %{DATA:local_port_id}, dest-mac-type %{NOTSPACE:mac_type}, remote system name %{HOSTNAME:dest_host}, remote chassis-id %{DATA:dest_mac}, remote port-id %{DATA:port_id}, remote-index %{INT:remote_index}",
                      "%{DATA:desc}, local-port-id %{DATA:local_port_id}, dest-mac-type %{NOTSPACE:mac_type}, remote management address %{IP:dest_ip}, remote-index %{INT:remote_index}",
                      "%{DATA:desc}, advRtr:%{HOSTNAME:dest_host}%{GREEDYDATA}, ip@:%{IP:dest_ip}/%{INT:dest_port} SID:%{INT:sid}, level:%{DATA:level}, mtid:%{INT:mtid}, type:%{WORD:type}, flags:%{WORD:flag} , algo:%{INT:algo}"]
      }
      overwrite => ["desc", "local_port_id", "mac_type", "dest_host", "dest_mac", "port_id", "remote_index", "dest_ip", "dest_port", "sid", "level", "mtid", "type", "flag", "algo"]
      on_error => "grok_fail_for_lldp"
    }
    if ![grok_fail_for_lldp] {
      if [desc] != "" {
        mutate {
          replace => {
            "security_result.description" => "%{desc}"
          }
          on_error => "description_missing"
        }
      }
      if [dest_ip] != "" {
        mutate {
          merge => {
            "target.ip" => "dest_ip"
          }
          on_error => "target_ip_not_present"
        }
      }
      if [dest_port] != "" {
        mutate {
          replace => {
            "target.port" => "%{dest_port}"
          }
          on_error => "target_port_missing"
        }
        mutate {
          convert => {
            "target.port" => "integer"
          }
        }
      }
      if [sid] != "" {
        mutate {
          replace => {
            "network.session_id" => "%{sid}"
          }
          on_error => "session_id_not_present"
        }
      }
      if [local_port_id] != "" {
        mutate {
          convert => {
            "local_port_id" => "string"
          }
          on_error => "local_port_id_already_string"
        }
        mutate {
          replace => {
            "local_port_id_label.value" => "%{local_port_id}"
            "local_port_id_label.key" => "local_port_id"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "local_port_id_label"
          }
          on_error => "merge_error"
        }
      }
      if [mac_type] != "" {
        mutate {
          convert => {
            "mac_type" => "string"
          }
          on_error => "mac_type_already_string"
        }
        mutate {
          replace => {
            "mac_type_label.value" => "%{mac_type}"
            "mac_type_label.key" => "mac_type"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "mac_type_label"
          }
          on_error => "merge_error"
        }
      }
      if [dest_host] != "" {
        mutate {
          replace => {
            "target.hostname" => "%{dest_host}"
          }
          on_error => "target_hostname_missing"
        }
      }
      if [dest_mac] != "" {
        mutate {
          merge => {
            "target.mac" => "dest_mac"
          }
          on_error => "target_mac_missing"
        }
      }
      if [port_id] != "" {
        mutate {
          convert => {
            "port_id" => "string"
          }
          on_error => "port_id_already_string"
        }
        mutate {
          replace => {
            "port_id_label.value" => "%{port_id}"
            "port_id_label.key" => "port_id"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "port_id_label"
          }
          on_error => "merge_error"
        }
      }
      if [remote_index] != "" {
        mutate {
          convert => {
            "remote_index" => "string"
          }
          on_error => "remote_index_already_string"
        }
        mutate {
          replace => {
            "remote_index_label.value" => "%{remote_index}"
            "remote_index_label.key" => "remote_index"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "remote_index_label"
          }
          on_error => "merge_error"
        }
      }
      if [level] != "" {
        mutate {
          convert => {
            "level" => "string"
          }
          on_error => "level_already_string"
        }
        mutate {
          replace => {
            "level_label.value" => "%{level}"
            "level_label.key" => "level"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "level_label"
          }
          on_error => "merge_error"
        }
      }
      if [mtid] != "" {
        mutate {
          convert => {
            "mtid" => "string"
          }
          on_error => "mtid_already_string"
        }
        mutate {
          replace => {
            "mtid_label.value" => "%{mtid}"
            "mtid_label.key" => "mtid"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "mtid_label"
          }
          on_error => "merge_error"
        }
      }
      if [type] != "" {
        mutate {
          convert => {
            "type" => "string"
          }
          on_error => "type_already_string"
        }
        mutate {
          replace => {
            "type_label.value" => "%{type}"
            "type_label.key" => "type"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "type_label"
          }
          on_error => "merge_error"
        }
      }
      if [flag] != "" {
        mutate {
          convert => {
            "flag" => "string"
          }
          on_error => "flag_already_string"
        }
        mutate {
          replace => {
            "flag_label.value" => "%{flag}"
            "flag_label.key" => "flag"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "flag_label"
          }
          on_error => "merge_error"
        }
      }
      if [algo] != "" {
        mutate {
          convert => {
            "algo" => "string"
          }
          on_error => "algo_already_string"
        }
        mutate {
          replace => {
            "algo_label.value" => "%{algo}"
            "algo_label.key" => "algo"
          }
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "algo_label"
          }
          on_error => "merge_error"
        }
      }
    }
  }

  else if [event_name] == "mafEntryMatch" {
    if [message1] != "" {
      mutate {
        gsub => ["message1", "Src ", "Src"]
      }
      mutate {
        gsub => ["message1", "Dst ", "Dst"]
      }
      mutate {
        gsub => ["message1", ": ", ":"]
      }
      mutate {
        gsub => ["message1", "  ", " "]
      }
      grok {
        match => {
          "message1" => "Description:%{GREEDYDATA:desc}. Interface:%{WORD:interface}, %{GREEDYDATA:kv_data}"
        }
        overwrite => ["desc", "interface", "kv_data"]
      }
      kv {
        source => "kv_data"
        field_split => " "
        value_split => ":"
        on_error => "kv_fail"
      }
    }
    if [desc] != "" {
      mutate {
        replace => {
          "security_result.description" => "%{desc}"
        }
      }
    }
    if ![kv_fail] {
      if [SrcIP] != "" {
        grok {
          match => {
            "SrcIP" => "%{IP:src_ip}:%{INT:src_port}"
          }
          overwrite => ["src_ip", "src_port"]
          on_error => "src_ip_grok_fail"
        }
        if [src_port] != "" {
          mutate {
            replace => {
              "principal.port" => "%{src_port}"
            }
            on_error => "src_port_not_present"
          }
          mutate {
            convert => {
              "principal.port" => "integer"
            }
            on_error => "already_integer"
          }
        }
      }
      if [DstIP] != "" {
        grok {
          match => {
            "DstIP" => "%{IP:dest_ip}:%{INT:dest_port}"
          }
          overwrite => ["dest_ip", "dest_port"]
          on_error => "dest_ip_grok_fail"
        }
        if [dest_ip] != "" {
          mutate {
            merge => {
              "target.ip" => "dest_ip"
            }
            on_error => "target_ip_missing"
          }
        }
        if [dest_port] != "" {
          mutate {
            replace => {
              "target.port" => "%{dest_port}"
            }
            on_error => "target_port_missing"
          }
          mutate {
            convert => {
              "target.port" => "integer"
            }
            on_error => "already_integer"
          }
        }
      }
      if [Protocol] != "" {
        mutate {
          replace => {
            "network.ip_protocol" => "%{Protocol}"
          }
          on_error => "protocol_missing"
        }
      }
    }
  }

  if [src_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "src_ip"
        "intermediary.ip" => "src_ip"
        "intermediary.asset.ip" => "src_ip"
      }
      on_error => "src_ip_merge_error"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }


  if [src_ip] != "" and [dest_ip] != "" and [network] != "" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
    }
  }

  else if [principal] != "" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }

  else {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  mutate {
    merge => {
      "event.idm.read_only_udm.intermediary" => "intermediary"
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      "event.idm.read_only_udm.metadata.vendor_name" => "NOKIA_ROUTER"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
