# Product: TACACS_PLUS
# Category: Authentication log types
# Supported Format: SYSLOG
# Reference: NA
# Last Updated:2025-03-12
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "security_result" => ""
      "date"=>""
      "event_name"=>""
      "action_type"=>""
      "target_ids"=>""
      "has_user" => "false"
      "additional" => ""
      "timestamp" => ""
      "hostname" => ""
      "device_ip" => ""
      "session_id" => ""
      "process_id" => ""
      "pcre_pattern" => ""
      "command" => ""
      "return_code" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "csvData" => ""
      "responseDescription" => ""
      "service" => ""
      "terminal" => ""
      "status" => ""
      "ResponseDescription" => ""
      "Deviceip" => ""
      "column1" => ""
      "column2" => ""
      "column3" => ""
      "column4" => ""
      "column5" => ""
      "column6" => ""
      "dummyData" => ""
      "principalIp" => ""
    }
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp}\\s+%{DATA:hostname}\\s+tacplus:\\s+%{DATA:session_id}/%{DATA:process_id}:\\s+%{IP:device_ip}\\s+pcre2:\\s+'\\^%{DATA:pcre_pattern}'\\s+%{DATA:dummyData}'%{DATA:responseDescription}\\s+<cr>'\\s+=\\s+%{GREEDYDATA:return_code}",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp}\\s+%{HOSTNAME:hostname}\\s+tacplus:\\s+%{DATA:session_id}\\/%{DATA:process_id}:\\s+%{IP:device_ip}\\s+%{GREEDYDATA:responseDescription}",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp}\\s+%{HOSTNAME:hostname}\\s+tacplus:\\s+%{DATA}\\:\\s+%{GREEDYDATA:responseDescription}",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp}\\s+%{HOSTNAME:hostname}\\s+tacplus:\\s+%{DATA:principalIp}\\|%{GREEDYDATA:csvData}"
       ]
    }
    overwrite => ["timestamp", "hostname", "device_ip", "session_id", "process_id", "pcre_pattern", "command", "return_code","csvData","responseDescription","dummyData", "principalIp"]
     on_error => "grok_failed"
  }

  csv {
    source => "csvData"
    separator => "|"
    on_error => "no_csvData"

  }

  if [csvData] =~ "ascii" {
    mutate {
      replace =>{
        "username" => "%{column1}"
        "terminal" => "%{column2}"
        "Deviceip" => "%{column3}"
        "ResponseDescription" => "%{column4}"
      }
      on_error => "no_csvData"
    }
  }
  else {
    mutate {
      replace =>{
        "username"  => "%{column1}"
        "terminal" => "%{column2}"
        "Deviceip" => "%{column3}"
        "status" => "%{column4}"
        "service" => "%{column5}"
        "ResponseDescription" => "%{column6}"
      }
      on_error => "no_csvData"
    }
  }


  if [status] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{status}"
      }
      on_error => "no_status"
    }
  }

  if [username] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{username}"
      }
      on_error => "no_username"
    }
    if ![no_username] {
      mutate {
        replace => {
          "has_user" => "true"
        }
      }
    }
  }

  if [service] != "" {
    mutate {
      replace => {
        "target.application" => "%{service}"
      }
      on_error => "no_service"
    }
  }

  if [terminal] != "" {
    mutate {
      replace => {
        "target.resource.name" => "%{terminal}"
      }
      on_error => "no_terminal"
    }
  }

  if [responseDescription] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{responseDescription}"
      }
      on_error => "no_responseDescription"
    }
  }

  if [return_code] != "" {
    mutate {
      replace => {
        "security_result.summary" => "Return code: %{return_code}"
      }
      on_error => "no_return_code"
    }
  }

  if [command] != "" {
    mutate {
      replace => {
        "target.process.command_line" => "%{command}"
      }
      on_error => "no_command"
    }
  }
  if [responseDescription] != "" {
    mutate {
      replace => {
        "ResponseDescription" => "%{responseDescription}"
      }
    }
  }
  if [ResponseDescription] =~ "pcre2" {
    mutate {
      replace => {
        "security_result.summary" => "%{ResponseDescription}"
      }
      on_error => "no_ResponseDescription"
    }
  }
  else if [ResponseDescription] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{ResponseDescription}"
      }
      on_error => "no_ResponseDescription"
    }
  }

  if [process_id] != "" {
    mutate {
      replace => {
        "target.process.pid" => "%{process_id}"
      }
      on_error => "no_process_id"
    }
  }

  if [session_id] != "" {
    mutate {
      replace => {
        "network.session_id" => "%{session_id}"
      }
      on_error => "no_session_id"
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
        "principal.asset.hostname" => "%{hostname}"
      }
      on_error => "no_hostname"
    }
    if ![no_hostname] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

   if [principalIp] != "" {
    mutate {
      merge => {
        "principal.ip" => "principalIp"
        "principal.asset.ip" => "principalIp"
      }
      on_error => "no_principalIp"
    }
    if ![no_principalIp] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [device_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "device_ip"
        "target.asset.ip" => "device_ip"
      }
      on_error => "no_device_ip"
    }
    if ![no_device_ip] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }

  if [Deviceip] != "" {
    mutate {
      merge => {
        "target.ip" => "Deviceip"
        "target.asset.ip" => "Deviceip"
      }
      on_error => "no_Deviceip"
    }
    if ![no_Deviceip] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "TACACS Plus"
    }
  }
  mutate {
    replace => {
      "metadata.vendor_name" => "TACACS Plus"
    }
  }


  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
        mutate {
          replace => {
            "metadata.event_type" => "STATUS_UPDATE"
          }
        }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }


  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
