# Product: WEBMARSHAL
# Category: Proxy Server
# Supported Format: SYSLOG + CSV
# Reference: N/A
# Last Updated: 2023-04-27
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "timestamp" => ""
      "cataction" => ""
      "agent" => ""
      "arg" => ""
      "contenttype" => ""
      "dclass" => ""
      "dst" => ""
      "dstname" => ""
      "fclass" => ""
      "filetype" => ""
      "fw" => ""
      "id" => ""
      "op" => ""
      "pri" => ""
      "proto" => ""
      "rcvd" => ""
      "ref" => ""
      "scheme" => ""
      "scode" => ""
      "sent" => ""
      "src" => ""
      "srcname" => ""
      "time" => ""
      "user" => ""
      "security_result" => ""
      "catsite" => ""
      "rule" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "%{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:intermediary_hostname} %{WORD:application} %{INT} %{WORD:userid} - %{WORD:severity} - %{GREEDYDATA:kv_data}"
      ]
    }
    overwrite => ["timestamp"]
  }

  mutate {
    gsub => ["kv_data","_",""]
  }

  if [kv_data] != "" {
    mutate {
      gsub => ["kv_data","( [a-zA-Z0-9]+)=","#$1="]
    }

    mutate {
      gsub => ["kv_data", "\\\"", ""]
    }
    kv {
      source => "kv_data"
      field_split => "#"
      value_split => "="
      on_error => "not_kv"
    }
  }

  if [src] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "src"
      }
    }
  }

  if [srcname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{srcname}"
      }
    }
  }

  if [user] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.user_display_name" => "%{user}"
      }
    }
  }

  if [userid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{userid}"
      }
    }
  }

  if [dst] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "dst"
      }
    }
  }

  if [dstname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{dstname}"
      }
    }
  }

  if [arg] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.command_line" => "%{arg}"
      }
    }
  }

  if [filetype] =~ "(?i)text" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.file_type" => "FILE_TYPE_TEXT"
      }
    }
  }

  if [application] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.application" => "%{application}"
      }
    }
  }

  if [severity] =~ "(?i)info" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  }

  if [cataction] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{cataction}"
      }
    }
  }

  if [cataction] =~ "(?i)block|fail" {
    mutate {
      replace => {
        "security_result_action" => "BLOCK"
      }
    }
  }
  else {
    mutate {
      replace => {
        "security_result_action" => "ALLOW"
      }
    }
  }

  mutate {
    merge => {
      "security_result.action" => "security_result_action"
    }
  }

  if [catsite] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{catsite}"
      }
    }
  }

  if [dclass] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{dclass}"
      }
    }
  }

  if [rule] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{rule}"
      }
    }
  }

  if [sent] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.sent_bytes" => "%{sent}"
      }
      convert => {
        "event.idm.read_only_udm.network.sent_bytes" => "uinteger"
      }
    }
  }

  if [rcvd] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.received_bytes" => "%{rcvd}"
      }
      convert => {
        "event.idm.read_only_udm.network.received_bytes" => "uinteger"
      }
    }
  }

  if [scode] != "" {
    mutate {
      replace => {
        "event1.idm.read_only_udm.network.http.response_code" => "%{scode}"
      }
      convert => {
        "event1.idm.read_only_udm.network.http.response_code" => "integer"
      }
    }
  }

  if [scheme] =~ "(?i)https" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "HTTPS"
      }
    }
  }

  if [ref] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.referral_url" => "%{ref}"
      }
    }
  }

  if [op] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{op}"
      }
    }
  }

  if [agent] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" => "%{agent}"
      }
    }
  }

  if [fw] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.observer.hostname" => "%{fw}"
      }
    }
  }

  if [id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{id}"
      }
    }
  }

  if [intermediary_hostname] != "" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{intermediary_hostname}"
      }
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "WEBMARSHAL"
      "event.idm.read_only_udm.metadata.product_name" => "WEBMARSHAL"
      "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
