# Product: Cloudian Hyperstore
# Category: Storage Solutions
# Supported Format: SYSLOG
# Reference: https://cloudian.com/products/hyperstore/
# Last Updated: 2021-05-05
# Copyright 2021 Chronicle LLC


filter {
  mutate {
    replace => {
      "alert" => ""
      "request_id" => ""
      "source_ip" => ""
      "target_ip" => ""
      "status_code" => ""
      "method" => ""
      "file_path" => ""
      "url" => ""
      "description" => ""
      "port" => ""
      "session_id" => ""
      "user" => ""
      "inner_message" => ""
    }
  }

  grok {
      match => {
        "message" => [
          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:datetime} %{HOSTNAME:hostname} %{GREEDYDATA:application} %{INT} %{GREEDYDATA} \\[%{GREEDYDATA} REQID=\\\"%{GREEDYDATA:request_id}\\\"\\] %{GREEDYDATA},%{INT}\\|%{IP:source_ip}\\|%{GREEDYDATA}\\|%{INT:status_code}\\|(?P<method>GET|PUT|GETDIGEST|DELETE)\\|%{GREEDYDATA:file_path}\\|%{GREEDYDATA:url}\\|%{INT}\\|%{INT}\\|%{GREEDYDATA}\\\n"

          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:datetime} %{HOSTNAME:hostname} %{GREEDYDATA:application} %{INT} %{GREEDYDATA} Purged: %{GREEDYDATA:description}\\\n"

          "<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{HOSTNAME:hostname} %{GREEDYDATA:application}: Accepted publickey for %{USERNAME:user} from %{IP:target_ip} port %{POSINT:port} %{GREEDYDATA}"

          "<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{HOSTNAME:hostname} %{GREEDYDATA:application}: %{GREEDYDATA}: %{GREEDYDATA:description} for user %{USERNAME:user} by %{GREEDYDATA}"

          "<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{HOSTNAME:hostname} %{GREEDYDATA:application}: %{GREEDYDATA:description} from %{IP:target_ip} port %{POSINT:port}:%{INT}: %{GREEDYDATA:description}"

          "<%{INT}>%{SYSLOGTIMESTAMP:datetime} %{HOSTNAME:hostname} %{GREEDYDATA:application}: %{GREEDYDATA:inner_message}"
        ]
      }
      overwrite => ["request_id","source_ip","target_ip","status_code", "method","file_path", "url", "description", "port", "session_id", "user", "inner_message"]
  }

  if [inner_message] != "" {
    grok {
      match => {
        "inner_message" => [

          "%{GREEDYDATA:description} from %{IP:target_ip} port %{POSINT:port}"

          "%{GREEDYDATA:description} %{INT:session_id} of user %{USERNAME:user}"

          "%{GREEDYDATA:description} %{INT:session_id}"

          "%{GREEDYDATA:description}"
        ]
      }
      overwrite => ["request_id","source_ip","target_ip","status_code", "method","file_path", "url", "description", "port", "session_id", "user", "inner_message"]
    }
  }

  date {
    match => [ "datetime","RFC3339", "MMM dd HH:mm:ss"]
    rebase => true
  }

  if [request_id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.pid" => "%{request_id}"
      }
    }
  }

  if [source_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "source_ip"
      }
    }
  }

  if [target_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "target_ip"
      }
    }
  }

  if [port] != "" {
    mutate {
      convert => {
        "port" => "integer"
      }
    }
    mutate {
      rename => {
        "port" => "event.idm.read_only_udm.target.port"
      }
    }
  }

  if [url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.referral_url" => "%{url}"
      }
    }
  }

  if [status_code] != "" {
    mutate {
      convert => {
        "status_code" => "integer"
      }
    }

    mutate {
      rename => {
        "status_code" => "event.idm.read_only_udm.network.http.response_code"
      }
    }
  }

  if[method] != "" {
    mutate {
      rename => {
        "method" => "event.idm.read_only_udm.network.http.method"
      }
    }
  }

  if [file_path] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.file.full_path" => "%{file_path}"
      }
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{description}"
      }
    }
  }

  if [session_id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{session_id}"
      }
    }
  }

  if [user] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.user_display_name" => "%{user}"
        "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }

  if [file_path]  != "" or [description] =~ "Received disconnect" or [description] =~ "Disconnected" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [user] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.principal.hostname" => "%{hostname}"
      "event.idm.read_only_udm.principal.application" => "%{application}"
      "event.idm.read_only_udm.metadata.vendor_name" => "Cloudian"
      "event.idm.read_only_udm.metadata.product_name" => "Cloudian Hyperstore"
    }
  }

  mutate {
    merge => {
        "@output" => "event"
    }
  }
}
