# Product: Cloudflare PageShield
# Category: OS Logs
# Supported Format: JSON
# References: N/A
# Last Updated: 2025-03-05
# Copyright 2025 Google SecOps

filter{
  mutate {
    replace => {
      "name" => ""
      "text" => ""
      "resource.cryptomining_score" => ""
      "resource.dataflow_score" => ""
      "resource.first_page_url" => ""
      "resource.first_seen_at" => ""
      "resource.last_page_url" => ""
      "resource.id" => ""
      "resource.url" => ""
      "resource.resource_type" => ""
      "version.hash" => ""
      "version.fetched_at" => ""
      "policie.description" => ""
      "data.options.remove_dashboard_links" => ""
      "data.severity" => ""
      "data.type" => ""
      "data.zones" => ""
      "ts" => ""
      "account_id" => ""
      "policy_id" => ""
      "policy_name" => ""
      "alert_type" => ""
      "policie.id" => ""
      "Action" => ""
      "Host" => ""
      "URLHost" => ""
      "URLContainsCDNCGIPath" => ""
      "URL" => ""
      "PolicyID" => ""
      "PageURL" => ""
      "host.hostname" => ""
      "event_type" => ""
      "target" => ""
      "metadata" => ""
      "principal" => ""
      "additional" => ""
      "network" => ""
      "security_result" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "has_target_user" => "false"
    }
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "json_error"
  }
  if [Action] != "" {
    mutate {
      replace => {
        "action_label.key" => "action"
        "action_label.value.string_value" => "%{Action}"
      }
      on_error => "action_label_empty"
    }
    if ![action_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "action_label"
        }
        on_error => "action_label_empty"
      }
    }
  }
  if [Host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{Host}"
        "principal.asset.hostname" => "%{Host}"
        "has_principal" => "true"
      }
      on_error => "host_empty"
    }
  }
  if [URLHost] != "" && [URLHost] =~ "^.+@.+$"{
    mutate {
      merge => {
        "target.user.email_addresses" => "URLHost"
      }
      on_error => "urlhost_empty"
    }
  }
  if [URLContainsCDNCGIPath] != "" {
    mutate {
      convert => {
        "URLContainsCDNCGIPath" => "string"
      }
      on_error => "urlcontainscdncgi_empty"
    }
    mutate {
      replace => {
        "CGI_label.key" => "CGI"
        "CGI_label.value.string_value" => "%{URLContainsCDNCGIPath}"
      }
      on_error => "cgi_label_empty"
    }
    if ![cgi_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "CGI_label"
        }
        on_error => "cgi_label_empty"
      }
    }
  }
  if [URL] != "" {
    mutate {
      replace => {
        "target.url" => "%{URL}"
      }
      on_error => "url_empty"
    }
  }
  if [PolicyID] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{PolicyID}"
      }
      on_error => "policyid_empty"
    }
  }
  if [PageURL] != "" {
    mutate {
      replace => {
        "principal.url" => "%{PageURL}"
      }
      on_error => "pageurl_empty"
    }
  }
  if [name] != "" {
    mutate {
      replace => {
        "name_label.key" => "name"
        "name_label.value.string_value" => "%{name}"
      }
      on_error => "name_label_empty"
    }
    if ![name_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "name_label"
        }
        on_error => "name_label_empty"
      }
    }
  }
  if [text] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{text}"
      }
      on_error => "text_empty"
    }
  }
  for index1,host in data.hosts {
    mutate {
      convert => {
        "index1" => "string"
      }
      on_error => "index1_empty"
    }
    mutate {
      replace => {
        "hostname" => ""
      }
    }
    if [host][hostname] != "" {
      mutate {
        replace => {
          "principal.hostname" => "%{host.hostname}"
          "principal.asset.hostname" => "%{host.hostname}"
          "has_principal" => "true"
        }
        on_error => "hostname_empty"
      }
    }
    for index2,resource in host.resources {
      mutate {
        replace => {
          "crypto_label" => ""
          "dataflow_label" => ""
          "first_page_label" => ""
          "first_seen_at" => ""
          "id" => ""
          "last_page_label" => ""
          "res_type_label" => ""
          "url" => ""
        }
      }
      mutate {
        convert => {
          "resource.cryptomining_score" => "string"
        }
        on_error => "resource_convert_empty"
      }
      mutate {
        replace => {
          "crypto_label.key" => "cryptomining_score_%{index2}"
          "crypto_label.value" => "%{resource.cryptomining_score}"
        }
        on_error => "crypto_label_empty"
      }
      if ![crypto_label_empty] {
        mutate {
          merge => {
            "principal.resource.attribute.labels" => "crypto_label"
          }
          on_error => "crypto_label_empty"
        }
      }
      mutate {
        convert => {
          "resource.dataflow_score" => "string"
        }
        on_error => "resource_convert_empty"
      }
      mutate {
        replace => {
          "dataflow_label.key" => "dataflow_score_%{index2}"
          "dataflow_label.value" => "%{resource.dataflow_score}"
        }
        on_error => "dataflow_label_empty"
      }
      if ![dataflow_label_empty] {
        mutate {
          merge => {
            "principal.resource.attribute.labels" => "dataflow_label"
          }
          on_error => "dataflow_label_empty"
        }
      }
      mutate {
        replace => {
          "first_page_label.key" => "first_page_url"
          "first_page_label.value.string_value" => "%{resource.first_page_url}"
        }
        on_error => "first_page_label_empty"
      }
      if ![first_page_label_empty] {
        mutate {
          merge => {
            "additional.fields" => "first_page_label"
          }
          on_error => "first_page_label_empty"
        }
      }
      date{
        match => ["resource.first_seen_at", "ISO8601"]
        target => "security_result.first_discovered_time"
        on_error => "first_seen_at_empty"
      }
      mutate {
        replace => {
          "principal.resource.id" => "%{resource.id}"
        }
        on_error => "resource_id_empty"
      }
      mutate {
        replace => {
          "last_page_label.key" => "last_page_url}"
          "last_page_label.value.string_value" => "%{resource.last_page_url}"
        }
        on_error => "last_page_label_empty"
      }
      if ![last_page_label_empty] {
        mutate {
          merge => {
            "additional.fields" => "last_page_label"
          }
          on_error => "last_page_label_empty"
        }
      }
      mutate {
        replace => {
          "res_type_label.key" => "resource_type_%{index2}"
          "res_type_label.value" => "%{resource.resource_type}"
        }
        on_error => "resource_type_label_empty"
      }
      if ![resource_type_label_empty] {
        mutate {
          merge => {
            "principal.resource.attribute.labels" => "res_type_label"
          }
          on_error => "resource_type_label_empty"
        }
      }
      mutate {
        replace => {
          "network.http.referral_url" => "%{resource.url}"
        }
        on_error => "resource_url_empty"
      }
      for version in resource.versions {
        mutate {
          replace => {
            "fetched_at_label" => ""
            "hash_label" => ""
          }
        }
        mutate {
          replace => {
            "fetched_at_label.key" => "fetched_at_%{index2}"
            "fetched_at_label.value" => "%{version.fetched_at}"
          }
          on_error => "fetched_at_label_empty"
        }
        if ![fetched_at_label_empty] {
          mutate {
            merge => {
              "principal.resource.attribute.labels" => "fetched_at_label"
            }
            on_error => "fetched_at_label_empty"
          }
        }
        mutate {
          replace => {
            "hash_label.key" => "hash_%{index2}"
            "hash_label.value" => "%{version.hash}"
          }
          on_error => "hash_label_empty"
        }
        if ![hash_label_empty] {
          mutate {
            merge => {
              "principal.resource.attribute.labels" => "hash_label"
            }
            on_error => "hash_label_empty"
          }
        }
      }
    }
  }
  for index,policie in data.metadata.policies {
    mutate {
      convert => {
        "index" => "string"
      }
      on_error => "index_empty"
    }
    mutate {
      replace => {
        "desc_label" => ""
        "id_label" => ""
      }
    }
    mutate {
      replace => {
        "desc_label.key" => "description_%{index}"
        "desc_label.value" => "%{policie.description}"
      }
      on_error => "desc_label_empty"
    }
    if ![desc_label_empty] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "desc_label"
        }
        on_error => "desc_label_empty"
      }
    }
    mutate {
      replace => {
        "id_label.key" => "policy_id_%{index}"
        "id_label.value" => "%{policie.id}"
      }
      on_error => "id_label_empty"
    }
    if ![id_label_empty] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "id_label"
        }
        on_error => "id_label_empty"
      }
    }
  }
  if [data][options][remove_dashboard_links] != "" {
    mutate {
      convert => {
        "data.options.remove_dashboard_links" => "string"
      }
      on_error => "options_convert_empty"
    }
    mutate {
      replace => {
        "remove_dash_label.key" => "remove_dashboard_links"
        "remove_dash_label.value" => "%{data.options.remove_dashboard_links}"
      }
      on_error => "remove_dash_label_empty"
    }
    if ![remove_dash_label_empty] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "remove_dash_label"
        }
        on_error => "remove_dash_label_empty"
      }
    }
  }
  if [data][severity] == "INFO" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
      on_error => "severity_empty"
    }
  }
  else if [data][severity] == "WARN" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
      on_error => "severity_empty"
    }
  }
  else {
    mutate {
      replace => {
        "security_result.severity" => "UNKNOWN_SEVERITY"
      }
      on_error => "severity_empty"
    }
  }
  if [data][type] != "" {
    mutate {
      replace => {
        "type_label.key" => "type"
        "type_label.value" => "%{data.type}"
      }
      on_error => "type_label_empty"
    }
    if ![type_label_empty] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "type_label"
        }
        on_error => "type_label_empty"
      }
    }
  }
  if [data][zones] != "" {
    mutate {
      replace => {
        "zones_label.key" => "zones"
        "zones_label.value" => "%{data.zones}"
      }
      on_error => "zones_label_empty"
    }
    if ![zones_label_empty] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "zones_label"
        }
        on_error => "zones_label_empty"
      }
    }
  }
  mutate {
    convert => {
      "ts" => "string"
    }
    on_error => "ts_empty"
  }
  if [ts] != "" {
    date {
      match => ["ts", "UNIX"]
      target => "metadata.event_timestamp"
      on_error => "ts_not_valid"
    }
  }
  if [account_id] != "" {
    mutate {
      replace => {
        "principal.user.product_object_id" => "%{account_id}"
      }
      on_error => "account_id_empty"
    }
  }
  if [policy_id] != "" {
    mutate {
      replace => {
        "policy_id_label.key" => "policy_id"
        "policy_id_label.value" => "%{policy_id}"
      }
      on_error => "policy_id_label_empty"
    }
    if ![policy_id_label_empty] {
      mutate {
        merge => {
          "security_result.detection_fields" => "policy_id_label"
        }
        on_error => "policy_id_label_empty"
      }
    }
  }
  if [policy_name] != "" {
    mutate {
      replace => {
        "policy_name_label.key" => "policy_name"
        "policy_name_label.value" => "%{policy_name}"
      }
      on_error => "policy_name_label_empty"
    }
    if ![policy_name_label_empty] {
      mutate {
        merge => {
          "security_result.detection_fields" => "policy_name_label"
        }
        on_error => "policy_name_label_empty"
      }
    }
  }
  if [alert_type] != "" {
    mutate {
      replace => {
        "alert_type_label.key" => "alert_type"
        "alert_type_label.value" => "%{alert_type}"
      }
      on_error => "alert_type_label_empty"
    }
    if ![alert_type_label_empty] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "alert_type_label"
        }
        on_error => "alert_type_label_empty"
      }
    }
  }
  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_target_user] == "true" {
    mutate {
      replace => {
        "event_type" => "USER_UNCATEGORIZED"
      }
      on_error => "event_type_empty"
    }
  }
  else if [has_principal] == "true"  {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
      on_error => "event_type_empty"
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_empty"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}