# Product: SIERRA_WIRELESS
# Category: IOT Devices
# Supported Format: SYSLOG
# Reference: N/A
# Last Updated: 2023-11-23
# Copyright 2023 Chronicle LLC

filter{
  mutate {
    replace => {
      "date_ts" => ""
      "hostname" => ""
      "target_hostname" => ""
      "description" => ""
      "ipaddress" => ""
      "metaseqId" => ""
      "username" => ""
      "desc" => ""
      "principal_machine_id_present" => "false"
      "fd" => ""
      "principal" => ""
      "event_type" => ""
      "metadata" => ""
      "security_result" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "%{SYSLOGTIMESTAMP:date_ts} %{HOSTNAME:hostname} %{WORD:target_hostname}: %{GREEDYDATA:description}",
        "\\<%{INT}\\>%{INT} %{GREEDYDATA:date_ts} %{HOSTNAME:hostname} %{WORD:target_hostname} - - \\[meta sequenceId=.%{INT:metaseqId}\\S\\] %{GREEDYDATA:description}",
        "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:date_ts} %{HOSTNAME:hostname} %{DATA:target_hostname} %{INT} %{DATA} \\[meta sequenceId=.%{INT:metaseqId}\\S\\] %{GREEDYDATA:description}"
      ]
    }
    overwrite => ["date_ts","hostname","target_hostname","description","metaseqId"]
    on_error => "pattern_failed"
  }

  if [pattern_failed] {
    drop {
      tag => "TAG_UNSUPPORTED"
    }
  }

  if [date_ts] != "" {
    date {
      match => ["date_ts","MMM d HH:mm:ss","yyyy-MM-dTHH:mm:ssZZ"]
      rebase => true
      on_error => "time_format_error"
      target => "metadata.event_timestamp"
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
      }
      on_error => "principal_hostname_invalid"
    }
    if ![principal_hostname_invalid] {
      mutate {
        replace => {
          "principal_machine_id_present" => "true"
        }
      }
    }
  }

  if [target_hostname] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{target_hostname}"
      }
    }
  }

  if [metaseqId] != "" {
    mutate {
      convert => {
        "metaseqId" => "string"
      }
      on_error => "metaseqId_already_string"
    }
    mutate {
      replace => {
        "add_label.key" => "meta_sequence_id"
        "add_label.value.string_value" => "%{metaseqId}"
      }
      on_error => "metaseqId_value_invalid"
    }
    if ![metaseqId_value_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "add_label"
        }
        on_error => "add_label_merge_failed"
      }
    }
  }

  if [description] != "" {
    grok {
      match => {
        "description" => [
          "User \\[%{WORD:username}\\]+ %{GREEDYDATA:desc} from IP \\[%{IP:ipaddress}\\]",
          "%{DATA:desc}; fd=.%{INT:fd}."
        ]
      }
      overwrite => ["ipaddress","desc","username", "fd"]
      on_error => "invalid_pattern"
    }
    if [desc] != "" {
      mutate {
        replace => {
          "security_result.description" => "%{desc}"
        }
        on_error => "desc_empty"
      }
    }
    if [username] != "" {
      mutate {
        replace => {
          "principal.user.userid" => "%{username}"
        }
      }
    }
    if [ipaddress] != "" {
      mutate {
        merge => {
          "principal.ip" => "ipaddress"
        }
        on_error => "principal_ip_merge_failed"
      }
      if ![principal_ip_merge_failed] {
        mutate {
          replace => {
            "principal_machine_id_present" => "true"
          }
        }
      }
      if ![principal_ip_merge_failed] and [target] != "" {
        mutate {
          replace => {
            "event_type" => "USER_LOGIN"
            "event.idm.read_only_udm.extensions.auth.type" => "MACHINE"
          }
        }
      }
      else if ![principal_ip_merge_failed] {
        mutate {
          replace => {
            "event_type" => "STATUS_UPDATE"
          }
        }
      }
    }
    if [fd] != "" {
      mutate {
        convert => {
          "fd" => "string"
        }
        on_error => "fd_already_string"
      }
      mutate {
        replace => {
          "fd_label.key" => "fd"
          "fd_label.value" => "%{fd}"
        }
        on_error => "fd_value_invalid"
      }
      if ![fd_value_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "fd_label"
          }
          on_error => "fd_label_merge_failed"
        }
      }
    }
  }

  if [event_type] == "" {
    if [principal_machine_id_present] == "true" {
      mutate {
        replace => {
          "event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event_type" => "GENERIC_EVENT"
        }
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "SIERRA_WIRELESS"
      "metadata.vendor_name" => "SIERRA_WIRELESS"
      "metadata.event_type" => "%{event_type}"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
