# Product: IBM WEBSEAL
# Category: Web server
# Supported Format: JSON, SYSLOG
# Reference: NA
# Last Updated: 2025-10-08
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "intermediary" => ""
      "additional" => ""
      "security_result" => ""
      "principal_ip" => ""
      "referral_url" => ""
      "timestamp" => ""
      "request" => ""
      "principal_hostname" => ""
      "principal_user_userid" => ""
      "intermediary_hostname" => ""
      "session_duration" => ""
      "response_code" => ""
      "request_method" => ""
      "target_url" => ""
      "code_resp" => ""
      "target_ip" => ""
      "versions" => ""
      "user_agent" => ""
      "bytes_resp" => ""
      "orden" => ""
      "type" => ""
      "port" => ""
      "host" => ""
      "has_principal" => "false"
      "has_principal_user" => "false"
      "has_target" => "false"
      "temp_data" => ""
      "temp" => ""
      "temp1" => ""
      "temp2" => ""
      "temp3" => ""
      "temp4" => ""
      "src_host" => ""
      "src_app" => ""
      "date" => ""
      "time" => ""
      "tz" => ""
      "network_method" => ""
      "dst_url" => ""
      "app_protocol" => ""
      "res_code" => ""
      "sent_bytes" => ""
      "rec_bytes" => ""
      "app_proto" => ""
      "src_port" => ""
      "dst_host" => ""
      "level" => ""
      "desc" => ""
      "kv_data" => ""
      "description" => ""
      "status" => ""
      "operation" => ""
      "authSourceCode" => ""
      "accountValid" => ""
      "passwordValid" => ""
      "hashedPassword" => ""
      "registryDn" => ""
      "secUserDn" => ""
      "passwordResetAllowed" => ""
      "nonExpiringPassword" => ""
      "customPasswordPolicy" => ""
      "authSource" => ""
      "sec_action" => ""
      "username" => ""
      "http_version" => ""
      "http_method" => ""
      "http_uri" => ""
      "caca" => ""
      "URI" => ""
      "BYTES_RESP" => ""
      "logtype" => ""
      "version" => ""
    }
  }

  mutate {
    gsub => ["message", "@timestamp", "timestamp"]
  }
  mutate {
    gsub => ["message", "message", "msg_data"]
  }
  mutate {
    gsub => ["message", "\\r\\n", ""]
  }
  json {
    source => "message"
    array_function  => "split_columns"
    on_error => "not_json"
  }
  grok {
    match => {
      "message" => [
        "%{SYSLOGTIMESTAMP} %{DATA:src_host} %{DATA} %{DATA:src_app}: %{IPV4:principal_ip} - \\\"%{DATA}\\\" %{DATA:date}:%{TIME:time} %{DATA:tz} \\\"%{DATA:network_method} %{DATA:dst_url} %{DATA:app_protocol}\\\" %{INT:res_code} %{INT:sent_bytes} %{INT:rec_bytes} /%{DATA} - %{IP} %{IP:target_ip} %{DATA:app_proto}/%{DATA} %{INT:src_port} %{DATA} %{DATA} %{DATA:dst_host} %{GREEDYDATA}",
        "%{SYSLOGTIMESTAMP} %{DATA:src_host} %{DATA} %{DATA:date}I----- %{DATA} %{DATA:src_app} %{DATA:level} %{DATA} %{INT} %{DATA} -- %{DATA}\\s+  %{GREEDYDATA:desc}",
        "%{DATA} %{INT} %{TIME} %{HOSTNAME:src_host} %{DATA} \\[%{DATA} %{TIME} %{DATA}\\] %{DATA} %{DATA}\\s+%{DATA:description}\\s+\\[OperationResult@78e71b6c %{GREEDYDATA:kv_data}\\]"
      ]
    }
    on_error => "malformed_message_grok"
    overwrite => ["src_host", "src_app", "principal_ip", "date", "time", "tz", "network_method", "dst_url", "app_protocol", "res_code", "sent_bytes", "rec_bytes", "target_ip", "app_proto", "src_port", "dst_host", "level", "desc", "kv_data", "description"]
  }
  if[kv_data] != "" {
    mutate {
      gsub => ["kv_data", ", ", "#"]
    }
    mutate {
      gsub => ["kv_data", "'", ""]
    }
    kv {
      source => "kv_data"
      field_split => "#"
      value_split => "="
      on_error => "kv_fail"
    }
  }
  if [not_json] and [malformed_message_grok]{
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }
  grok {
    match => {
      "msg_data" => [
        "%{IPV4:principal_ip}\\s+-\\s+%{USER:principal_user_userid}\\s+\\[%{DATA:timestamp}\\]\\s+\\\"%{WORD:request_method}\\s+%{DATA:target_url}\\s+%{DATA:temp}\\\"\\s+%{INT:response_code}\\s+(%{INT:temp1}|-)\\s+\\\"(%{DATA:referral_url}|-).\\s+\\\"(%{DATA:versions},\\s+IP:%{IPV4:target_ip}|IP:%{IPV4:target_ip}|-)\\\"\\s+%{INT:temp2}\\s+%{INT:session_duration}\\s+(%{DATA:principal_hostname}|-)\\s+%{DATA:temp3}\\s+\\\"%{GREEDYDATA:temp4}"
        '%{IPV4:principal_ip}\\s+-\\s+%{USER:principal_user_userid}\\s+\\[%{DATA:timestamp}\\]\\s+\\\"%{WORD:request_method}\\s+%{DATA:target_url}\\s+%{DATA:temp}\\\"\\s+%{INT:response_code}\\s+(%{INT:temp1}|-)\\s+\\\"(%{DATA:referral_url}|-).\\s+%{GREEDYDATA:temp2}\\"\\s%{INT::temp3}\\s%{INT:session_duration}'
      ]
    }
    on_error => "malformed_message_grok"
    overwrite => ["principal_ip", "principal_user_userid", "timestamp",
    "request_method", "target_url", "response_code", "session_duration",
    "referral_url", "versions", "target_ip", "principal_hostname", "temp", "temp1", "temp2", "temp3", "temp4"]
  }

  if [malformed_message_grok] {
    grok {
      match => {
        "data.msg_data" => [
          "%{IPV4:principal_ip}\\s+-\\s+%{USER:principal_user_userid}\\s+\\[%{DATA:timestamp}\\]\\s+\\\"%{WORD:request_method}\\s+%{DATA:target_url}\\s+%{DATA:temp}\\\"\\s+%{INT:response_code}\\s+(%{INT:temp1}|-)\\s+\\\"(%{DATA:referral_url}|-).\\s+\\\"(%{DATA:versions},\\s+IP:%{IPV4:target_ip}|IP:%{IPV4:target_ip}|-)\\\"\\s+%{INT:temp2}\\s+%{INT:session_duration}\\s+(%{DATA:principal_hostname}|-)\\s+%{DATA:temp3}\\s+\\\"%{GREEDYDATA:temp4}"
          '%{IPV4:principal_ip}\\s+-\\s+%{USER:principal_user_userid}\\s+\\[%{DATA:timestamp}\\]\\s+\\\"%{WORD:request_method}\\s+%{DATA:target_url}\\s+%{DATA:temp}\\\"\\s+%{INT:response_code}\\s+(%{INT:temp1}|-)\\s+\\\"(%{DATA:referral_url}|-).\\s+%{GREEDYDATA:temp2}\\"\\s%{INT::temp3}\\s%{INT:session_duration}'
        ]
      }
      on_error => "malformed_message_grok"
      overwrite => ["principal_ip", "principal_user_userid", "timestamp",
      "request_method", "target_url", "response_code", "session_duration",
      "referral_url", "versions", "target_ip", "principal_hostname", "temp", "temp1", "temp2", "temp3", "temp4"]
    }
  }
  mutate{
    replace => {
      "principal_ip" => "%{IP_ORIGEN}"
    }
    on_error => "no_principal_ip"
  }
  mutate{
    replace => {
      "referral_url" => "%{REFERER}"
    }
    on_error => "no_referral_url"
  }
  mutate{
    replace => {
      "timestamp" => "%{FECHA}"
    }
    on_error => "no_timestamp"
  }
  mutate{
    replace => {
      "request" => "%{URI}"
    }
    on_error => "no_request"
  }
  mutate{
    replace => {
      "principal_hostname" => "%{VIRTUAL_HOST}"
    }
    on_error => "no_principal_hostname"
  }
  mutate{
    replace => {
      "principal_user_userid" => "%{USUARIO}"
    }
    on_error => "no_principal_user_userid"
  }
  mutate {
    replace => {
      "user_agent" => "%{USER_AGENT}"
    }
    on_error => "no_user_agent"
  }
  mutate {
    convert => {
      "BYTES_RESP" => "string"
    }
    on_error => "bytes_resp_convert_error"
  }
  mutate {
    replace => {
      "bytes_resp" => "%{BYTES_RESP}"
    }
    on_error => "no_bytes_resp"
  }
  mutate {
    convert => {
      "ORDEN" => "string"
    }
    on_error => "ORDEN_convert_error"
  }
  mutate {
    replace => {
      "orden" => "%{ORDEN}"
    }
    on_error => "no_orden"
  }
  mutate {
    convert => {
      "TIEMPO_BACKEND" => "string"
    }
    on_error => "tiempo_backend_convert_error"
  }
  mutate {
    replace => {
      "session_duration" => "%{TIEMPO_BACKEND}"
    }
    on_error => "no_session_duration"
  }
  mutate {
    convert => {
      "COD_RESP" => "string"
    }
    on_error => "cod_resp_conv_err_str"
  }
  mutate {
    replace => {
      "code_resp" => "%{COD_RESP}"
    }
    on_error => "no_code_resp"
  }
  mutate{
    replace => {
      "intermediary_hostname" => "%{hostname}"
    }
    on_error => "no_intermediary_hostname"
  }
  mutate {
    replace => {
      "i_hostname" => "%{data.properties._hostname.str}"
    }
    on_error => "no_i_hostname"
  }

  if [timestamp] != "" {
    date {
      match => [ "timestamp", "dd/MMM/yyyy:HH:mm:ss", "dd/MMM/yyyy:HH:mm:ss Z", "yyyy-MM-ddTHH:mm:ss.SSSZ"]
      on_error => "no_timestamp"
    }
  }
  if [principal_user_userid] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{principal_user_userid}"
        "has_principal_user" => "true"
      }
      on_error => "no_userid"
    }
  }
  if [principal_hostname] =~ "^.{1,255}$" and [principal_hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{principal_hostname}"
        "has_principal" => "true"
      }
      on_error => "no_hostname"
    }
  }
  if [port] != "" {
    mutate {
      convert => {
        "port" => "integer"
      }
      on_error => "conversion_failed"
    }
    if ![conversion_failed] {
      mutate {
        rename => {
          "port" => "principal.port"
        }
      }
    }
  }
  if [principal_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "principal_ip"
        "principal.asset.ip" => "principal_ip"
      }
      replace => {
        "has_principal" => "true"
      }
      on_error => "no_principal_ip"
    }
  }
  if [session_duration] != "" {
    mutate {
      convert => {
        "session_duration" => "integer"
      }
      on_error => "no_session_duration"
    }
    mutate {
      rename => {
        "session_duration" => "network.session_duration.seconds"
      }
      on_error => "no_session_duration"
    }
  }
  if [code_resp] =~ "^[1-5][0-9]{2}$" {
    mutate {
      convert => {
        "code_resp" => "integer"
      }
      on_error => "cod_resp_convert_error"
    }
    if ![cod_resp_convert_error] {
      mutate {
        rename => {
          "code_resp" => "network.http.response_code"
        }
        on_error => "cod_resp_error"
      }
    }
  }
  if [response_code] =~ "^[1-5][0-9]{2}$" {
    mutate {
      convert => {
        "response_code" => "integer"
      }
      on_error => "no_response_code"
    }
    if ![no_response_code] {
      mutate {
        rename => {
          "response_code" => "network.http.response_code"
        }
        on_error => "no_response_code"
      }
    }
  }
  if [src_host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{src_host}"
        "principal.asset.hostname" => "%{src_host}"
        "has_principal" => "true"
      }
      on_error => "no_src_host"
    }
  }
  if [src_app] != "" {
    mutate {
      replace => {
        "principal.application" => "%{src_app}"
        "has_principal" => "true"
      }
      on_error => "no_src_app"
    }
  }
  if [network_method] != "" {
    mutate {
      replace => {
        "network.http.method" => "%{network_method}"
      }
      on_error => "no_network_method"
    }
  }
  if [dst_url] != "" {
    mutate {
      replace => {
        "target.url" => "%{dst_url}"
      }
      on_error => "no_dst_url"
    }
  }
  if [app_protocol] != "" {
    mutate {
      replace => {
        "app_protocol_label.key" => "APP_PROTOCOL"
        "app_protocol_label.value.string_value" => "%{app_protocol}"
      }
      on_error => "no_app_protocol"
    }
    if ![no_app_protocol] {
      mutate {
        merge => {
          "additional.fields" => "app_protocol_label"
        }
        on_error => "app_protocol_label_merge_failed"
      }
    }
  }
  if [res_code] =~ "^[1-5][0-9]{2}$" {
    mutate {
      convert => {
        "res_code" => "integer"
      }
      on_error => "res_code_convert_error"
    }
    if ![res_code_convert_error] {
      mutate {
        rename => {
          "res_code" => "network.http.response_code"
        }
      }
    }
  }
  if [sent_bytes] != "" {
    mutate {
      convert => {
        "sent_bytes" => "uinteger"
      }
      on_error => "sent_bytes_convert_error"
    }
    if ![sent_bytes_convert_error] {
      mutate {
        rename => {
          "sent_bytes" => "network.sent_bytes"
        }
      }
    }
  }
  if [rec_bytes] != "" {
    mutate {
      convert => {
        "rec_bytes" => "uinteger"
      }
      on_error => "rec_bytes_convert_error"
    }
    if ![rec_bytes_convert_error] {
      mutate {
        rename => {
          "rec_bytes" => "network.received_bytes"
        }
      }
    }
  }
  if [app_proto] != "" {
    mutate {
      replace => {
        "network.application_protocol" => "%{app_proto}"
      }
      on_error => "no_app_proto"
    }
  }
  if [src_port] != "" {
    mutate {
      convert => {
        "src_port" => "integer"
      }
      on_error => "src_port_convert_error"
    }
    if ![src_port_convert_error] {
      mutate {
        rename => {
          "src_port" => "principal.port"
        }
      }
    }
  }
  if [dst_host] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{dst_host}"
        "target.asset.hostname" => "%{dst_host}"
        "has_target" => "true"
      }
      on_error => "no_dst_host"
    }
  }
  if [level] == "INFO" or [level] =~ "Information" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  } else if [level] == "ERROR" {
    mutate {
      replace => {
        "security_result.severity" => "ERROR"
      }
    }
  } else if [level] == "WARNING" {
    mutate {
      replace => {
        "security_result.severity" => "LOW"
      }
    }
  }
  if [desc] != "" {
    grok {
      match => {
        "desc" => ["%{GREEDYDATA} \\(%{DATA}:%{DATA};%{DATA}:\\s+%{DATA}\\s+%{DATA:error}\\)"]
      }
      on_error => "no_desc"
      overwrite => ["error"]
    }
    if [error] != "" {
      mutate {
        replace => {
          "error_label.key" => "ERROR"
          "error_label.value" => "%{error}"
        }
        on_error => "no_error"
      }
      if ![no_error] {
        mutate {
          merge => {
            "target.resource.attribute.labels" => "error_label"
          }
          on_error => "error_label_merge_failed"
        }
      }
    }
    mutate {
      replace => {
        "metadata.description" => "%{desc}"
      }
      on_error => "no_desc2"
    }
  }
  if [description] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{description}"
      }
      on_error => "no_description"
    }
  }
  if [status] != "" {
    if [status] == "SUCCESS" {
      mutate {
        replace => {
          "sec_action" => "ALLOW"
        }
      }
    }
    else {
      mutate {
        replace => {
          "sec_action" => "BLOCK"
        }
      }
    }
    mutate {
      merge => {
        "security_result.action" => "sec_action"
      }
      on_error => "no_security_result"
    }
  }
  if [operation] != "" {
    mutate {
      replace => {
        "operation_label.key" => "OPERATION"
        "operation_label.value" => "%{operation}"
      }
      on_error => "no_operation"
    }
    if ![no_operation] {
      mutate {
        merge => {
          "target.user.attribute.labels" => "operation_label"
        }
      }
    }
  }
  if [username] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{username}"
      }
      on_error => "no_username"
    }
  }
  if [authSourceCode] != "" {
    mutate {
      replace => {
        "auth_source_code_label.key" => "AUTH_SOURCE_CODE"
        "auth_source_code_label.value.string_value" => "%{authSourceCode}"
      }
      on_error => "no_auth_source_code"
    }
    if ![no_auth_source_code] {
      mutate {
        merge => {
          "additional.fields" => "auth_source_code_label"
        }
        on_error => "auth_source_code_label_merge_failed"
      }
    }
  }
  if [accountValid] != "" {
    mutate {
      replace => {
        "account_valid_label.key" => "ACCOUNT_VALID"
        "account_valid_label.value.string_value" => "%{accountValid}"
      }
      on_error => "no_account_valid"
    }
    if ![no_account_valid] {
      mutate {
        merge => {
          "additional.fields" => "account_valid_label"
        }
        on_error => "account_valid_label_merge_failed"
      }
    }
  }
  if [passwordValid] != "" {
    mutate {
      replace => {
        "password_valid_label.key" => "PASSWORD_VALID"
        "password_valid_label.value.string_value" => "%{passwordValid}"
      }
      on_error => "no_password_valid"
    }
    if ![no_password_valid] {
      mutate {
        merge => {
          "additional.fields" => "password_valid_label"
        }
        on_error => "password_valid_label_merge_failed"
      }
    }
  }
  if [hashedPassword] != "" {
    mutate {
      replace => {
        "hashed_password_label.key" => "HASHED_PASSWORD"
        "hashed_password_label.value.string_value" => "%{hashedPassword}"
      }
      on_error => "no_hashed_password"
    }
    if ![no_hashed_password] {
      mutate {
        merge => {
          "additional.fields" => "hashed_password_label"
        }
        on_error => "hashed_password_label_merge_failed"
      }
    }
  }
  if [registryDn] != "" {
    mutate {
      replace => {
        "registry_dn_label.key" => "REGISTRY_DN"
        "registry_dn_label.value" => "%{registryDn}"
      }
      on_error => "no_registry_dn"
    }
    if ![no_registry_dn] {
      mutate {
        merge => {
          "target.user.attribute.labels" => "registry_dn_label"
        }
        on_error => "registry_dn_label_merge_failed"
      }
    }
  }
  if [secUserDn] != "" {
    mutate {
      replace => {
        "sec_user_dn_label.key" => "SEC_USER_DN"
        "sec_user_dn_label.value" => "%{secUserDn}"
      }
      on_error => "no_sec_user_dn"
    }
    if ![no_sec_user_dn] {
      mutate {
        merge => {
          "target.user.attribute.labels" => "sec_user_dn_label"
        }
        on_error => "sec_user_dn_label_merge_failed"
      }
    }
  }
  if [passwordResetAllowed] != "" {
    mutate {
      replace => {
        "password_reset_allowed_label.key" => "PASSWORD_RESET_ALLOWED"
        "password_reset_allowed_label.value.string_value" => "%{passwordResetAllowed}"
      }
      on_error => "no_password_reset_allowed"
    }
    if ![no_password_reset_allowed] {
      mutate {
        merge => {
          "additional.fields" => "password_reset_allowed_label"
        }
        on_error => "password_reset_allowed_label_merge_failed"
      }
    }
  }
  if [nonExpiringPassword] != "" {
    mutate {
      replace => {
        "non_expiring_password_label.key" => "NON_EXPIRING_PASSWORD"
        "non_expiring_password_label.value.string_value" => "%{nonExpiringPassword}"
      }
      on_error => "no_non_expiring_password"
    }
    if ![no_non_expiring_password] {
      mutate {
        merge => {
          "additional.fields" => "non_expiring_password_label"
        }
        on_error => "non_expiring_password_label_merge_failed"
      }
    }
  }
  if [customPasswordPolicy] != "" {
    mutate {
      replace => {
        "custom_password_policy_label.key" => "CUSTOM_PASSWORD_POLICY"
        "custom_password_policy_label.value.string_value" => "%{customPasswordPolicy}"
      }
      on_error => "no_custom_password_policy"
    }
    if ![no_custom_password_policy] {
      mutate {
        merge => {
          "additional.fields" => "custom_password_policy_label"
        }
        on_error => "custom_password_policy_label_merge_failed"
      }
    }
  }
  if [authSource] != "" {
    mutate {
      replace => {
        "auth_source_label.key" => "AUTH_SOURCE"
        "auth_source_label.value.string_value" => "%{authSource}"
      }
      on_error => "no_auth_source"
    }
    if ![no_auth_source] {
      mutate {
        merge => {
          "additional.fields" => "auth_source_label"
        }
        on_error => "auth_source_label_merge_failed"
      }
    }
  }
  if [request] != "" {
    grok{
      match => {
        "request"=> ["%{DATA:request_method}\\s%{DATA:target_url}\\s"]
      }
      on_error => "malformed_request"
      overwrite => ["request_method", "target_url"]
    }
  }
  if [target_url] != "" {
    mutate {
      replace => {
        "target.url" => "%{target_url}"
      }
      on_error => "no_target_url"
    }
  }
  if [request_method] != "" {
    mutate {
      uppercase => ["request_method"]
    }
    mutate {
      replace => {
        "network.http.method" => "%{request_method}"
      }
      on_error => "no_method"
    }
    mutate {
      replace => {
        "network.application_protocol" => "HTTP"
      }
    }
  }
  if [referral_url] not in ["", "-"] {
    mutate {
      replace => {
        "network.http.referral_url" => "%{referral_url}"
      }
      on_error => "no_referral_url"
    }
  }
  if [user_agent] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{user_agent}"
      }
      on_error => "no_user_agent"
    }
    mutate {
      convert => {
        "user_agent" => "parseduseragent"
      }
      on_error => "user_agent_con_failed"
    }
    if ![user_agent_con_failed] {
      mutate {
        rename => {
          "user_agent" => "network.http.parsed_user_agent"
        }
      }
    }
  }
  if [bytes_resp] not in ["", "-1"] {
    mutate {
      convert => {
        "bytes_resp" => "uinteger"
      }
      on_error => "bytes_resp_convert_error"
    }
    if ![bytes_resp_convert_error] {
      mutate {
        rename => {
          "bytes_resp" => "network.received_bytes"
        }
      }
    }
  }
  if [host] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{host}"
        "has_target" => "true"
      }
      on_error => "no_host"
    }
  }
  if [target_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "target_ip"
        "target.asset.ip" => "target_ip"
      }
      replace => {
        "has_target" => "true"
      }
      on_error => "no_target_ip"
    }
  }
  if ![no_i_hostname] and [i_hostname] != "" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{data.properties._hostname.str}"
      }
      on_error => "no_i_hostname"
    }
  }
  else if ![no_intermediary_hostname] and [intermediary_hostname] != "" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{intermediary_hostname}"
      }
      on_error => "no_second_intermediary_hostname"
    }
  }
  if [type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{type}"
      }
      on_error => "no_type"
    }
  }
  if [orden] != "" {
    mutate {
      replace => {
        "orden_label.value.string_value" => "%{orden}"
        "orden_label.key" => "ORDEN"
      }
      on_error => "no_orden"
    }
    mutate {
      merge => {
        "additional.fields" => "orden_label"
      }
      on_error => "no_orden"
    }
  }
  mutate {
    replace => {
      "temp_data" => "%{JUNCTION}"
    }
    on_error => "no_junction"
  }
  if ![no_junction] and [temp_data] != "" {
    mutate {
      replace => {
        "junction_label.value.string_value" => "%{JUNCTION}"
        "junction_label.key" => "JUNCTION"
      }
      on_error => "no_junction"
    }
    mutate {
      merge => {
        "additional.fields" => "junction_label"
      }
      on_error => "no_junction"
    }
  }
  mutate {
    replace => {
      "temp_data" => "%{TIEMPO_TOTAL}"
    }
    on_error => "no_tiempo_total"
  }
  if ![no_tiempo_total] and [temp_data] != "" {
    mutate {
      replace => {
        "tiempo_total_label.value.string_value" => "%{TIEMPO_TOTAL}"
        "tiempo_total_label.key" => "TIEMPO_TOTAL"
      }
      on_error => "no_tiempo_total"
    }
    mutate {
      merge => {
        "additional.fields" => "tiempo_total_label"
      }
      on_error => "no_tiempo_total"
    }
  }
  mutate {
    replace => {
      "temp_data" => "%{TLS}"
    }
    on_error => "no_tls"
  }
  if [temp_data] not in [ "", " "] {
    mutate {
      replace => {
        "network.tls.version" => "%{temp_data}"
      }
      on_error => "no_tls"
    }
  }
  if [URI] != "" {
    grok {
      match => {
        "URI" => "%{WORD:http_method} %{NOTSPACE:http_uri} HTTP/%{NOTSPACE:http_version}"
      }
      on_error => "uri_parse_error"
      overwrite => ["http_version", "http_uri", "http_method"]
    }
  }
  if [http_method] != "" {
    mutate {
      replace => {
        "network.http.method" => "%{http_method}"
      }
      on_error => "http_method_replace_error"
    }
  }
  if [http_version] != "" {
    mutate {
      replace => {
        "http_version_label.value.string_value" => "%{http_version}"
        "http_version_label.key" => "HTTP_VERSION"
      }
      on_error => "http_version_does_not_exist"
    }
    mutate {
      merge => {
        "additional.fields" => "http_version_label"
      }
      on_error => "http_version_label_merge_failed"
    }
  }
  if [http_uri] != "" {
    mutate {
      replace => {
        "http_uri_label.value.string_value" => "%{http_uri}"
        "http_uri_label.key" => "HTTP_URI"
      }
      on_error => "http_uri_does_not_exist"
    }
    mutate {
      merge => {
        "additional.fields" => "http_uri_label"
      }
      on_error => "http_uri_label_merge_failed"
    }
  }
  if [caca] != "" {
    mutate {
      replace => {
        "caca_label.key" => "caca"
        "caca_label.value.string_value" => "%{caca}"
      }
      on_error => "caca_not_found"
    }
    if ![caca_not_found] {
      mutate {
        merge => {
          "additional.fields" => "caca_label"
        }
        on_error => "caca_label_merge_failed"
      }
    }
  }
  if [logtype] != "" {
    mutate {
      replace => {
        "logtype_label.key" => "logtype"
        "logtype_label.value.string_value" => "%{logtype}"
      }
      on_error => "logtype_not_found"
    }
    if ![logtype_not_found] {
      mutate {
        merge => {
          "additional.fields" => "logtype_label"
        }
        on_error => "logtype_label_merge_failed"
      }
    }
  }
  mutate {
    replace => {
      "version" => "%{@version}"
    }
    on_error => "version_is_empty"
  }
  if [version] != "" {
    mutate {
      replace => {
        "version_label.key" => "at_version"
        "version_label.value.string_value" => "%{version}"
      }
      on_error => "version_not_found"
    }
    if ![version_not_found] {
      mutate {
        merge => {
          "additional.fields" => "version_label"
        }
        on_error => "version_label_merge_failed"
      }
    }
  }
  mutate {
    replace => {
      "temp_data" => "%{instancia}"
    }
    on_error => "no_instancia"
  }
  if ![no_instancia] and [temp_data] != "" {
    mutate {
      replace => {
        "target.resource.name" => "%{instancia}"
      }
      on_error => "no_instancia"
    }
  }

  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "IBM"
      "metadata.product_name" => "Webseal"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

