# Product: AWS Redshift
# Category: AWS
# Supported Format: JSON + CSV + SYSLOG
# Last Updated: 2025-04-16
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "event" => ""
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "security_result" => ""
      "accountID" => ""
      "ClusterIdentifier" => ""
      "expectedBucket" => ""
      "expectedS3Prefix" => ""
      "file" => ""
      "func" => ""
      "level" => ""
      "lpclagg" => ""
      "lpcltype" => ""
      "msg" => ""
      "region" => ""
      "requestID" => ""
      "log_event.src_ip" => ""
      "has_user" => ""
      "has_principal" => ""
      "has_target_resource" => ""
      "records" => ""
    }
  }
  mutate {
    gsub => ["message","\\\\n\\'","#'"]
  }

  mutate {
    gsub => ["message", '\\\\"','\"']
  }
  mutate {
    gsub => ["message",'\"\\\{','{']
  }
  mutate {
    gsub => ["message","\\r\\n",""]
  }
    mutate {
    gsub => ["message"," \\\\n"," #"]
  }
  mutate {
    gsub => ["message", "\\\\n",""]
  }
  mutate {
    gsub => ["message",'\\}\"','}']
  }
  mutate {
    gsub => ["message","event","log_event"]
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "message_json_error"
  }
  if [message_json_error] {
    mutate {
      gsub => ["message",'\\\"','$']
    }
     mutate {
      gsub => ["message","#","\",\""]
    }
    mutate {
      replace => {
        "json_data" => "{\"records\":[\"%{message}\"]}"
      }
      on_error => "not_json1"
    }
    json {
      source         => "json_data"
      array_function => "split_columns"
      on_error       => "not_json1"
    }
  }
  if [records] != "" {
    for record in records {
      mutate {
        replace => {
          "event" => ""
          "principal" => ""
          "target" => ""
          "metadata" => ""
          "network" => ""
          "security_result" => ""
          "has_user" => ""
          "has_principal" => ""
          "timestamp" => ""
          "time_zone" => ""
          "kv_data" => ""
          "sql_query" => ""
          "db" => ""
          "user" => ""
          "pid" => ""
          "user_id" => ""
          "xid" => ""
          "time_zone_label" => ""
          "time_zone_empty" => ""
          "time_zone_label_empty" => ""
          "sql_query_label" => ""
          "sql_query_empty" => ""
          "sql_query_label_empty" => ""
          "column1" => ""
          "column2" => ""
          "column3" => ""
          "column4" => ""
          "column5" => ""
          "column6" => ""
          "column7" => ""
          "column8" => ""
          "column9" => ""
          "column10" => ""
          "column11" => ""
          "column12" => ""
          "column13" => ""
          "column14" => ""
          "column15" => ""
          "column16" => ""
          "column17" => ""
          "column18" => ""
          "column19" => ""
          "column20" => ""
          "column21" => ""
          "column22" => ""
          "authmethod_label" => ""
          "authmethod_empty" => ""
          "authmethod_label_empty" => ""
          "mtu_label" => ""
          "mtu_empty" => ""
          "mtu_label_empty" => ""
          "ssl_compression_label" => ""
          "ssl_compression_empty" => ""
          "ssl_compression_label_empty" => ""
          "ssl_expansion_label" => ""
          "ssl_expansion_empty" => ""
          "ssl_expansion_label_empty" => ""
          "iamauthguid_label" => ""
          "iamauthguid_empty" => ""
          "iamauthguid_label_empty" => ""
          "driver_version_label" => ""
          "driver_version_empty" => ""
          "driver_version_label_empty" => ""
          "plugin_name_label" => ""
          "plugin_name_empty" => ""
          "plugin_name_label_empty" => ""
          "compression_label" => ""
          "compression_empty" => ""
          "compression_label_empty" => ""
        }
      }
      mutate {
        gsub => ["record", '\\$','\"']
      }
      grok {
        match => {
          "record" => "\\'%{TIMESTAMP_ISO8601:timestamp} %{DATA:time_zone} \\[%{GREEDYDATA:kv_data}\\]\\' LOG:%{GREEDYDATA:sql_query}"
        }
      overwrite => ["timestamp", "time_zone", "kv_data", "sql_query"]
      on_error => "grok_error"
      }
      if [grok_error] {
        mutate {
          gsub => ["record", '(\\\s+)\\|','|']
        }
        csv {
          source => "record"
          separator => "|"
          on_error => "csv_failure"
        }
        if ![csv_failure] {
          mutate {
            gsub => ["column1", "\\'",""]
          }
          if [column1] not in ["", " "] {
            mutate {
              replace => {
                "metadata.product_event_type" => "%{column1}"
              }
              on_error => "column1_empty"
            }
          }
          if [column2] not in ["", " "] {
            mutate {
              rename => {
                "column2" => "timestamp"
              }
              on_error => "column2_empty"
            }
          }
          if [column3] not in ["", " "] {
            grok {
              match => {
                "column3" => "%{IP:column3}"
              }
              overwrite => ["column3"]
              on_error => "grok_error"
            }
            if ![grok_error] {
              mutate {
                merge => {
                  "principal.ip" => "column3"
                  "principal.asset.ip" => "column3"
                }
                on_error => "column3_empty"
              }
              if ![column3_empty] {
                mutate {
                  replace => {
                    "has_principal" => "true"
                  }
                }
              }
            }
            else {
              mutate {
                replace => {
                  "principal.hostname" => "%{column3}"
                  "has_principal" => "true"
                }
                on_error => "column3_empty"
              }
            }
          }
          if [column4] not in ["", " "] {
            grok {
              match => {
                "column4" => "%{HOSTPORT:column4}"
              }
              overwrite => ["column4"]
              on_error => "grok_error_port"
            }
            if ![grok_error_port] {
              mutate {
                replace => {
                  "principal.port" => "%{column4}"
                }
                on_error => "column4_empty"
              }
               mutate {
                convert => {
                  "principal.port" => "integer"
                }
                on_error => "column4_convert_error"
              }
            }
          }
          if [column5] not in ["", " "] {
            mutate {
              replace => {
                "principal.process.pid" => "%{column5}"
              }
              on_error => "column5_empty"
            }
          }
          if [column6] not in ["", " "] {
            mutate {
              replace => {
                "target.resource.name" => "%{column6}"
                "has_target_resource" => "true"
              }
              on_error => "no_db"
            }
            mutate {
              replace => {
                "target.resource.type" => "DATABASE"
              }
            }
          }
          if [column7] not in ["", " "] {
            grok {
              match => {
                "column7" => "%{USERNAME:column7}"
              }
              overwrite => ["column7"]
              on_error => "grok_error"
            }
            mutate {
              replace => {
                "target.user.user_display_name" => "%{column7}"
                "has_user" => "true"
              }
              on_error => "no_user"
            }
          }
          if [column8] not in ["", " "] {
            mutate {
              replace => {
                "authmethod_label.key" => "authmethod"
                "authmethod_label.value" => "%{column8}"
              }
              on_error => "authmethod_empty"
            }
            if ![authmethod_empty] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "authmethod_label"
                }
                on_error => "authmethod_label_empty"
              }
            }
          }
          if [column9] not in ["", "0"] {
            mutate {
              convert => {
                "column9" => "integer"
              }
              on_error => "conversion_error"
            }
            if ![conversion_error] {
              mutate {
                rename => {
                  "column9" => "network.session_duration.seconds"
                }
                on_error => "duration_not_found"
              }
            }
          }
          if [column10] not in ["", " "] {
            mutate {
              replace => {
                "network.tls.version" => "%{column10}"
              }
              on_error => "column10_empty"
            }
          }
          if [column11] not in ["", " "] {
            mutate {
              replace => {
                "network.tls.cipher" => "%{column11}"
              }
              on_error => "column11_empty"
            }
          }
          if [column12] not in ["", " ", "0"] {
            mutate {
              replace => {
                "mtu_label.key" => "mtu"
                "mtu_label.value" => "%{column12}"
              }
              on_error => "mtu_empty"
            }
            if ![mtu_empty] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "mtu_label"
                }
                on_error => "mtu_label_empty"
              }
            }
          }
          if [column13] not in ["", " "] {
            mutate {
              replace => {
                "ssl_compression_label.key" => "ssl_compression"
                "ssl_compression_label.value" => "%{column13}"
              }
              on_error => "ssl_compression_empty"
            }
            if ![ssl_compression_empty] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "ssl_compression_label"
                }
                on_error => "ssl_compression_label_empty"
              }
            }
          }
          if [column14] not in ["", " "] {
            mutate {
              replace => {
                "ssl_expansion_label.key" => "ssl_expansion"
                "ssl_expansion_label.value" => "%{column14}"
              }
              on_error => "ssl_expansion_empty"
            }
            if ![ssl_expansion_empty] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "ssl_expansion_label"
                }
                on_error => "ssl_expansion_label_empty"
              }
            }
          }
          if [column15] not in ["", " "] {
            mutate {
              replace => {
                "iamauthguid_label.key" => "iamauthguid"
                "iamauthguid_label.value" => "%{column15}"
              }
              on_error => "iamauthguid_empty"
            }
            if ![iamauthguid_empty] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "iamauthguid_label"
                }
                on_error => "iamauthguid_label_empty"
              }
            }
          }
          if [column16] not in ["", " "] {
            mutate {
              replace => {
                "principal.application" => "%{column16}"
              }
              on_error => "column16_empty"
            }
          }
          if [column17] not in ["", " "] {
            mutate {
              replace => {
                "principal.platform_version" => "%{column17}"
              }
              on_error => "column17_empty"
            }
          }
          if [column18] not in ["", " "] {
            mutate {
              replace => {
                "driver_version_label.key" => "driver_version"
                "driver_version_label.value" => "%{column18}"
              }
              on_error => "driver_version_empty"
            }
            if ![driver_version_empty] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "driver_version_label"
                }
                on_error => "driver_version_label_empty"
              }
            }
          }
          if [column19] not in ["", " "] {
            mutate {
              replace => {
                "plugin_name_label.key" => "plugin_name"
                "plugin_name_label.value" => "%{column19}"
              }
              on_error => "plugin_name_empty"
            }
            if ![plugin_name_empty] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "plugin_name_label"
                }
                on_error => "plugin_name_label_empty"
              }
            }
          }
          if [column20] not in ["", " ", "0"] {
            mutate {
              replace => {
                "network.application_protocol_version" => "%{column20}"
              }
              on_error => "no_protocol_set"
            }
          }
          if [column21] not in ["", " "] {
            mutate {
              replace => {
                "network.session_id" => "%{column21}"
              }
              on_error => "no_session_id_set"
            }
          }
          if [column22] not in ["", " ","(null) "] {
            mutate {
              replace => {
                "compression_label.key" => "compression"
                "compression_label.value" => "%{column22}"
              }
              on_error => "no_tls_cipher_set"
            }
            if ![no_tls_cipher_set] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "compression_label"
                }
                on_error => "compression_label_empty"
              }
            }
          }
        }
      }
      else {
        kv{
          source => "kv_data"
          field_split => " "
          value_split => "="
          on_error => "kv_error"
        }
        if [time_zone] != "" {
          mutate {
            replace => {
              "time_zone_label.key" => "time_zone"
              "time_zone_label.value" => "%{time_zone}"
            }
            on_error => "time_zone_empty"
          }
          if ![time_zone_empty] {
            mutate {
              merge => {
                "target.resource.attribute.labels" => "time_zone_label"
              }
              on_error => "time_zone_label_empty"
            }
          }
          if ![time_zone_label_empty] {
            mutate {
              replace => {
                "has_target_resource" => "true"
              }
            }
          }
        }
        if [sql_query] != "" {
          mutate {
            replace => {
              "sql_query_label.key" => "sql_query"
              "sql_query_label.value" => "%{sql_query}"
            }
            on_error => "sql_query_empty"
          }
          if ![sql_query_empty] {
            mutate {
              merge => {
                "target.resource.attribute.labels" => "sql_query_label"
              }
              on_error => "sql_query_label_empty"
            }
          }
          if ![sql_query_label_empty] {
            mutate {
              replace => {
                "has_target_resource" => "true"
              }
            }
          }
        }
        if [db] != "" {
          mutate {
            replace => {
              "target.resource.name" => "%{db}"
              "has_target_resource" => "true"
            }
            on_error => "no_db"
          }
          mutate {
            replace => {
              "target.resource.type" => "DATABASE"
            }
          }
        }
        if [user] != "" {
          mutate {
            replace => {
              "target.user.user_display_name" => "%{user}"
              "has_user" => "true"
            }
            on_error => "no_user"
          }
        }
        if [pid] != "" {
          mutate {
            replace => {
              "principal.process.pid" => "%{pid}"
            }
            on_error => "pid_empty"
          }
        }
        if [user_id] != "" {
          mutate {
            replace => {
              "principal.user.userid" => "%{user_id}"
              "has_user" => "true"
            }
            on_error => "user_id_empty"
          }
        }
        if [xid] != "" {
          mutate {
            replace => {
              "network.session_id" => "%{xid}"
            }
            on_error => "xid_empty"
          }
        }
      }
      if [has_target_resource] == "true" and [has_user] == "true"  {
        mutate {
          replace => {
            "metadata.event_type" => "USER_RESOURCE_ACCESS"
          }
        }
      }
      else if [has_principal] == "true" {
        mutate {
          replace => {
            "metadata.event_type" => "STATUS_UPDATE"
          }
        }
      }
      else if [has_user] == "true" {
        mutate {
          replace => {
            "metadata.event_type" => "USER_UNCATEGORIZED"
          }
        }
      }
      else {
        mutate {
          replace => {
            "metadata.event_type" => "GENERIC_EVENT"
          }
        }
      }
      if [principal] != "" {
        mutate {
          rename => {
            "principal" => "event.idm.read_only_udm.principal"
          }
        }
      }
      if [target] != "" {
        mutate {
          rename => {
            "target" => "event.idm.read_only_udm.target"
          }
        }
      }
      if [metadata] != "" {
        mutate {
          rename => {
            "metadata" => "event.idm.read_only_udm.metadata"
          }
        }
      }
      if [network] != "" {
        mutate {
          rename => {
            "network" => "event.idm.read_only_udm.network"
          }
        }
      }
      if [security_result] != "" {
        mutate {
          merge => {
            "event.idm.read_only_udm.security_result" => "security_result"
          }
          on_error => "no_security_result"
        }
      }
      mutate {
        merge => {
          "@output" => "event"
        }
        on_error => "no_output"
      }
    }
  }
  else {
    if [accountID] != "" {
      mutate {
        replace => {
          "principal.user.userid" => "%{accountID}"
        }
        on_error => "accountID_error"
      }
      if ![accountID_error] {
        mutate {
          replace => {
            "has_user" => "true"
          }
        }
      }
    }
    if [ClusterIdentifier] != "" {
      mutate {
        replace => {
          "target.resource.name" => "%{ClusterIdentifier}"
        }
        on_error => "cluster_identifier_error"
      }
    }
    if [expectedBucket] != "" {
      mutate {
        replace => {
          "expected_bucket_label.key" => "expectedBucket"
          "expected_bucket_label.value" => "%{expectedBucket}"
        }
        on_error => "expected_bucket_error"
      }
      if ![expected_bucket_error] {
        mutate {
          merge => {
            "target.resource.attribute.labels" => "expected_bucket_label"
          }
          on_error => "expected_bucket_label_error"
        }
        mutate {
          replace => {
            "has_target_resource" => "true"
          }
        }
      }
    }
    if [expectedS3Prefix] != "" {
      mutate {
        replace => {
          "expected_s3_prefix_label.key" => "expectedS3Prefix"
          "expected_s3_prefix_label.value" => "%{expectedS3Prefix}"
        }
        on_error => "expected_s3_prefix_error"
      }
      if ![expected_s3_prefix_error] {
        mutate {
          merge => {
            "target.resource.attribute.labels" => "expected_s3_prefix_label"
          }
          on_error => "expected_s3_prefix_label_error"
        }
        mutate {
          replace => {
            "has_target_resource" => "true"
          }
        }
      }
    }
    if [file] != "" {
      mutate {
        replace => {
          "target.file.full_path" => "%{file}"
        }
        on_error => "file_error"
      }
    }
    if [func] != "" {
      mutate {
        replace => {
          "func_label.key" => "func"
          "func_label.value.string_value" => "%{func}"
        }
        on_error => "func_error"
      }
      if ![func_error] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "func_label"
          }
          on_error => "func_label_error"
        }
      }
    }
    if [log_event][src_ip] != "" {
      mutate {
        merge => {
          "principal.ip" => "log_event.src_ip"
          "principal.asset.ip" => "log_event.src_ip"
        }
        on_error => "src_ip_error"
      }
      if ![src_ip_error] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    if [level] != "" {
      if [level] =~ "(?i)Info" {
        mutate {
          replace => {
            "security_result.severity" => "INFORMATIONAL"
          }
        }
      }
      else if [level] =~ "(?i)Error" {
        mutate {
          replace => {
            "security_result.severity" => "ERROR"
          }
        }
      }
      else if [level] =~ "(?i)Warning" {
        mutate {
          replace => {
            "security_result.severity" => "MEDIUM"
          }
        }
      }
    }
    if [lpclagg] != "" {
      mutate {
        replace => {
          "lpclagg_label.key" => "lpclagg"
          "lpclagg_label.value.string_value" => "%{lpclagg}"
        }
        on_error => "lpclagg_error"
      }
      if ![lpclagg_error] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "lpclagg_label"
          }
          on_error => "lpclagg_label_error"
        }
      }
    }
    if [lpcltype] != "" {
      mutate {
        replace => {
          "lpcltype_label.key" => "lpcltype"
          "lpcltype_label.value.string_value" => "%{lpcltype}"
        }
        on_error => "lpcltype_error"
      }
      if ![lpcltype_error] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "lpcltype_label"
          }
          on_error => "lpcltype_label_error"
        }
      }
    }
    if [msg] != "" {
      mutate {
        replace => {
          "metadata.description" => "%{msg}"
        }
        on_error => "msg_error"
      }
    }
    if [region] != "" {
      mutate {
        replace => {
          "principal.location.name" => "%{region}"
        }
        on_error => "region_error"
      }
    }
    if [requestID] != "" {
      mutate {
        replace => {
          "metadata.product_log_id" => "%{requestID}"
        }
        on_error => "requestID_error"
      }
    }
    if [has_target_resource] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "USER_RESOURCE_ACCESS"
        }
      }
    }
    else if [has_principal] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }
    else if [has_user] == "true" {
      mutate {
        replace => {
          "metadata.event_type" => "USER_UNCATEGORIZED"
        }
      }
    }
    else {
      mutate {
        replace => {
          "metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
    if [principal] != "" {
      mutate {
        rename => {
          "principal" => "event.idm.read_only_udm.principal"
        }
      }
    }
    if [target] != "" {
      mutate {
        rename => {
          "target" => "event.idm.read_only_udm.target"
        }
      }
    }
    if [metadata] != "" {
      mutate {
        rename => {
          "metadata" => "event.idm.read_only_udm.metadata"
        }
      }
    }
    if [network] != "" {
      mutate {
        rename => {
          "network" => "event.idm.read_only_udm.network"
        }
      }
    }
    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
        on_error => "no_security_result"
      }
    }
    mutate {
      merge => {
        "@output" => "event"
      }
    }
  }
}
