# Product: Centrify SSO
# Category: SSO
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2022-08-10
# Copyright 2022 Chronicle LLC


filter {
  mutate {
    replace => {
      "ts" => ""
      "Factors" => ""
      "FailReason" => ""
      "FailUserName" => ""
      "FromIPAddress" => ""
      "NormalizedUser" => ""
      "RequestUserAgent" => ""
      "kvdata" => ""
      "ComputerName" => ""
      "ComputerID" => ""
      "ComputerFQDN" => ""
      "EventMessage" => ""
      "UserGuid" => ""
      "AuthorityID" => ""
      "AuthorityFQDN" => ""
      "AzDeploymentId" => ""
      "AzRoleId" => ""
      "AzRoleName" => ""
      "TokenType" => ""
      "CredentialType" => ""
      "CredentialId" => ""
      "DirectoryServiceUuid" => ""
      "DirectoryServiceName" => ""
      "DirectoryServiceNameLocalized" => ""
      "AccountID" => ""
      "pid" => ""
      "host" => ""
      "SessionGuid" => ""
      "UserType" => ""
      "ProxyId" => ""
      "Tenant" => ""
      "EventType" => ""
      "ID" => ""
      "JumpType" => ""
      "OperationMode" => ""
      "ThreadType" => ""
      "InternalTrackingID" => ""
      "WhenOccurred" => ""
      "Level" => ""
      "security_result" => ""
      "sess_id" => ""
      "msg" => ""
      "auth_type" => ""
      "user_id" => ""
      "process" => ""
     }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [not_json] {
    grok {
      match => {
        "message" => [
          "<%{INT}>%{SYSLOGTIMESTAMP:ts} (%{HOSTNAME:host} .*\\[%{INT:pid}\]: (.*\\| %{GREEDYDATA:kvdata}|%{GREEDYDATA:msg})?|%{HOSTNAME:host})?"
        ]
      }
      overwrite => ["msg" , "kvdata", "pid", "host" , "ts"]
      on_error => "grok_failure"
    }
    if [grok_failure] {
      drop {
        tag => "TAG_MALFORMED_ENCODING"
      }
    }
  }

  mutate {
    gsub => ["kvdata", "\\s(\\w+)=", "#$1="]
  }
  # Swapping the values of csLabels
  mutate {
    gsub => ["kvdata", "#cs\\d+Label=([^#]+)#cs(\\d+)=([^#]+)", "#$1=$3"]
  }

  if [kvdata] != "" {
    mutate {
      gsub => ["kvdata" , "\\\"" , "" ]
    }
    kv {
      source => "kvdata"
      value_split => "="
      field_split => "#"
      on_error => "not_kv"
    }
  }

  if [ts] != "" {
    date {
      match => ["ts", "MMM  d HH:mm:ss"]
      rebase => true
    }
  }

  if [WhenOccurred] != "" {
    mutate {
      replace => { "WhenOccurred" => "%{WhenOccurred}Z" }
    }
    mutate {
      gsub => ["WhenOccurred" , "/Date\\(|\\)/Z" , "" ]
    }
    date {
      match => ["WhenOccurred", "RFC3339", "ISO8601", "UNIX_MS"]
    }
  }

  # Is this a failed login?
  if [FailReason] != "" {
    mutate {
      rename => {
        "FailReason" => "security_result.summary"
      }
      replace => {
        "Action" => "BLOCK"
        "Category" => "AUTH_VIOLATION"
      }
      merge => {
        "security_result.action" => "Action"
        "security_result.category" => "Category"
      }
    }
  }

  # Extract the user agent (for web-based logins).
  if [RequestUserAgent] != "" {
    mutate {
      rename => {
        "RequestUserAgent" => "event.idm.read_only_udm.network.http.user_agent"
      }
    }
  }

  # Extract the severity level.
  if [Level] == "Info" {
    mutate {
      replace => {
        "Action" => "ALLOW"
        "security_result.severity" => "INFORMATIONAL"
      }
      merge => {
        "security_result.action" => "Action"
      }
    }
  } else if [Level] == "Warning" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
    }
  } else if [Level] == "Error" {
    mutate {
      replace => {
        "security_result.severity" => "ERROR"
      }
    }
  }

  # Extract the authentication mechanisms that were used.
  if [Factors] =~ /UP/ {
    mutate {
      replace => {
        "mechanism" => "USERNAME_PASSWORD"
      }
      merge => {
        "event.idm.read_only_udm.extensions.auth.mechanism" => "mechanism"
      }
    }
  }

  if [Factors] =~ /OTP/ or [Factors] =~ /OATH/ {
    mutate {
      replace => {
        "mechanism" => "OTP"
      }
      merge => {
        "event.idm.read_only_udm.extensions.auth.mechanism" => "mechanism"
      }
    }
  }

  if [Factors] =~ /U2F/ {
    mutate {
      replace => {
        "mechanism" => "HARDWARE_KEY"
      }
      merge => {
        "event.idm.read_only_udm.extensions.auth.mechanism" => "mechanism"
      }
    }
  }

  # Only create 'principal' if FromIPAddress is present.
  if [FromIPAddress] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "FromIPAddress"
      }
    }
  }

  if [message] != "" {
    grok {
      match => {
        "message" => [
           ".*%{WORD:process}\\[.* %{INT:sess_id}.* user %{WORD:user_id}.*",
           ".* %{INT:sess_id}"
        ]
      }
      overwrite => ["sess_id", "user_id", "process"]
      on_error => "pattern_failure"
    }
    if [sess_id] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.session_id" => "%{sess_id}"
        }
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{msg}"
      }
    }
    if [user_id] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{user_id}"
        }
      }
    }
    if [process] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.product_event_type" => "%{process}"
        }
      }
    }
  }

  if [EventType] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{EventType}"
      }
    }
  }
  if [pid] != "" {
    mutate{
      replace => {
        "event.idm.read_only_udm.principal.process.pid" => "%{pid}"
      }
    }
  }
  if [host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{host}"
      }
    }
  }

  if [SessionGuid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{SessionGuid}"
      }
    }
  }

  if [UserType] != "" {
    mutate {
      replace => {
        "principal_role_name.name" => "%{UserType}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.user.attribute.roles" => "principal_role_name"
      }
    }
  }

  if [AzRoleName] != "" {
    mutate {
      replace => {
        "target_role_name.name" => "%{AzRoleName}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.user.attribute.roles" => "target_role_name"
      }
    }
  }

  if [CredentialType] != "" {
    if [CredentialType] == "SshKey" {
      mutate {
        replace => {
          "auth_type" => "NETWORK"
        }
      }
    }
    else if [CredentialType] == "Password" {
      mutate {
        replace => {
          "auth_type" => "USERNAME_PASSWORD"
        }
      }
    }
    if [auth_type] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.extensions.auth.mechanism" => "auth_type"
        }
      }
    }
  }

  if [UserGuid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{UserGuid}"
      }
    }
  }

  if [ComputerID] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.asset_id" => "ComputerId:%{ComputerID}"
      }
    }
  }
  if [ComputerName] != "" {
    mutate {
      replace => {
        "about.hostname" => "%{ComputerName}"
      }
      merge => {
        "event.idm.read_only_udm.about" => "about"
      }
    }
  }
  if [ComputerFQDN] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.network_domain" => "%{ComputerFQDN}"
      }
    }
  }

  if [AuthorityID] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.asset.asset_id" => "AuthorityID:%{AuthorityID}"
      }
    }
  }

  if [AuthorityFQDN] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.asset.network_domain" => "%{AuthorityFQDN}"
      }
    }
  }

  if [InternalTrackingID] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{InternalTrackingID}"
      }
    }
  }

  if [EventMessage] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{EventMessage}"
      }
    }
  }

  if [CredentialId] != "" {
    mutate {
      replace => {
        "credential_type_field.key" => "Credential Id"
        "credential_type_field.value" => "%{CredentialId}"
      }
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "credential_type_field"
      }
    }
  }

  if [ProxyId] != "" {
    mutate {
      replace => {
        "proxy_id_field.key" => "Proxy Id"
        "proxy_id_field.value" => "%{ProxyId}"
      }
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "proxy_id_field"
      }
    }
  }

  if [DirectoryServiceUuid] != "" {
    mutate {
      replace => {
        "directory_service_id_field.key" => "Directory Service Uuid"
        "directory_service_id_field.value" => "%{DirectoryServiceUuid}"
      }
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "directory_service_id_field"
      }
    }
  }

  if [AzDeploymentId] != "" {
    mutate {
      replace => {
        "deployment_id_field.key" => "AzDeploymentId"
        "directory_service_id_field.value" => "%{AzDeploymentId}"
      }
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "directory_service_id_field"
      }
    }
  }

  if [ID] != "" {
    mutate {
      replace => {
        "id_field.key" => "ID"
        "id_field.value" => "%{ID}"
      }
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "id_field"
      }
    }
  }

  if [AccountID] != "" {
    mutate {
      replace => {
        "account_id_field.key" => "Account ID"
        "account_id_field.value" => "%{AccountID}"
      }
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "account_id_field"
      }
    }
  }

  if [DirectoryServiceName] != "" {
    mutate {
      replace => {
        "directory_service_name_field.key" => "Directory Service Name"
        "directory_service_name_field.value" => "%{DirectoryServiceName}"
      }
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "directory_service_name_field"
      }
    }
  }

  if [DirectoryServiceNameLocalized] != "" {
    mutate {
      replace => {
        "directory_service_name_local_field.key" => "Directory Service Name Localized"
        "directory_service_name_local_field.value" => "%{DirectoryServiceNameLocalized}"
      }
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "directory_service_name_local_field"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [Tenant] != "" {
    mutate {
      replace => {
        "tenant_label.key" => "Tenant"
        "tenant_label.value.string_value" => "%{Tenant}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "tenant_label"
      }
    }
  }

  if [JumpType] != "" {
    mutate {
      replace => {
        "jump_type_label.key" => "Jump Type"
        "jump_type_label.value.string_value" => "%{JumpType}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "jump_type_label"
      }
    }
  }

  if [OperationMode] != "" {
    mutate {
      replace => {
        "operation_mode.key" => "Operation Mode"
        "operation_mode.value.string_value" => "%{OperationMode}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "operation_mode"
      }
    }
  }

  if [ThreadType] != "" {
    mutate {
      replace => {
        "thread_type_label.key" => "Thread Type"
        "thread_type_label.value.string_value" => "%{ThreadType}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "thread_type_label"
      }
    }
  }

  if [AzRoleId] != "" {
    mutate {
      replace => {
        "az_role_id_label.key" => "AzRole Id"
        "az_role_id_label.value.string_value" => "%{AzRoleId}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "az_role_id_label"
      }
    }
  }

  if [TokenType] != "" {
    mutate {
      replace => {
        "token_type_label.key" => "TokenType"
        "token_type_label.value.string_value" => "%{TokenType}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "token_type_label"
      }
    }
  }

  # Populate remaining fields.
  if [NormalizedUser] != "" and [NormalizedUser] =~ "^.+@.+$" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.user.email_addresses" => "NormalizedUser"
      }
    }
  }
  mutate {
    rename => {
      "ApplicationName" => "event.idm.read_only_udm.target.application"
    }
    replace => {
      "event.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
      "event.idm.read_only_udm.extensions.auth.type" => "SSO"
      "event.idm.read_only_udm.metadata.vendor_name" => "Centrify"
      "event.idm.read_only_udm.metadata.product_name" => "SSO"
    }
  }

  if [EventType] == "Cloud.Core.OAuthToken.Create"{
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_CREATION"
      }
    }
  }
  if [EventType] == "Cloud.Server.LocalAccount.SessionStart"{
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_RESOURCE_ACCESS"
      }
    }
  }
  if [EventType] == "Cloud.Core.Login"{
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
      }
    }
  }
  if [EventType] == "Cloud.Server.LocalAccount.SessionDisconnect"{
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_LOGOUT"
      }
    }
  }
  if [EventType] == "Cloud.Server.DomainAccount.PasswordChange"{
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_CHANGE_PASSWORD"
      }
    }
  }
  if [EventType] == "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  # If "FailUserName" is not empty, use it as the target email address.
  # Some, but not all, failure events set the target email address in
  # "FailUserName" instead of "NormalizedUser".
  if [FailUserName] != "" and [FailUserName] =~ "^.+@.+$"  {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.user.email_addresses" => "FailUserName"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
