# Product: RIPPLING_ACTIVITYLOGS
# Category: ACTIVITY_LOGS
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2024-08-01
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "data" => ""
      "data.request_data" => ""
    }
  }

  mutate {
    replace => {
      "message" => "{\"messages\":%{message}}"
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "invalid_json"
  }

  if [invalid_json] {
    drop{
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  else {
    for data in messages {
      mutate {
        replace => {
          "prop_id" => ""
          "event" => ""
          "deviceName" => ""
          "finger_label" => ""
          "subjects" => ""
          "timestamp" => ""
          "status" => ""
          "search_string" => ""
          "linked_events" => ""
          "linked_attribute_events" => ""
          "linked_behaviour_events" => ""
          "linked_behaviour_events_cache" => ""
          "linked_events_key" => ""
          "processing_state" => ""
          "_subject_role_name_cache" => ""
          "_subject_group_name_cache" => ""
          "company" => ""
          "spoke" => ""
          "owner" => ""
          "subject_group" => ""
          "subject_role" => ""
          "subject_spoke_user" => ""
          "subject_device" => ""
          "upstream_event" => ""
          "initiator" => ""
          "event_reason" => ""
          "name" => ""
          "event_type" => "GENERIC_EVENT"
          "principal" => ""
          "security_result" => ""
          "target" => ""
          "network" => ""
          "metadata" => ""
          "additional" => ""
          "src" => ""
          "has_principal" => "false"
          "has_principal_userid" => "false"
          "has_userid" => "false"
          "has_target" => "false"
          "device" => ""
          "geo_latitude" => ""
          "geo_longitude" => ""
          "ar_value" => ""
          "company_label" => ""
          "owner_label" => ""
          "processing_state_label" => ""
          "spoke_label" => ""
          "linked_events_key_label" => ""
          "accuracy_radius_label" => ""
          "subject_version_label" => ""
          "ano_value" => ""
          "emailid" => ""
        }
      }

      mutate {
        replace => {
          "prop_id" => "%{data.id}"
        }
      on_error => "prop_id_invalid"
      }
      if [prop_id] != "" {
        mutate {
          replace => {
            "metadata.product_log_id" => "%{prop_id}"
          }
          on_error => "id_invalid"
        }
      }

      mutate {
        replace => {
          "deviceName" => "%{data.request_data.device}"
        }
        on_error => "deviceName_invalid"
      }
      if [deviceName] == "Mac" {
        mutate {
          replace => {
            "src.platform" => "MAC"
          }
          on_error => "request_data_device_invalid"
        }
      }

      mutate {
        replace => {
          "src.platform_version" => "%{data.request_data.os}"
        }
        on_error => "request_data_os_invalid"
      }

      mutate {
        merge => {
          "target.ip" => "data.request_data.ip"
          "target.asset.ip" => "data.request_data.ip"
        }
        on_error => "request_data_ip_invalid"
      }
      if ![request_data_ip_invalid] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }

      mutate {
        convert => {
          "data.request_data.longitude" => "string"
        }
        on_error => "data_convert_invalid"
      }

      mutate {
        convert => {
          "data.request_data.latitude" => "string"
        }
        on_error => "data_convert_invalid"
      }

      mutate {
        replace => {
          "geo_latitude" => "%{data.request_data.latitude}"
        }
        on_error => "data_convert_invalid_"
      }

      mutate {
        replace => {
          "geo_longitude" => "%{data.request_data.longitude}"
        }
        on_error => "data_convert_invalid_"
      }

      if [geo_latitude] != "" {
        mutate {
          rename => {
            "geo_latitude" => "target.location.region_latitude"
          }
          on_error => "data_convert_invalid_map"
        }
      }

      if [geo_longitude] != "" {
        mutate {
          rename => {
            "geo_longitude" => "target.location.region_longitude"
          }
          on_error => "data_convert_invalid_map_"
        }
      }

      mutate {
        convert => {
          "target.location.region_longitude" => "float"
        }
        on_error => "data_convert_invalid_map_"
      }

      mutate {
        convert => {
          "target.location.region_latitude" => "float"
        }
        on_error => "data_convert_invalid_map_"
      }

      mutate {
        replace => {
          "target.location.city" => "%{data.request_data.city}"
        }
        on_error => "invalid_city"
      }

      mutate {
        replace => {
          "target.location.country_or_region" => "%{data.request_data.country}"
        }
        on_error => "invalid_country"
      }

      mutate {
        replace => {
          "target.location.state" => "%{data.request_data.state}"
        }
        on_error => "invalid_state"
      }

      mutate {
        replace => {
          "network.http.method" =>
          "%{data.request_data.authentication_context.mfa_method}"
        }
        on_error => "mfa_method_invalid"
      }

      mutate {
        replace => {
          "network.http.user_agent" =>
          "%{data.request_data.authentication_context.login_agent}"
        }
        on_error => "login_agent_invalid"
      }

      mutate {
        replace => {
          "network.email.mail_id" =>
          "%{data.request_data.authentication_context.login_username}"
        }
        on_error => "email_invalid"
      }

      mutate {
        replace => {
          "principal.user.role_name" => "%{data._subject_role_name_cache}"
          "has_principal_userid" => "true"
        }
        on_error => "subject_role_name_cache_invalid"
      }

      mutate {
        merge => {
          "principal.user.group_identifiers" => "data._subject_group_name_cache"
          "has_principal_user" => "true"
        }
        on_error => "subject_group_name_cache_invalid"
      }

      if [data][initiator] != "" {
        mutate {
          replace => {
            "principal.hostname" => "%{data.initiator.display_name}"
            "principal.asset.hostname" => "%{data.initiator.display_name}"
          }
          on_error => "initiator_invalid"
        }

        mutate {
          replace => {
            "emailid" => "%{data.initiator.email}"
          }
          on_error => "initiator_email_invalid_"
        }

        if [emailid] =~ "^.+@.+$" {
          mutate {
            merge => {
              "principal.user.email_addresses" => "data.initiator.email"
            }
            on_error => "initiator_email_invalid"
          }
        }

        mutate {
          replace => {
            "principal.user.userid" => "%{data.initiator.role}"
            "has_principal_userid" => "true"
            "has_userid" => "true"
          }
          on_error => "initiator_role_invalid"
        }

        mutate {
          replace => {
            "principal.url" => "%{data.initiator.icon}"
          }
          on_error => "initiator_icon_invalid"
        }
      }

      for subjects in data.subjects {
        mutate {
          replace => {
            "principal.user.userid" => "%{subjects.instance}"
            "has_principal_userid" => "true"
            "has_userid" => "true"
          }
          on_error => "subjects_instance_invalid"
        }
        mutate {
          replace => {
            "principal.url" => "%{subjects.icon}"
          }
          on_error => "subjects_display_name_invalid"
        }
        mutate {
          replace => {
            "principal.hostname" => "%{subjects.display_name}"
            "principal.asset.hostname" => "%{subjects.display_name}"
            "has_principal" => "true"
          }
          on_error => "subjects_display_name_invalid"
        }
      }

      if [data][initiator][display_name] == "System" && [search_string] != "" {
        mutate {
          replace => {
            "principal.hostname" => "%{data.search_string}"
            "principal.asset.hostname" => "%{data.search_string}"
            "has_principal" => "true"
          }
        }
      }

      if [has_userid] == "false"  {
        mutate {
          replace => {
            "principal.user.userid" => "%{data.subject_group}"
            "has_principal_userid" => "true"
            "has_userid" => "true"
          }
          on_error => "subject_group_invalid"
        }
      }

      mutate {
        convert => {
          "data.request_data.accuracy_radius" => "string"
        }
      }

      mutate {
        replace => {
          "finger_label.value.string_value" =>
          "%{data.request_data.device_fingerprint}"
        }
        on_error => "finger_label_empty"
      }
      if [finger_label] != "" {
        mutate {
          replace => {
            "finger_label.key" => "device_fingerprint"
          }
        }
        mutate {
          merge => {
            "additional.fields" => "finger_label"
          }
          on_error => "finger_label_empty_"
        }
      }

      mutate {
        replace => {
          "owner_label.value.string_value" => "%{data.owner}"
        }
        on_error => "owner_empty"
      }
      if [owner_label] != "" {
        mutate {
          replace => {
            "owner_label.key" => "owner"
          }
        }
        mutate {
          merge => {
            "additional.fields" => "owner_label"
          }
          on_error => "owner_label_empty"
        }
      }

      mutate {
        replace => {
          "company_label.value.string_value" => "%{data.company}"
        }
        on_error => "company_empty"
      }
      if ![company_empty] {
        mutate {
          replace => {
            "company_label.key" => "company"
          }
        }
        mutate {
          merge => {
            "additional.fields" => "company_label"
          }
          on_error => "company_label_empty"
        }
      }

      mutate {
        replace => {
          "spoke_label.value.string_value" => "%{data.spoke}"
        }
        on_error => "spoke_empty"
      }
      if [spoke_label] != "" {
        mutate {
          replace => {
            "spoke_label.key" => "spoke"
          }
        }
        mutate {
          merge => {
            "additional.fields" => "spoke_label"
          }
          on_error => "spoke_label_empty"
        }
      }

      mutate {
        replace => {
          "processing_state_label.value.string_value" =>
          "%{data.processing_state}"
        }
        on_error => "processing_state_empty"
      }
      if ![processing_state_empty] {
        mutate {
          replace => {
            "processing_state_label.key" => "processing_state"
          }
        }
        mutate {
          merge => {
            "additional.fields" => "processing_state_label"
          }
          on_error => "processing_state_label_empty"
        }
      }

      mutate {
        replace => {
          "accuracy_radius_label.value.string_value" =>
          "%{data.request_data.accuracy_radius}"
        }
        on_error => "accuracy_radius_empty"
      }
      if [accuracy_radius_label] != "" {
        mutate {
          replace => {
            "accuracy_radius_label.key" => "accuracy_radius"
          }
        }
        mutate {
          merge => {
            "additional.fields" => "accuracy_radius_label"
          }
          on_error => "accuracy_radius_label_empty"
        }
      }

      mutate {
        replace => {
         "subject_version_label.value.string_value" => "%{data.subject_version}"
        }
        on_error => "subject_version_empty"
      }
      if ![subject_version_empty] {
        mutate {
          replace => {
            "subject_version_label.key" => "subject_version"
          }
        }
        mutate {
          merge => {
            "additional.fields" => "subject_version_label"
          }
          on_error => "subject_version_label_empty"
        }
      }

      mutate {
        replace => {
          "linked_events_key_label.value.string_value" =>
          "%{data.linked_events_key}"
        }
        on_error => "linked_events_key_empty"
      }
      if ![linked_events_key_empty] {
        mutate {
          replace => {
            "linked_events_key_label.key" => "linked_events_key"
          }
        }
        mutate {
          merge => {
            "additional.fields" => "linked_events_key_label"
          }
          on_error => "linked_events_key_label_empty_"
        }
      }

      mutate {
        merge => {
          "security_result.category_details" => "data.event_reason.reason"
        }
        on_error => "event_reason_invalid"
      }
      mutate {
        replace => {
          "security_result.summary" => "%{data.event_reason.message}"
        }
        on_error => "event_reason_message_invalid"
      }

      if [data][event_type] == "GROUP_ACCESS_CHANGED" {
        if [has_principal] == "true" {
          mutate {
            replace => {
              "event_type" => "STATUS_UPDATE"
            }
          }
        }
        else if [has_principal_userid] == "true" && [has_target] == "true" {
          mutate {
            replace => {
              "event_type" => "GROUP_MODIFICATION"
            }
          }
        }
      }
      else if [data][event_type] == "USER_LOGIN_SUCCESS" {
        if [has_target] == "true" {
          mutate {
            replace => {
              "event.idm.read_only_udm.extensions.auth.type" => "PHYSICAL"
            }
          }
          mutate {
            replace => {
              "event_type" => "USER_LOGIN"
            }
          }
        }
      }
      else if [data][event_type] == "ACCESS_TOKEN_EXPIRED" {
        if [has_target] == "true" {
          mutate {
            replace => {
              "event.idm.read_only_udm.extensions.auth.type" => "PHYSICAL"
            }
          }
          mutate {
            replace => {
              "event_type" => "USER_LOGOUT"
            }
          }
        }
      }
      else if [data][event_type] in ["EMAIL_VERIFICATION_INITIATED" ,
      "PHONE_VERIFICATION_INITIATED" , "BEHAVIOUR_DETECTION_TEST" ,
      "TWO_FACTOR_CHECK_SUCCESS" ] {
        mutate {
          replace => {
            "event_type" => "STATUS_UPDATE"
          }
        }
      }
      else if [data][event_type] == "SCHEDULED_CHANGE_CREATED" {
        mutate {
          replace => {
            "target.resource.resource_type" => "TASK"
            "event_type" => "SCHEDULED_TASK_MODIFICATION"
          }
        }
      }
      else {
        mutate {
          replace => {
            "event_type" => "GENERIC_EVENT"
          }
        }
      }

      mutate {
        replace => {
          "metadata.vendor_name" => "RIPPLING_ACTIVITYLOGS"
          "metadata.product_name" => "RIPPLING_ACTIVITYLOGS"
          "metadata.product_event_type" => "%{name}"
        }
      }

      if [event_type] != "" {
        mutate {
          replace => {
            "metadata.event_type" => "%{event_type}"
          }
          on_error => "event_type_invalid"
        }
      }

      if [security_result] != "" {
        mutate {
          merge => {
            "event.idm.read_only_udm.security_result" => "security_result"
          }
          on_error => "security_result_invalid"
        }
      }

      if [additional] != "" {
        mutate {
          rename => {
            "additional" => "event.idm.read_only_udm.additional"
          }
        }
      }

      if [metadata] != "" {
        mutate {
          rename => {
            "metadata" => "event.idm.read_only_udm.metadata"
          }
        }
      }

      if [principal] != "" {
        mutate {
          rename => {
            "principal" => "event.idm.read_only_udm.principal"
          }
        }
      }

      if [target] != "" {
        mutate {
          rename => {
            "target" => "event.idm.read_only_udm.target"
          }
        }
      }

      if [network] != "" {
        mutate {
          rename => {
            "network" => "event.idm.read_only_udm.network"
          }
        }
      }

      if [src] != "" {
        mutate {
          rename => {
            "src" => "event.idm.read_only_udm.src"
          }
        }
      }

      mutate {
        merge=> {
          "@output" => "event"
        }
      }
    }
  }
}
