# Product: SAP_ASE
# Category: Database
# Supported Format: SYSLOG+KV, SYSLOG + CSV
# Reference: N/A
# Last Updated: 2026-01-22
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "extrainfo" => ""
      "nodeid" => ""
      "prin_host" => ""
      "kv_data" => ""
      "suid" => ""
      "loginname" => ""
      "dbname" => ""
      "objname" => ""
      "objowner" => ""
      "eventmod" => ""
      "sequence" => ""
      "dbid" => ""
      "xactid" => ""
      "timestamp" => ""
      "hostname" => ""
      "principal" => ""
      "metadata" => ""
      "additional" => ""
      "target" => ""
      "security_result" => ""
      "event_value" => ""
      "spid" => ""
      "eventtime" => ""
      "objid" => ""
      "src_hostname" => ""
      "src_ip" => ""
      "event_type_set" => "false"
      "has_principal" => "false"
      "has_target" => "false"
      "log_type" => ""
      "csv_data" => ""
      "column1" => ""
      "column2" => ""
      "column3" => ""
      "column4" => ""
      "column5" => ""
      "column6" => ""
      "column7" => ""
      "column8" => ""
      "column9" => ""
      "column10" => ""
      "column11" => ""
      "column12" => ""
      "column13" => ""
      "column14" => ""
      "column15" => ""
      "column16" => ""
      "column17" => ""
      "column18" => ""
      "column19" => ""
      "column20" => ""
      "column21" => ""
      "column22" => ""
      "column23" => ""
      "column24" => ""
      "column25" => ""
      "column26" => ""
      "column27" => ""
      "event_time_str" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "<%{INT}>(%{TIMESTAMP_ISO8601:timestamp}|%{SYSLOGTIMESTAMP:timestamp}) %{DATA:prin_host} (?P<log_type>SAP_ASE_AUDIT)(\\[%{INT}\\])?:\\s+(?P<csv_data>.*)",
        "<%{INT}>(%{TIMESTAMP_ISO8601:timestamp}|%{SYSLOGTIMESTAMP:timestamp}) %{DATA:prin_host}\\s+(?P<kv_data>event:.*)",
        "<%{INT}>(%{TIMESTAMP_ISO8601:timestamp}|%{SYSLOGTIMESTAMP:timestamp}) %{DATA:prin_host}\\s+.*"
        "^event\\|%{DATA:event_value}\\|eventmod\\|%{DATA:eventmod}\\|spid\\|%{DATA:spid}\\|eventtime\\|%{DATA:eventtime}\\|sequence\\|%{DATA:sequence}\\|suid\\|%{DATA:suid}\\|dbid\\|%{DATA:dbid}\\|objid\\|%{DATA:objid}\\|xactid\\|%{DATA:xactid}\\|loginname\\|%{DATA:loginname}\\|dbname\\|%{DATA:dbname}\\|objname\\|%{DATA:objname}\\|objowner\\|%{DATA:objowner}\\|extrainfo\\|%{DATA:extrainfo}\\|nodeid\\|%{GREEDYDATA:nodeid}"
      ]
    }
    overwrite => ["csv_data","kv_data", "prin_host", "timestamp", "event_value", "eventmod", "spid", "eventtime", "sequence", "suid", "dbid", "objid", "xactid", "loginname", "dbname", "objname", "objowner", "extrainfo", "nodeid", "log_type"]
    on_error => "grok_failure"
  }
  if [log_type] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{log_type}"
      }
      on_error => "log_type_empty"
    }
  }
  if [csv_data] != "" {
    mutate {
      gsub => ["csv_data", " \\| ", ";"]
    }
    mutate {
      gsub => ["csv_data", "; ", ";"]
    }
    mutate {
      gsub => ["csv_data", ", ", ";"]
    }
    csv {
      source => "csv_data"
      separator => ";"
      on_error => "csv_failure"
    }
    if ![csv_failure] {
      if [column1] != "" {
        mutate {
          replace => {
            "nodeid" => "%{column1}"
          }
          on_error => "csv_column1_empty"
        }
      }
      if [column2] != "" {
        mutate {
          replace => {
            "event_value" => "%{column2}"
          }
          on_error => "csv_column2_empty"
        }
      }
      if [column3] != "" {
        mutate {
          replace => {
            "eventmod" => "%{column3}"
          }
          on_error => "csv_column3_empty"
        }
      }
      if [column4] != "" {
        mutate {
          replace => {
            "spid" => "%{column4}"
          }
          on_error => "csv_column4_empty"
        }
      }
      if [column5] != "" {
        date {
          match => ["column5", "MMM dd yyyy h:mma"]
          target => "@timestamp"
          on_error => "column5_date_failure"
        }
      }
      if [column6] != "" {
        mutate {
          replace => {
            "sequence" => "%{column6}"
          }
          on_error => "csv_column6_empty"
        }
      }
      if [column7] != "" {
        mutate {
          replace => {
            "suid" => "%{column7}"
          }
          on_error => "csv_column7_empty"
        }
      }
      if [column8] != "" {
        mutate {
          replace => {
            "dbid" => "%{column8}"
          }
          on_error => "csv_column8_empty"
        }
      }
      if [column9] != "" {
        mutate {
          replace => {
            "objid" => "%{column9}"
          }
          on_error => "csv_column9_empty"
        }
      }
      if [column10] != "" {
        mutate {
          replace => {
            "xactid" => "%{column10}"
          }
          on_error => "csv_column10_empty"
        }
      }
      if [column11] != "" {
        mutate {
          replace => {
            "loginname" => "%{column11}"
          }
          on_error => "csv_column11_empty"
        }
      }
      if [column12] != "" {
        mutate {
          replace => {
            "dbname" => "%{column12}"
          }
          on_error => "csv_column12_empty"
        }
      }
      if [column13] != "" {
        mutate {
          replace => {
            "objname" => "%{column13}"
          }
          on_error => "csv_column13_empty"
        }
      }
      if [column14] != "" {
        mutate {
          replace => {
            "objowner" => "%{column14}"
          }
          on_error => "csv_column14_empty"
        }
      }
      if [column15] != "" {
        mutate {
          replace => {
            "extrainfo" => "%{column15}"
          }
          on_error => "csv_column15_empty"
        }
      }
      if [column19] != "" {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.hostname" => "%{column19}"
          }
          on_error => "csv_column19_empty"
        }
      }
      if [column20] != "" and [column20] != "NULL" {
        mutate {
          replace => {
            "src_ip" => "%{column20}"
          }
          on_error => "csv_column20_empty"
        }
      }
    }
    if [column21] != "" {
      mutate {
        replace => {
          "ldap_dn_label.key" => "ldap_dn"
          "ldap_dn_label.value" => "%{column21}"
        }
        on_error => "csv_column21_empty"
      }
      if ![csv_column21_empty] {
        mutate {
          merge => {
            "security_result.detection_fields" => "ldap_dn_label"
          }
          on_error => "ldap_dn_label_merge_empty"
        }
      }
    }
    if [column22] != "" {
      mutate {
        replace => {
          "ldap_result_label.key" => "ldap_result"
          "ldap_result_label.value" => "%{column22}"
        }
        on_error => "csv_column22_empty"
      }
      if ![csv_column22_empty] {
        mutate {
          merge => {
            "security_result.detection_fields" => "ldap_result_label"
          }
          on_error => "ldap_result_label_merge_empty"
        }
      }
    }
    if [column23] != "" {
      mutate {
        replace => {
          "security_result.summary" => "%{column23}"
        }
        on_error => "csv_column23_empty"
      }
    }
    if [column25] != "" {
      mutate {
        replace => {
          "ldap_label.key" => "ldap"
          "ldap_label.value" => "%{column25}"
        }
        on_error => "csv_column25_empty"
      }
      if ![csv_column25_empty] {
        mutate {
          merge => {
            "security_result.detection_fields" => "ldap_label"
          }
          on_error => "ldap_label_merge_empty"
        }
      }
    }
  }
  if [eventtime] != "" {
    date {
      match => ["eventtime", "UNIX_MS"]
      on_error => "eventtime_ts_failure"
    }
  }
  else if [timestamp] != "" {
    date {
      match => ["timestamp", "LDAP", "UNIX", "ISO8601","RFC3339"]
      on_error => "timestamp_failure"
    }
  }

  if [grok_failure] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  mutate {
    replace => {
      "metadata.vendor_name" => "SAP_ASE"
      "metadata.product_name" => "SAP_ASE"
    }
  }
  mutate {
    gsub => ["kv_data", " ([A-Za-z_.()]+):", "^$1:"]
  }
  mutate {
    gsub => ["kv_data", '\\\"', '']
  }
  if [kv_data] != "" {
    kv {
      source => "kv_data"
      value_split => ": "
      field_split => "^"
      on_error => "kv_json_failure"
    }
  }
  if [extrainfo] != "" {
    grok {
      match => {
        "extrainfo" => [
          ".*?(?P<src_hostname>[0-9A-Za-z_-]+), (?P<src_ip>%{IP}),.*"
        ]
      }
      on_error => "host_ip_grok_fail"
      overwrite => ["src_hostname", "src_ip"]
    }
    if [host_ip_grok_fail] {
      grok {
        match => {
          "extrainfo" => [
            ".*?(?P<src_hostname>[0-9A-Za-z_-]+);.*"
          ]
        }
        on_error => "host_grok_fail"
        overwrite => ["src_hostname"]
      }
    }
  }
  if [src_hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{src_hostname}"
        "principal.asset.hostname" => "%{src_hostname}"
        "has_principal" => "true"
      }
      on_error => "src_hostname_empty"
    }
  }
  if [src_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "src_ip"
        "principal.asset.ip" => "src_ip"
      }
      on_error => "src_ip_empty"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [loginname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{loginname}"
      }
      on_error => "loginname_empty"
    }
  }

  if [prin_host] != "" and [hostname] == "" {
    mutate {
      replace => {
        "principal.hostname" => "%{prin_host}"
        "principal.asset.hostname" => "%{prin_host}"
        "has_principal" => "true"
      }
      on_error => "prin_host_empty"
    }
  }
  else if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
        "principal.asset.hostname" => "%{hostname}"
        "has_principal" => "true"
      }
      on_error => "hostname_empty"
    }
  }
  if [suid] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{suid}"
      }
      on_error => "suid_empty"
    }
  }
  if [extrainfo] != "" {
    mutate {
      replace => {
        "extrainfo_label.value.string_value" => "%{extrainfo}"
      }
      on_error => "extrainfo_empty"
    }
    if ![extrainfo_empty] {
      mutate {
        replace => {
          "extrainfo_label.key" => "extrainfo"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "extrainfo_label"
        }
        on_error => "extrainfo_label_empty"
      }
    }
  }
  if [loginname] != "" {
    mutate {
      replace => {
        "loginname_label.value.string_value" => "%{loginname}"
      }
      on_error => "loginname_empty"
    }
    if ![loginname_empty] {
      mutate {
        replace => {
          "loginname_label.key" => "loginname"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "loginname_label"
        }
        on_error => "loginname_label_empty"
      }
    }
  }
  if [dbname] != "" {
    mutate {
      replace => {
        "dbname_label.value.string_value" => "%{dbname}"
      }
      on_error => "dbname_empty"
    }
    if ![dbname_empty] {
      mutate {
        replace => {
          "dbname_label.key" => "dbname"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "dbname_label"
        }
        on_error => "dbname_label_empty"
      }
    }
  }
  if [objname] != "" {
    mutate {
      replace => {
        "objname_label.value.string_value" => "%{objname}"
      }
      on_error => "objname_empty"
    }
    if ![objname_empty] {
      mutate {
        replace => {
          "objname_label.key" => "objname"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "objname_label"
        }
        on_error => "objname_label_empty"
      }
    }
  }
  if [objowner] != "" {
    mutate {
      replace => {
        "objowner_label.value.string_value" => "%{objowner}"
      }
      on_error => "objowner_empty"
    }
    if ![objowner_empty] {
      mutate {
        replace => {
          "objowner_label.key" => "objowner"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "objowner_label"
        }
        on_error => "objowner_label_empty"
      }
    }
  }
    if [event_value] != "" {
    mutate {
      replace => {
        "event_value_label.value.string_value" => "%{event_value}"
      }
      on_error => "event_value_empty"
    }
    if ![event_value_empty] {
      mutate {
        replace => {
          "event_value_label.key" => "event_value"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "event_value_label"
        }
        on_error => "event_value_label_empty"
      }
    }
  }
  if [eventmod] != "" {
    mutate {
      replace => {
        "eventmod_label.value.string_value" => "%{eventmod}"
      }
      on_error => "eventmod_empty"
    }
    if ![eventmod_empty] {
      mutate {
        replace => {
          "eventmod_label.key" => "eventmod"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "eventmod_label"
        }
        on_error => "eventmod_label_empty"
      }
    }
  }
  if [sequence] != "" {
    mutate {
      replace => {
        "sequence_label.value.string_value" => "%{sequence}"
      }
      on_error => "sequence_empty"
    }
    if ![sequence_empty] {
      mutate {
        replace => {
          "sequence_label.key" => "sequence"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "sequence_label"
        }
        on_error => "sequence_label_empty"
      }
    }
  }
  if [dbid] != "" {
    mutate {
      replace => {
        "dbid_label.value.string_value" => "%{dbid}"
      }
      on_error => "dbid_empty"
    }
    if ![dbid_empty] {
      mutate {
        replace => {
          "dbid_label.key" => "dbid"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "dbid_label"
        }
        on_error => "dbid_label_empty"
      }
    }
  }
  if [xactid] != "" {
    mutate {
      replace => {
        "xactid_label.value.string_value" => "%{xactid}"
      }
      on_error => "xactid_empty"
    }
    if ![xactid_empty] {
      mutate {
        replace => {
          "xactid_label.key" => "xactid"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "xactid_label"
        }
        on_error => "xactid_label_empty"
      }
    }
  }
  if [spid] != "" {
    mutate {
      replace => {
        "spid_label.value.string_value" => "%{spid}"
        "spid_label.key" => "spid"
        }
        on_error => "spid_label_empty"
      }
    if ![spid_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "spid_label"
        }
        on_error => "spid_label_merge_empty"
      }
    }
  }
  if [objid] != "" {
    mutate {
      replace => {
        "objid_label.value.string_value" => "%{objid}"
        "objid_label.key" => "objid"
        }
        on_error => "objid_label_empty"
      }
    if ![objid_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "objid_label"
        }
        on_error => "objid_label_merge_empty"
      }
    }
  }

  if [event_value] in ["18", "19", "26", "27", "28", "29", "30", "31"] {
    mutate {
      replace => {
        "metadata.event_type" => "USER_RESOURCE_DELETION"
        "event_type_set" => "true"
      }
      on_error => "event_type_set_failure"
    }
  } else if [event_value] == "45" and [eventmod] == "2" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type" => "SSO"
        "event_type_set" => "true"
      }
    }
    mutate {
      replace => {
        "security_result.description" => "User Login Failed"
      }
    }
  } else if [event_value] == "45" and [eventmod] == "1" {
      mutate {
        replace => {
          "metadata.event_type" => "USER_LOGIN"
          "event.idm.read_only_udm.extensions.auth.type" => "SSO"
          "event_type_set" => "true"
        }
        on_error => "event_type_set_failure_1"
      }
      mutate {
        replace => {
          "security_result.description" => "User Login Successful"
        }
      }
  }
  else if [event_value] == "46" and [eventmod] == "1" {
      mutate {
        replace => {
          "metadata.event_type" => "USER_LOGOUT"
          "event.idm.read_only_udm.extensions.auth.type" => "SSO"
          "event_type_set" => "true"
        }
        on_error => "event_type_set_failure_2"
      }
      mutate {
        replace => {
          "security_result.description" => "User Logout Successful"
        }
      }
    }
  if [nodeid] != "" {
    mutate {
      replace => {
        "nodeid_label.value.string_value" => "%{nodeid}"
      }
      on_error => "nodeid_empty"
    }
    if ![nodeid_empty] {
      mutate {
        replace => {
          "nodeid_label.key" => "nodeid"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "nodeid_label"
        }
        on_error => "nodeid_label_empty"
      }
    }
  }

  if [event_type_set] == "false" {
    if [has_principal] == "true" and [has_target] == "false" {
      mutate {
        replace => {
          "metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      mutate {
        replace => {
          "metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_merge_empty"
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
