# Product: UPTYCS_EDR
# Category: Endpoint detection and response
# Supported Format: JSON
# Reference: https://www.uptycs.com/blog/uptycs-edr-for-linux-detection-and-visibility-all-the-way-through
# Last Updated: 2022-07-08
# Copyright 2022 Chronicle LLC

filter {

  mutate {
    replace => {
      "osquery_raw_data.cmdline" => ""
      "osquery_raw_data.container_id" => ""
      "osquery_raw_data.local_address" => ""
      "osquery_raw_data.local_port" => ""
      "osquery_raw_data.local" => ""
      "osquery_raw_data.path" => ""
      "osquery_raw_data.remote_port" => ""
      "osquery_raw_data.remote_address" => ""
      "osquery_raw_data.pid" => ""
      "osquery_raw_data.ppid" => ""
      "osquery_raw_data.uid" => ""
      "osquery_raw_data.uname" => ""
      "osquery_raw_data.ancestor_list" => ""
      "osquery_raw_data.worker_instance_id" => ""
      "osquery_raw_data.container_image" => ""
      "osquery_raw_data.container_name" => ""
      "osquery_raw_data.success" => ""
      "osquery_raw_data.md5" => ""
      "osquery_raw_data.port" => ""
      "osquery_raw_data.question" => ""
      "osquery_raw_data.answer" => ""
      "osquery_raw_data.return_code" => ""
      "osquery_raw_data.type" => ""
      "question" => ""
      "record_type" => ""
      "upt_asset_id" => ""
      "upt_hash" => ""
      "upt_hostname" => ""
      "upt_resource_type" => ""
      "event_type" => ""
      "upt_time" => ""
      "upt_asset_group_id" => ""
      "upt_asset_group_name" => ""
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
  }

  if [upt_time] != "" {
    date {
      match => ["upt_time", "ISO8601"]
    }
  }

  if [osquery_raw_data][cmdline] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.command_line" => "%{osquery_raw_data.cmdline}"
      }
    }
  }

  if [osquery_raw_data][container_id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{osquery_raw_data.container_id}"
      }
    }
  }

  if [osquery_raw_data][local_address] != "" {
    grok {
      match => {
        "osquery_raw_data.local_address" => "%{IP:ip1}"
      }
      on_error => "not_ip"
    }
    if ![not_ip] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "osquery_raw_data.local_address"
        }
      }
    }
  }

  if [osquery_raw_data][local] != "" {
    grok {
      match => {
        "osquery_raw_data.local" => "%{IP:ip1}"
      }
      on_error => "not_ip1"
    }
    if ![not_ip1] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "osquery_raw_data.local"
        }
      }
    }
  }

  if [osquery_raw_data][local_port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.port" => "%{osquery_raw_data.local_port}"
      }
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.principal.port" => "integer"
      }
    }
  }

  if [osquery_raw_data][port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.port" => "%{osquery_raw_data.port}"
      }
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.target.port" => "integer"
      }
    }
  }

  if [osquery_raw_data][path] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.file.full_path" => "%{osquery_raw_data.path}"
      }
    }
  }

  if [osquery_raw_data][pid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.pid" => "%{osquery_raw_data.pid}"
        "event_type" => "PROCESS_LAUNCH"
      }
    }
  }

  if [osquery_raw_data][uid] != "" and [osquery_raw_data][uid] != "0" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{osquery_raw_data.uid}"
      }
    }
  }
  else if [osquery_raw_data][worker_instance_id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{osquery_raw_data.worker_instance_id}"
      }
    }
  }

  if [osquery_raw_data][uname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.user_display_name" => "%{osquery_raw_data.uname}"
      }
    }
  }

  if [osquery_raw_data][container_image] != "" {
    mutate {
      replace => {
        "container_image.key" => "Container Image"
        "container_image.value.string_value" => "%{osquery_raw_data.container_image}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "container_image"
      }
    }
  }

  if [osquery_raw_data][container_name] != "" {
    mutate {
      replace => {
        "container_name.key" => "Container Name"
        "container_name.value.string_value" => "%{osquery_raw_data.container_name}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "container_name"
      }
    }
  }

  if [upt_asset_id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.asset_id" => "UPT ASSET ID:%{upt_asset_id}"
      }
    }
  }

  if [upt_asset_group_id] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.user.group_identifiers" => "upt_asset_group_id"
      }
    }
  }

  if [upt_asset_group_name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.group.group_display_name" => "%{upt_asset_group_name}"
      }
    }
  }

  if [upt_hash] != "" {
    mutate {
      gsub => ["upt_hash", "-", ""]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.md5" => "%{upt_hash}"
      }
    }
  }

  if [osquery_raw_data][md5] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.file.md5" => "%{osquery_raw_data.md5}"
      }
    }
  }

  if [upt_hostname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{upt_hostname}"
      }
    }
  }

  if [upt_resource_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.type" => "%{upt_resource_type}"
      }
    }
  }

  if [osquery_raw_data][ancestor_list] != "" {
    mutate {
      gsub => ["osquery_raw_data.ancestor_list","\\[",'{\"ancestor_list\":[']
    }
    mutate {
      gsub => ["osquery_raw_data.ancestor_list","\\]","]}"]
    }
    json {
      source => "osquery_raw_data.ancestor_list"
      array_function => "split_columns"
      on_error => "not_json_TEST"
    }
    mutate {
      replace => {
        "pchain" => "{"
        "cclose" => "}"
      }
    }

    for index,ancestor in ancestor_list {
      if index > 0 {
        mutate {
          replace => {
            "pchain" => "%{pchain},\"parent_process\":{"
            "cclose" => "%{cclose}}"
          }
        }
      }
      mutate {
        replace => {
          "pchain" => "%{pchain}\"command_line\":\"%{ancestor.cmdline}\","
        }
        on_error => "_"
      }
      mutate {
        replace => {
          "pchain" => "%{pchain}\"file\":{\"full_path\":\"%{ancestor.path}\"},"
        }
        on_error => "_"
      }
      mutate {
        convert => {
          "ancestor.pid" => "string"
        }
        on_error => "already_string"
      }
      mutate {
        replace => {
          "pchain" => "%{pchain}\"pid\":\"%{ancestor.pid}\""
        }
        on_error => "no_pid"
      }
      grok {
        match => {
          "pchain" => "(?P<pchain>.*),$"
        }
        overwrite => ["pchain"]
        on_error => "_"
      }
    }
    mutate {
      replace => {
        "pchain" => "%{pchain}%{cclose}"
      }
    }

    json {
      source => "pchain"
      target => "event.idm.read_only_udm.target.process.parent_process"
    }
  }

  if [osquery_raw_data][remote_port] != "" {
    mutate {
      rename => {
        "osquery_raw_data.remote_port" => "intermediary1.port"
      }
    }
    mutate {
      convert => {
        "intermediary1.port" => "integer"
      }
    }
  }

  if [osquery_raw_data][remote_address] != "" {
    mutate {
      merge => {
        "intermediary1.ip" => "osquery_raw_data.remote_address"
      }
    }
  }

  mutate {
    merge => {
      "event.idm.read_only_udm.intermediary" => "intermediary1"
    }
    on_error => "no_intermediary1"
  }

  if [osquery_raw_data][question] != "" {
    mutate {
      replace => {
        "question.name" => "%{osquery_raw_data.question}"
        "event_type" => "NETWORK_DNS"
        "event.idm.read_only_udm.network.application_protocol" => "DNS"
      }
    }
  }

  if [osquery_raw_data][type] != "" {
    mutate {
      replace => {
        "record_type" => "%{osquery_raw_data.type}"
      }
    }
  }

  # Product: DNS
# Category: .include library
# Supported Format: NA
# Reference: https://www.iana.org/assignments/dns-parameters/dns-parameters.xhtml#dns-parameters-4
# Last Updated: 2022-01-11
# Copyright 2022 Chronicle LLC

mutate {
  uppercase => ["record_type"]
}

        if [record_type] == "A"                 {mutate {replace => {  "question.type" => "1"  }}
}  else if [record_type] == "NS"                {mutate {replace => {  "question.type" => "2"  }}
}  else if [record_type] == "MD"                {mutate {replace => {  "question.type" => "3"  }}
}  else if [record_type] == "MF"                {mutate {replace => {  "question.type" => "4"  }}
}  else if [record_type] == "CNAME"             {mutate {replace => {  "question.type" => "5"  }}
}  else if [record_type] == "SOA"               {mutate {replace => {  "question.type" => "6"  }}
}  else if [record_type] == "MB"                {mutate {replace => {  "question.type" => "7"  }}
}  else if [record_type] == "MG"                {mutate {replace => {  "question.type" => "8"  }}
}  else if [record_type] == "MR"                {mutate {replace => {  "question.type" => "9"  }}
}  else if [record_type] == "NULL"              {mutate {replace => {  "question.type" => "10"  }}
}  else if [record_type] == "WKS"               {mutate {replace => {  "question.type" => "11"  }}
}  else if [record_type] == "PTR"               {mutate {replace => {  "question.type" => "12"  }}
}  else if [record_type] == "HINFO"             {mutate {replace => {  "question.type" => "13"  }}
}  else if [record_type] == "MINFO"             {mutate {replace => {  "question.type" => "14"  }}
}  else if [record_type] == "MX"                {mutate {replace => {  "question.type" => "15"  }}
}  else if [record_type] == "TXT"               {mutate {replace => {  "question.type" => "16"  }}
}  else if [record_type] == "RP"                {mutate {replace => {  "question.type" => "17"  }}
}  else if [record_type] == "AFSDB"             {mutate {replace => {  "question.type" => "18"  }}
}  else if [record_type] == "X25"               {mutate {replace => {  "question.type" => "19"  }}
}  else if [record_type] == "ISDN"              {mutate {replace => {  "question.type" => "20"  }}
}  else if [record_type] == "RT"                {mutate {replace => {  "question.type" => "21"  }}
}  else if [record_type] == "NSAP"              {mutate {replace => {  "question.type" => "22"  }}
}  else if [record_type] == "NSAP-PTR"          {mutate {replace => {  "question.type" => "23"  }}
}  else if [record_type] == "SIG"               {mutate {replace => {  "question.type" => "24"  }}
}  else if [record_type] == "KEY"               {mutate {replace => {  "question.type" => "25"  }}
}  else if [record_type] == "PX"                {mutate {replace => {  "question.type" => "26"  }}
}  else if [record_type] == "GPOS"              {mutate {replace => {  "question.type" => "27"  }}
}  else if [record_type] == "AAAA"              {mutate {replace => {  "question.type" => "28"  }}
}  else if [record_type] == "LOC"               {mutate {replace => {  "question.type" => "29"  }}
}  else if [record_type] == "NXT"               {mutate {replace => {  "question.type" => "30"  }}
}  else if [record_type] == "EID"               {mutate {replace => {  "question.type" => "31"  }}
}  else if [record_type] == "NIMLOC"            {mutate {replace => {  "question.type" => "32"  }}
}  else if [record_type] == "SRV"               {mutate {replace => {  "question.type" => "33"  }}
}  else if [record_type] == "ATMA"              {mutate {replace => {  "question.type" => "34"  }}
}  else if [record_type] == "NAPTR"             {mutate {replace => {  "question.type" => "35"  }}
}  else if [record_type] == "KX"                {mutate {replace => {  "question.type" => "36"  }}
}  else if [record_type] == "CERT"              {mutate {replace => {  "question.type" => "37"  }}
}  else if [record_type] == "A6"                {mutate {replace => {  "question.type" => "38"  }}
}  else if [record_type] == "DNAME"             {mutate {replace => {  "question.type" => "39"  }}
}  else if [record_type] == "SINK"              {mutate {replace => {  "question.type" => "40"  }}
}  else if [record_type] == "OPT"               {mutate {replace => {  "question.type" => "41"  }}
}  else if [record_type] == "APL"               {mutate {replace => {  "question.type" => "42"  }}
}  else if [record_type] == "DS"                {mutate {replace => {  "question.type" => "43"  }}
}  else if [record_type] == "SSHFP"             {mutate {replace => {  "question.type" => "44"  }}
}  else if [record_type] == "IPSECKEY"          {mutate {replace => {  "question.type" => "45"  }}
}  else if [record_type] == "RRSIG"             {mutate {replace => {  "question.type" => "46"  }}
}  else if [record_type] == "NSEC"              {mutate {replace => {  "question.type" => "47"  }}
}  else if [record_type] == "DNSKEY"            {mutate {replace => {  "question.type" => "48"  }}
}  else if [record_type] == "DHCID"             {mutate {replace => {  "question.type" => "49"  }}
}  else if [record_type] == "NSEC3"             {mutate {replace => {  "question.type" => "50"  }}
}  else if [record_type] == "NSEC3PARAM"        {mutate {replace => {  "question.type" => "51"  }}
}  else if [record_type] == "TLSA"              {mutate {replace => {  "question.type" => "52"  }}
}  else if [record_type] == "SMIMEA"            {mutate {replace => {  "question.type" => "53"  }}
}  else if [record_type] == "UNASSIGNED"        {mutate {replace => {  "question.type" => "54"  }}
}  else if [record_type] == "HIP"               {mutate {replace => {  "question.type" => "55"  }}
}  else if [record_type] == "NINFO"             {mutate {replace => {  "question.type" => "56"  }}
}  else if [record_type] == "RKEY"              {mutate {replace => {  "question.type" => "57"  }}
}  else if [record_type] == "TALINK"            {mutate {replace => {  "question.type" => "58"  }}
}  else if [record_type] == "CDS"               {mutate {replace => {  "question.type" => "59"  }}
}  else if [record_type] == "CDNSKEY"           {mutate {replace => {  "question.type" => "60"  }}
}  else if [record_type] == "OPENPGPKEY"        {mutate {replace => {  "question.type" => "61"  }}
}  else if [record_type] == "CSYNC"             {mutate {replace => {  "question.type" => "62"  }}
}  else if [record_type] == "ZONEMD"            {mutate {replace => {  "question.type" => "63"  }}
}  else if [record_type] == "SVCB"              {mutate {replace => {  "question.type" => "64"  }}
}  else if [record_type] == "HTTPS"             {mutate {replace => {  "question.type" => "65"  }}
}  else if [record_type] == "SPF"               {mutate {replace => {  "question.type" => "99"  }}
}  else if [record_type] == "UINFO"             {mutate {replace => {  "question.type" => "100"  }}
}  else if [record_type] == "UID"               {mutate {replace => {  "question.type" => "101"  }}
}  else if [record_type] == "GID"               {mutate {replace => {  "question.type" => "102"  }}
}  else if [record_type] == "UNSPEC"            {mutate {replace => {  "question.type" => "103"  }}
}  else if [record_type] == "NID"               {mutate {replace => {  "question.type" => "104"  }}
}  else if [record_type] == "L32"               {mutate {replace => {  "question.type" => "105"  }}
}  else if [record_type] == "L64"               {mutate {replace => {  "question.type" => "106"  }}
}  else if [record_type] == "LP"                {mutate {replace => {  "question.type" => "107"  }}
}  else if [record_type] == "EUI48"             {mutate {replace => {  "question.type" => "108"  }}
}  else if [record_type] == "EUI64"             {mutate {replace => {  "question.type" => "109"  }}
}  else if [record_type] == "TKEY"              {mutate {replace => {  "question.type" => "249"  }}
}  else if [record_type] == "TSIG"              {mutate {replace => {  "question.type" => "250"  }}
}  else if [record_type] == "IXFR"              {mutate {replace => {  "question.type" => "251"  }}
}  else if [record_type] == "AXFR"              {mutate {replace => {  "question.type" => "252"  }}
}  else if [record_type] == "MAILB"             {mutate {replace => {  "question.type" => "253"  }}
}  else if [record_type] == "MAILA"             {mutate {replace => {  "question.type" => "254"  }}
}  else if [record_type] == "ALL"               {mutate {replace => {  "question.type" => "255"  }}
}  else if [record_type] == "URI"               {mutate {replace => {  "question.type" => "256"  }}
}  else if [record_type] == "CAA"               {mutate {replace => {  "question.type" => "257"  }}
}  else if [record_type] == "AVC"               {mutate {replace => {  "question.type" => "258"  }}
}  else if [record_type] == "DOA"               {mutate {replace => {  "question.type" => "259"  }}
}  else if [record_type] == "AMTRELAY"          {mutate {replace => {  "question.type" => "260"  }}
}  else if [record_type] == "TA"                {mutate {replace => {  "question.type" => "32768"  }}
}  else if [record_type] == "DLV"               {mutate {replace => {  "question.type" => "32769"  }}
}

  mutate {
    convert => {
      "question.type" => "uinteger"
    }
    on_error => "already_in_uinteger"
  }


  if [question] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.network.dns.questions" => "question"
      }
    }
  }

  if [osquery_raw_data][answer] != "" {
    mutate {
      replace => {
        "answer.name" => "%{osquery_raw_data.answer}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.network.dns.answers" => "answer"
      }
    }
  }

  if [osquery_raw_data][return_code] == "SUCCESS" or [osquery_raw_data][success] == "1" {
    mutate {
      replace => {
        "action" => "ALLOW"
      }
    }
    mutate {
      merge => {
        "sec_result.action" => "action"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "sec_result"
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate{
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "UPTYCS"
      "event.idm.read_only_udm.metadata.product_name" => "UPTYCS_EDR"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
