# Product: Juniper IPS
# Category: IDS/IPS
# Supported Format: SYSLOG + KV
# Reference: See below
# Last Updated: 2022-05-26
# Copyright 2022 Chronicle LLC


# Additional references:
#   - https://www.juniper.net/documentation/en_US/junos-space19.4/information-products/pathway-pages/security-director-user-guide.pdf
#   - https://www.juniper.net/documentation/en_US/junos/topics/reference/general/syslog-interpreting-msg-generated-structured-data-format.html
#   - http://services.netscreen.com/documentation/signatures/index.html
#   - https://apps.juniper.net/syslog-explorer/#

filter {
  mutate {
    replace => {
      "severity" => "LOW"
      "application-name" => ""
      "destination-address" => ""
      "source-address" => ""
      "source-port" => ""
      "destination-port" => ""
      "security_res" => ""
      "reason" => ""
      "src-nat-rule-name" => ""
      "src-nat-rule-type" => ""
      "service-name" => ""
      "policy-name" => ""
      "bytes-from-client" => ""
      "bytes-from-server" => ""
      "application" => ""
      "internal-ip" => ""
      "internal-port" => ""
      "source-zone-name" => ""
      "reflexive-ip" => ""
      "reflexive-port" => ""
      "epoch-time" => ""
    }
  }

  # Separate remote header message from the actual local log message.
  grok {
    match => {
      "message" => [
        "<%{INT:priority_code}>%{INT} %{TIMESTAMP_ISO8601:datetime} %{HOSTNAME:devicename} %{DATA:type} - %{DATA:tag} \\[%{DATA:os_hw_platform} (?P<kvdata>.*)\\]"
      ]
    }
    on_error => "pattern_not_implemented"
  }

  if [pattern_not_implemented] {
    drop{}
  }

  kv {
    source => "kvdata"
    field_split => " "
    value_split => "="
    trim_value => "\""
  }

  if [epoch-time] != "" {
    date {
      match => ["epoch-time", "UNIX"]
    }
  }

  if [datetime] != "" and [epoch-time] == "" {
    date {
      match => ["datetime", "RFC3339"]
    }
  }

  # Setting common metadata
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "JUNIPER"
      "event.idm.read_only_udm.metadata.product_name" => "JUNIPER_IPS"

      "event.idm.read_only_udm.metadata.product_event_type" => "%{type}-%{tag}"
      "event.idm.read_only_udm.metadata.product_version" => "%{os_hw_platform}"
    }
  }

  if [tag] == "IDP_ATTACK_LOG_EVENT" {

    if [threat-severity] in ["HIGH", "MEDIUM", "LOW"] {
      mutate {
        replace => {
          "severity" => "%{threat-severity}"
        }
      }
    }

    # security result
    mutate {
      replace => {
        "category" => "NETWORK_SUSPICIOUS"
      }

      merge => {
        "security_result.category" => "category"
      }
    }

    mutate {
      replace => {
        "security_result.severity" => "%{severity}"
        "security_result.rule_name" => "%{rule-name}"
        "security_result.threat_name" => "%{attack-name}"
        "security_result.description" => "%{message}"
      }

      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }

    # principal
    mutate {
      replace => {
        "principal_ip" => "%{source-address}"

        "event.idm.read_only_udm.principal.port" => "%{source-port}"
        "event.idm.read_only_udm.principal.user.user_display_name" => "%{username}"
      }

      convert => {
        "event.idm.read_only_udm.principal.port" => "integer"
      }

      merge => {
        "event.idm.read_only_udm.principal.ip" => "principal_ip"

      }
    }

    # target
    mutate {
      replace => {
        "target_ip" => "%{destination-address}"

        "event.idm.read_only_udm.target.port" => "%{destination-port}"
      }

      convert => {
        "event.idm.read_only_udm.target.port" => "integer"
      }

      merge => {
        "event.idm.read_only_udm.target.ip" => "target_ip"
      }
    }

    # intermediary
    mutate {
      replace => {
        "intermediary.hostname" => "%{devicename}"
        "intermediary.application" => "%{application-name}"
      }

      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
    }

    # network
    mutate {
      replace => {
        "event.idm.read_only_udm.network.ip_protocol" => "%{protocol-name}"
        "event.idm.read_only_udm.network.received_bytes" => "%{inbound-bytes}"
        "event.idm.read_only_udm.network.sent_bytes" => "%{outbound-bytes}"
      }

      convert => {
        "event.idm.read_only_udm.network.received_bytes" => "uinteger"
        "event.idm.read_only_udm.network.sent_bytes" => "uinteger"
      }
    }

    # metadata
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
        "event.idm.read_only_udm.metadata.description" => "IDP Attack log generated for attack"
      }
    }
  }
  if [application-name] == "" {
    if [destination-address] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "destination-address"
        }
      }
    } else if [reflexive-ip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "reflexive-ip"
        }
      }
    }

    if [source-address] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "source-address"
        }
      }
    } else if [internal-ip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "internal-ip"
        }
      }
    }

    if [source-port] != "" {
      mutate {
        convert => {
          "source-port" => "integer"
        }
      }
      mutate {
        rename => {
          "source-port" => "event.idm.read_only_udm.principal.port"
        }
      }
    } else if [reflexive-port] != "" {
      mutate {
        convert => {
          "reflexive-port" => "integer"
        }
      }
      mutate {
        rename => {
          "reflexive-port" => "event.idm.read_only_udm.target.port"
        }
      }
    }

    if [destination-port] != "" {
      mutate {
        convert => {
          "destination-port" => "integer"
         }
       }
       mutate {
         rename => {
           "destination-port" => "event.idm.read_only_udm.target.port"
         }
       }
     } else if [internal-port] != "" {
       mutate {
         convert => {
          "internal-port" => "integer"
         }
       }
       mutate {
         rename => {
           "internal-port" => "event.idm.read_only_udm.principal.port"
         }
       }
     }

     mutate {
       convert => {
         "bytes-from-client" => "uinteger"
       }
       on_error => "rcvdNotInteger"
    }
    if ![rcvdNotInteger] {
      mutate {
        rename => { "bytes-from-client" => "event.idm.read_only_udm.network.received_bytes" }
      }
    }
    mutate {
      convert => {
        "bytes-from-server" => "uinteger"
      }
      on_error => "sentNotInteger"
    }
    if ![sentNotInteger] {
      mutate {
        rename => { "bytes-from-server" => "event.idm.read_only_udm.network.sent_bytes" }
      }
    }

    if [devicename] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{devicename}"
        }
      }
    }

    if [source-zone-name] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.location.name" => "%{source-zone-name}"
        }
      }
    }

    if [policy-name] != ""{
      mutate {
        replace => {
          "additional_cache_pct.key" => "policy-name"
          "additional_cache_pct.value.string_value" => "%{policy-name}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_cache_pct"
        }
      }
    }
    if [service-name] != "" {
      mutate {
        replace => {
        "additional_name.key" => "service-name"
        "additional_name.value.string_value" => "%{service-name}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_name"
      }
    }
  }

  if [src-nat-rule-type] != ""{
    mutate{
      replace => {
        "security_res.rule_type" => "%{src-nat-rule-type}"
       }
     }
   }
   if [src-nat-rule-name] != ""{
    mutate{
      replace => {
        "security_res.rule_name" => "%{src-nat-rule-name}"
       }
     }
   }
   if [reason] != ""{
    mutate{
      replace => {
        "security_res.action_details" => "%{reason}"
       }
     }
   }
   if [security_res] != "" {
     mutate {
       merge => {
         "event.idm.read_only_udm.security_result" => "security_res"
        }
      }
    }
  }

  if [service-name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  } else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
