# Product: SKYBOX_FIREWALL_ASSURANCE
# Category: Firewall
# Supported Format: SYSLOG + KV
# Reference: NA
# Last Updated: 2023-09-07
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "when" => ""
      "app_name" => ""
      "user_id" => ""
      "host_name" => ""
      "principal_ip" => ""
      "principal_ips" => ""
      "target_ips" => ""
      "nexus_addresses" => ""
      "nexus_ssh_port" => ""
      "severity" => ""
      "server_name" => ""
      "user_name" => ""
      "api_name" => ""
      "login_time" => ""
      "summary" => ""
      "task_details" => ""
      "collect_startup_config" => ""
      "enable_command_set" => ""
      "get_configuration_command_set" => ""
      "import_dynamic_routes" => ""
      "is_run_over_latest_ssh_library" => ""
      "location_hint" => ""
      "nexus_admin_password" => ""
      "nexus_admin_username" => ""
      "nexus_password" => ""
      "nexus_username" => ""
      "nexus_protocol" => ""
      "object" => ""
      "safe" => ""
      "vulnebralities_ids" => ""
      "has_principal_ip" => "false"
      "has_principal_port" => "false"
      "has_target_ip" => "false"
      "extension_mechanism" => ""
      "security_result" => ""
      "msg" => ""
      "kv_fields" => ""
      "event_type" => ""
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "additional" => ""
    }
  }

  mutate {
    gsub => ["message", "\\n", ""]
  }
  mutate {
    gsub => ["message", "□", ""]
  }

  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:when} %{DATA:app_name} %{WORD} \\[%{DATA:host_name}\\] %{WORD:severity} %{WORD:server_name} \\[\\] - %{GREEDYDATA:msg}"
      ]
    }
    overwrite => ["when", "app_name", "host_name", "severity", "server_name", "msg"]
    on_error => "pattern_not_matched"
  }

  if [pattern_not_matched] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [msg] =~ "(?i)USER_MANAGE" {
    grok {
      match => {
        "msg" => [
          "%{DATA} - <%{DATA}@%{IP:principal_ip}:%{DATA:api_name}:%{INT}> %{DATA} %{DATA:user_id} %{DATA}: %{GREEDYDATA:login_time}",
          "%{DATA} - <@%{IP:ip}:%{DATA:api_name}:%{INT}> %{DATA} %{DATA:user_id} %{GREEDYDATA}"
        ]
      }
      overwrite => ["principal_ip", "api_name", "user_id", "login_time"]
      on_error => "msg_pattern_failed"
    }
  }
  else if [msg] =~ "(?i)SYSTEM Task" {
    grok {
      match => {
        "msg" => [
          "%{DATA} - <%{DATA:user_id}@%{IP:principal_ip}:%{DATA:api_name}:%{INT}> %{DATA:task_details}\\(%{DATA:app_name}\\). %{DATA} \\(%{DATA:principal_ips} -> %{DATA:target_ips}\\)%{DATA}",
          "%{DATA} - <%{DATA:user_id}@%{IP:principal_ip}:%{DATA:api_name}:%{INT}> %{DATA:task_details}\(%{DATA:app_name}\) %{DATA}: %{GREEDYDATA:kv_fields}"
        ]
      }
      overwrite => ["principal_ip", "api_name", "user_id", "login_time", "task_details", "app_name", "principal_ips", "target_ips", "kv_fields"]
      on_error => "msg_pattern_failed_2"
    }
  }
  else if [msg] =~ "(?i)TAM Vulnerability_Definition" {
    grok {
      match => {
        "msg" => [
          "%{DATA}<> %{DATA:summary}: ,%{GREEDYDATA:vulnebralities_ids}",
        ]
      }
      overwrite => ["summary", "vulnebralities_ids"]
      on_error => "msg_pattern_failed_3"
    }
  }
  else if [severity] == "FATAL" and [msg] =~ "(?i)Failed to connect" {
    grok {
      match => {
        "msg" => [
          "%{GREEDYDATA:summary}"
        ]
      }
      overwrite => ["summary"]
      on_error => "msg_pattern_failed_4"
    }
  }

  mutate {
    gsub => ["kv_fields", "([a-zA-Z0-9_]+): ", "#$1:"]
  }
  mutate {
    gsub => ["kv_fields", ", #", "#"]
  }
  mutate {
    gsub => ["kv_fields", "'", ""]
  }

  mutate {
    gsub => ["principal_ips", "-([0-9.]+)", ""]
  }

  mutate {
    replace => {
      "principal_ips" => "{\"principal_ips\":[\"%{principal_ips}\"]}"
    }
    on_error => "empty_or_invalid_principal_ips"
  }

  mutate {
    gsub => ["principal_ips", ", ", "\", \""]
  }

  json {
    source => "principal_ips"
    array_function => "split_columns"
    on_error => "not_json"
  }

  mutate {
    gsub => ["target_ips", "-([0-9.]+)", ""]
  }

  mutate {
    replace => {
      "target_ips" => "{\"target_ips\":[\"%{target_ips}\"]}"
    }
    on_error => "empty_or_invalid_target_ips"
  }

  mutate {
    gsub => ["target_ips", ", ", "\", \""]
  }

  json {
    source => "target_ips"
    array_function => "split_columns"
    on_error => "not_json_2"
  }

  kv {
    source => "kv_fields"
    field_split => "#"
    value_split => ":"
    on_error => "not_kv"
  }

  if ![not_kv] {
    mutate {
      gsub => ["nexus_addresses", "-([0-9.]+)", ""]
    }
    mutate {
      replace => {
        "nexus_addresses" => "{\"nexus_addresses\":[\"%{nexus_addresses}\"]}"
      }
      on_error => "empty_or_invalid_nexus_addresses"
    }

    mutate {
      gsub => ["nexus_addresses", ", ", "\", \""]
    }

    json {
      source => "nexus_addresses"
      array_function => "split_columns"
      on_error => "not_json__3"
    }
  }

  date {
    match => ["when","ISO8601", "UNIX", "MMM dd HH:mm:ss"]
    target => "metadata.collected_timestamp"
    on_error => "date_pattern_not_matched"
  }

  if [app_name] != "" {
    mutate {
      replace => {
        "principal.application" => "%{app_name}"
      }
      on_error => "invalid_app_name"
    }
  }

  if [user_id] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{user_id}"
      }
      on_error => "invalid_userid"
    }
  }

  if [host_name] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host_name}"
      }
      on_error => "invalid_host_name"
    }
  }

  if [principal_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "principal_ip"
      }
      on_error => "invalid_principal_ip"
    }
    if ![invalid_principal_ip] {
      mutate {
        replace => {
          "has_principal_ip" => "true"
        }
      }
    }
  }

  for ip in principal_ips {
    if [ip] != "" {
      mutate {
        merge => {
          "principal.ip" => "ip"
        }
        on_error => "invalid_ip"
      }
      if ![invalid_ip] {
        mutate {
          replace => {
            "has_principal_ip" => "true"
          }
        }
      }
    }
  }

  for ip in target_ips {
    if [ip] != "" {
      mutate {
        merge => {
          "target.ip" => "ip"
        }
        on_error => "invalid_target_ip"
      }
      if ![invalid_target_ip] {
        mutate {
          replace => {
            "has_target_ip" => "true"
          }
        }
      }
    }
  }

  for ip in nexus_addresses {
    if [ip] != "" {
      mutate {
        merge => {
          "principal.ip" => "ip"
        }
        on_error => "invalid_principal_ip"
      }
      if ![invalid_principal_ip] {
        mutate {
          replace => {
            "has_principal_ip" => "true"
          }
        }
      }
    }
  }

  if [nexus_ssh_port] != "" {
    mutate {
      convert => {
        "nexus_ssh_port" => "integer"
      }
      on_error => "nexus_ssh_port_already_integer"
    }
    mutate {
      rename => {
        "nexus_ssh_port" => "principal.port"
      }
      on_error => "principal_port_rename_failure"
    }
    if ![principal_port_rename_failure] {
      mutate {
        replace => {
          "has_principal_port" => "true"
        }
      }
    }
  }

  if [severity] != "" {
    mutate {
      uppercase => [severity]
      on_error => "already_in_uppercase"
    }
    if [severity] =~ "(?i)INFO" {
      mutate {
        replace => {
          "severity" => "INFORMATIONAL"
        }
      }
    }
    else if [severity] =~ "(?i)WARN" {
      mutate {
        replace => {
          "severity" => "MEDIUM"
        }
      }
    }
    else if [severity] =~ "(?i)FATAL" {
      mutate {
        replace => {
          "severity" => "HIGH"
        }
      }
    }
    else if [severity] =~ "(?i)ERROR" {
      mutate {
        replace => {
          "severity" => "ERROR"
        }
      }
    }
    mutate {
      replace => {
        "security_result.severity" => "%{severity}"
      }
      on_error => "invalid_summary"
    }
  }

  if [server_name] != "" {
    mutate {
      replace => {
        "target.application" => "%{server_name}"
      }
      on_error => "invalid_server_name"
    }
  }

  if [summary] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{summary}"
      }
      on_error => "%{invalid_summary}"
    }
  }

  if [nexus_admin_username] != "" {
    mutate {
      replace => {
        "admin_username.key" => "Admin Username"
        "admin_username.value.string_value" => "%{nexus_admin_username}"
      }
      on_error => "invalid_admin_username"
    }
    mutate {
      merge => {
        "additional.fields" => "admin_username"
      }
    }
  }

  if [nexus_admin_password] != "" {
    mutate {
      replace => {
        "admin_password.key" => "Admin Password"
        "admin_password.value.string_value" => "%{nexus_admin_password}"
      }
      on_error => "invalid_admin_password"
    }
    mutate {
      merge => {
        "additional.fields" => "admin_password"
      }
    }
  }

  if [nexus_username] != "" {
    mutate {
      convert => {
        "nexus_username" => "string"
      }
      on_error => "nexus_username_already_string"
    }
    mutate {
      replace => {
        "username.key" => "Username"
        "username.value.string_value" => "%{nexus_username}"
      }
      on_error => "invalid_username"
    }
    mutate {
      merge => {
        "additional.fields" => "username"
      }
    }
  }

  if [nexus_password] != "" {
    mutate {
      convert => {
        "nexus_password" => "string"
      }
      on_error => "nexus_password_already_string"
    }
    mutate {
      replace => {
        "password.key" => "Password"
        "password.value.string_value" => "%{nexus_password}"
      }
      on_error => "invalid_password"
    }
    mutate {
      merge => {
        "additional.fields" => "password"
      }
    }
  }

  if [nexus_protocol] != "" {
    mutate {
      convert => {
        "nexus_protocol" => "string"
      }
      on_error => "nexus_protocol_already_string"
    }
    mutate {
      replace => {
        "protocol.key" => "Protocol"
        "protocol.value.string_value" => "%{nexus_protocol}"
      }
      on_error => "invalid_protocol"
    }
    mutate {
      merge => {
        "additional.fields" => "protocol"
      }
    }
  }

  if [api_name] != "" {
    mutate {
      convert => {
        "api_name" => "string"
      }
      on_error => "api_name_already_string"
    }
    mutate {
      replace => {
        "api_name_label.key" => "API Name"
        "api_name_label.value.string_value" => "%{api_name}"
      }
      on_error => "invalid_api_name"
    }
    mutate {
      merge => {
        "additional.fields" => "api_name_label"
      }
    }
  }

  if [login_time] != "" {
    mutate {
      convert => {
        "login_time" => "string"
      }
      on_error => "login_time_already_string"
    }
    mutate {
      replace => {
        "login_time_label.key" => "Login Time"
        "login_time_label.value.string_value" => "%{login_time}"
      }
      on_error => "invalid_login_time"
    }
    mutate {
      merge => {
        "additional.fields" => "login_time_label"
      }
    }
  }

  if [task_details] != "" {
    mutate {
      convert => {
        "task_details" => "string"
      }
      on_error => "task_details_already_string"
    }
    mutate {
      replace => {
        "task_detail.key" => "Task Details"
        "task_detail.value.string_value" => "%{task_details}"
      }
      on_error => "invalid_task_details"
    }
    mutate {
      merge => {
        "additional.fields" => "task_detail"
      }
    }
  }

  if [collect_startup_config] != "" {
    mutate {
      replace => {
        "security_result_collect_startup_config_label.key" => "Collect Startup Config"
        "security_result_collect_startup_config_label.value" => "%{collect_startup_config}"
      }
      on_error => "invalid_collect_startup_config"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "security_result_collect_startup_config_label"
      }
    }
  }

  if [enable_command_set] != "" {
    mutate {
      replace => {
        "enable_command_set_label.key" => "Enable Command Set"
        "enable_command_set_label.value" => "%{enable_command_set}"
      }
      on_error => "invalid_enable_command_set"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "enable_command_set_label"
      }
    }
  }

  if [get_configuration_command_set] != "" {
    mutate {
      replace => {
        "get_configuration_command_set_label.key" => "Get Configuration Command Set"
        "get_configuration_command_set_label.value" => "%{get_configuration_command_set}"
      }
      on_error => "invalid_get_configuration_command_set"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "get_configuration_command_set_label"
      }
    }
  }

  if [import_dynamic_routes] != "" {
    mutate {
      replace => {
        "import_dynamic_routes_label.key" => "Import Dynamic Routes"
        "import_dynamic_routes_label.value" => "%{import_dynamic_routes}"
      }
      on_error => "invalid_import_dynamic_routes"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "import_dynamic_routes_label"
      }
    }
  }

  if [is_run_over_latest_ssh_library] != "" {
    mutate {
      replace => {
        "is_run_over_latest_ssh_library_label.key" => "Is Run Over SSH Library"
        "is_run_over_latest_ssh_library_label.value" => "%{is_run_over_latest_ssh_library}"
      }
      on_error => "invalid_is_run_over_latest_ssh_library"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "is_run_over_latest_ssh_library_label"
      }
    }
  }

  if [location_hint] != "" {
    mutate {
      replace => {
        "location_hint_label.key" => "Location Hint"
        "location_hint_label.value" => "%{location_hint}"
      }
      on_error => "invalid_location_hint"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "location_hint_label"
      }
    }
  }

  if [object] != "" {
    mutate {
      replace => {
        "object_label.key" => "Is Object"
        "object_label.value" => "%{object}"
      }
      on_error => "invalid_object"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "object_label"
      }
    }
  }

  if [safe] != "" {
    mutate {
      replace => {
        "safe_label.key" => "Is Safe"
        "safe_label.value" => "%{safe}"
      }
      on_error => "invalid_safe"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "safe_label"
      }
    }
  }

  if [vulnebralities_ids] != "" {
    mutate {
      replace => {
        "vulnebrality_label.key" => "Vulnebralities"
        "vulnebrality_label.value" => "%{vulnebralities_ids}"
      }
      on_error => "invalid_vulnebrality"
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "vulnebrality_label"
      }
    }
  }

  if [msg] =~ "(?i)User_Management Login" {
    if [principal] != "" and [target] != "" {
      mutate {
        replace => {
          "extension_mechanism" => "UNLOCK"
          "event.idm.read_only_udm.extensions.auth.type" => "MACHINE"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.extensions.auth.mechanism" => "extension_mechanism"
        }
      }
      mutate {
        replace => {
          "event_type" => "USER_LOGIN"
        }
      }
    }
  }
  else if [event_type] == "" and ([has_principal_ip] != "false" or [has_principal_port] != "false" or [host_name] != "") {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
    }
  } else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "SKYBOX_FIREWALL_ASSURANCE"
      "metadata.vendor_name" => "SKYBOX"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }


  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
