# Product: NETSCOUT_OCI
# Category: Alert log
# Supported Format: SYSLOG + KV
# Reference: See below
# Last Updated: 2024-02-21
# Copyright 2024 Chronicle LLC


filter {
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "additional" => ""
      "security_result" => ""
      "vuln" => ""
      "event_type" => ""
      "version" => ""
      "device_vendor" => ""
      "device_product" => ""
      "device_version" => ""
      "security_rule_name" => ""
      "event_name" => ""
      "severity" => ""
      "cef_extension" => ""
      "type" => ""
      "desc" => ""
      "dvchost" => ""
      "dvc" => ""
      "OmnisSecurityHostType" => ""
      "HostGroupCount" => ""
      "HostGroup" => ""
      "dhost" => ""
      "shost" => ""
      "dst" => ""
      "src" => ""
      "IOCSeverity" => ""
      "IOCConfidence" => ""
      "c6a1" => ""
      "c6a1Label" => ""
      "UserIdentity" => ""
      "App" => ""
      "OmnisSecurityHostCount" => ""
      "OmnisSecurityInterfaceCount" => ""
      "OmnisSecurityViolationCount" => ""
      "start" => ""
      "end" => ""
      "OmnisSecurityUrl" => ""
      "remoteGeolocation" => ""
      "serverPort" => ""
      "target_ip" => ""
      "target_host" => ""
      "target_url" => ""
      "target_port" => ""
      "has_principal_machine" => "false"
      "has_target_machine" => "false"
      "mitreTactic" => ""
      "mitreTechnique" => ""
      "srcCount" => ""
      "dstCount" => ""
      "srcHostGroupCount" => ""
      "dstHostGroupCount" => ""
      "iocDescription" => ""
      "src_iporhost" => ""
      "interfaceCount" => ""
      "violationCount" => ""
      "dstHostGroup" => ""
      "srcHostGroup" => ""
      "Policy" => ""
      "Classification" => ""
      "Category" => ""
      "desc_kv_data" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "<%{INT}>CEF:%{INT:version}\\|%{DATA:device_vendor}\\|%{DATA:device_product}\\|%{DATA:device_version}\\|%{DATA:security_rule_name}\\|%{IPORHOST:src_iporhost}\\|(?P<severity>%{WORD}|%{INT})\\|%{GREEDYDATA:cef_extension}"
        "(%{GREEDYDATA})?CEF:%{INT:version}\\|%{DATA:device_vendor}\\|%{DATA:device_product}\\|%{DATA:device_version}\\|%{DATA:security_rule_name}\\|%{DATA:event_name}\\|(?P<severity>Medium|MEDIUM|Low|LOW|HIGH|High|Unknown|%{INT})\\|%{GREEDYDATA:cef_extension}"
      ]
    }
    overwrite => ["version", "device_vendor", "device_product", "device_version", "security_rule_name", "event_name", "severity", "cef_extension","src_iporhost"]
    on_error => "grok_pattern_failed"
  }

  if [grok_pattern_failed] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [device_version] == "6.3.5" {
    mutate {
      gsub => ["cef_extension"," iocConfidence="," IOCConfidence="]
    }
    mutate {
      gsub => ["cef_extension"," app="," App="]
    }
    mutate {
      gsub => ["cef_extension"," url="," OmnisSecurityUrl="]
    }
    mutate {
      gsub => ["cef_extension"," userIdentity=", " UserIdentity="]
    }
  }
  mutate {
    gsub => ["cef_extension", "(\\\s+)([0-9a-zA-Z_.-]+?)=", "^$2="]
  }

  kv {
    source => "cef_extension"
    field_split => "^"
    value_split => "="
    whitespace => "strict"
    on_error => "not_kv"
  }

  if [not_kv] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }

  if [device_version] != "" {
    mutate {
      replace => {
        "metadata.product_version" => "%{device_version}"
      }
      on_error => "no_device_version"
    }
  }

  if [severity] in ["1", "HIGH"] {
    mutate {
      replace => {
        "security_result.severity" => "CRITICAL"
      }
    }
  }
  else if [severity] in ["2", "3", "MEDIUM"] {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
    }
  }
  else if [severity] in ["4","5","6","7","8","9","LOW"] {
    mutate {
      replace => {
        "security_result.severity" => "LOW"
      }
    }
  }

  if [security_rule_name] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{security_rule_name}"
      }
      on_error => "no_security_rule_name"
    }
  }

  if [event_name] != "" {
    mutate {
      merge => {
        "security_result.category_details" => "event_name"
      }
      on_error => "no_event_name"
    }
  }

  if [type] != "" {
    if [type] == "0" {
      mutate {
        replace => {
          "metadata.product_event_type" => "%{type} - Base event"
        }
        on_error => "no_type"
      }
    }
    else if [type] == "1" {
      mutate {
        replace => {
          "metadata.product_event_type" => "%{type} - Aggregate event"
        }
        on_error => "no_type"
      }
    }
  }

  if [desc] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{desc}"
      }
      on_error => "no_desc"
    }
    grok {
      match => {
        "desc" => [
          "%{DATA} IP/Url:%{IPORHOST}\\(%{GREEDYDATA:desc_kv_data}\\) %{GREEDYDATA}",
          "%{DATA}:%{IPORHOST}\\(%{GREEDYDATA:desc_kv_data}\\)%{GREEDYDATA}"
        ]
      }
      on_error => "invalid_desc_grok"
      overwrite => ["desc_kv_data"]
    }
  }

  if [desc_kv_data] != "" {
    kv {
      source => "desc_kv_data"
      field_split => ";"
      value_split => ":"
      on_error => "invalid_kv_desc"
    }
  }

  if [iocDescription] != "" {
    grok {
      match => {
        "iocDescription" => "\\(%{GREEDYDATA:iocDescription}\\)"
      }
      on_error => "no_ioc_desc"
      overwrite => ["iocDescription"]
    }
    mutate {
      replace => {
        "security_result.description" => "%{iocDescription}"
      }
      on_error => "no_iocDescription"
    }
  }

  if [type] == "0" {
    if [dvchost] != "" {
      grok {
        match => {
          "dvchost" => "%{IP:dvchost}"
        }
        overwrite => ["dvchost"]
        on_error => "not_ip"
      }
      if ![not_ip] {
        mutate {
          merge => {
            "principal.ip" => "dvchost"
            "principal.asset.ip" => "dvchost"
          }
          replace => {
            "has_principal_machine" => "true"
          }
          on_error => "not_ip"
        }
      }
      else {
        mutate {
          replace => {
            "principal.hostname" => "%{dvchost}"
            "principal.asset.hostname" => "%{dvchost}"
            "has_principal_machine" => "true"
          }
          on_error => "no_hostname"
        }
      }
    }
    else if [dvc] != "" {
      grok {
        match => {
          "dvc" => "%{IP:dvc}"
        }
        overwrite => ["dvc"]
        on_error => "not_ip"
      }
      if ![not_ip] {
        mutate {
          merge => {
            "principal.ip" => "dvc"
            "principal.asset.ip" => "dvc"
          }
          replace => {
            "has_principal_machine" => "true"
          }
          on_error => "not_ip"
        }
      }
      else {
        mutate {
          replace => {
            "principal.hostname" => "%{dvc}"
            "principal.asset.hostname" => "%{dvc}"
            "has_principal_machine" => "true"
          }
          on_error => "no_hostname"
        }
      }
    }
    else if [shost] != "" and ([shost] == src or [src] == "") {
      grok {
        match => {
          "shost" => "%{IP:shost}"
        }
        overwrite => ["shost"]
        on_error => "not_ip"
      }
      if ![not_ip] {
        mutate {
          merge => {
            "principal.ip" => "shost"
            "principal.asset.ip" => "shost"
          }
          replace => {
            "has_principal_machine" => "true"
          }
          on_error => "not_ip"
        }
      }
      else {
        mutate {
          replace => {
            "principal.hostname" => "%{shost}"
            "principal.asset.hostname" => "%{shost}"
            "has_principal_machine" => "true"
          }
          on_error => "no_hostname"
        }
      }
    }
    else if [shost] != "" and [shost] != src and [src] != "" {
      grok {
        match => {
          "shost" => "%{IP:shost}"
        }
        overwrite => ["shost"]
        on_error => "not_src_ip"
      }
      if ![not_src_ip] {
        mutate {
          merge => {
            "principal.ip" => "shost"
            "principal.asset.ip" => "shost"
          }
          replace => {
            "has_principal_machine" => "true"
          }
          on_error => "not_ip"
        }
      }
      else {
        mutate {
          replace => {
            "principal.hostname" => "%{shost}"
            "principal.asset.hostname" => "%{shost}"
            "has_principal_machine" => "true"
          }
          on_error => "no_hostname"
        }
      }

      grok {
        match => {
          "src" => "%{IP:src}"
        }
        overwrite => ["src"]
        on_error => "not_ip"
      }
      if ![not_ip] {
        mutate {
          merge => {
            "principal.ip" => "src"
            "principal.asset.ip" => "src"
          }
          replace => {
            "has_principal_machine" => "true"
          }
          on_error => "not_ip"
        }
      }
      else {
        mutate {
          replace => {
            "principal.hostname" => "%{src}"
            "principal.asset.hostname" => "%{src}"
            "has_principal_machine" => "true"
          }
          on_error => "no_hostname"
        }
      }
    }
    else if [src] != "" {
      grok {
        match => {
          "src" => "%{IP:src}"
        }
        overwrite => ["src"]
        on_error => "not_ip"
      }
      if ![not_ip] {
        mutate {
          merge => {
            "principal.ip" => "src"
            "principal.asset.ip" => "src"
          }
          replace => {
            "has_principal_machine" => "true"
          }
          on_error => "not_ip"
        }
      }
      else {
        mutate {
          replace => {
            "principal.hostname" => "%{src}"
            "principal.asset.hostname" => "%{src}"
            "has_principal_machine" => "true"
          }
          on_error => "no_hostname"
        }
      }
    }
    else if [src_iporhost] != "" {
      grok {
        match => {
          "src_iporhost" => "%{IP:src_ip}"
        }
        on_error => "invalid_ip"
      }
      if ![invalid_ip] {
        mutate {
          merge => {
            "principal.ip" => "src_iporhost"
            "principal.asset.ip" => "src_iporhost"
          }
          on_error => "no_src_ip"
        }
      }
      else {
        mutate {
          replace => {
            "principal.hostname" => "src_iporhost"
            "principal.asset.hostname" => "src_iporhost"
          }
          on_error => "no_src_hostname"
        }
      }
      mutate {
        replace => {
          "has_principal_machine" => "true"
        }
      }
    }
  }
  if [type] == "1" {
    if [src_iporhost] != "" {
      grok {
        match => {
          "src_iporhost" => "%{IP:src_ip}"
        }
        on_error => "invalid_ip"
      }
      if ![invalid_ip] {
        mutate {
          merge => {
            "principal.ip" => "src_iporhost"
            "principal.asset.ip" => "src_iporhost"
          }
          on_error => "no_src_ip"
        }
      }
      else {
        mutate {
          replace => {
            "principal.hostname" => "%{src_iporhost}"
            "principal.asset.hostname" => "%{src_iporhost}"
          }
          on_error => "no_src_hostname"
        }
      }
      mutate {
        replace => {
          "has_principal_machine" => "true"
        }
      }
    }
  }

  if [dhost] != "" {
    grok {
      match => {
        "dhost" => "%{IP:dhost}"
      }
      overwrite => ["dhost"]
      on_error => "not_ip"
    }
    if ![not_ip] {
      mutate {
        merge => {
          "target.ip" => "dhost"
          "target.asset.ip" => "dhost"
        }
        on_error => "not_ip"
      }
    }
    else {
      mutate {
        replace => {
          "target.hostname" => "%{dhost}"
          "target.asset.hostname" => "%{dhost}"
        }
        on_error => "no_hostname"
      }
    }
  }
  if [dst] != "" and [dst] != dhost {
    grok {
      match => {
        "dst" => "%{IP:dst}"
      }
      overwrite => ["dst"]
      on_error => "not_ip"
    }
    if ![not_ip] {
      mutate {
        merge => {
          "target.ip" => "dst"
          "target.asset.ip" => "dst"
        }
        on_error => "not_ip"
      }
    }
    else {
      mutate {
        replace => {
          "target.hostname" => "%{dst}"
          "target.asset.hostname" => "%{dst}"
        }
        on_error => "no_hostname"
      }
    }
  }

  if [OmnisSecurityHostType] != "" {
    mutate {
      replace => {
        "OmnisSecurityHostType_label.key" => "OmnisSecurityHostType"
        "OmnisSecurityHostType_label.value" => "%{OmnisSecurityHostType}"
      }
      merge => {
        "security_result.detection_fields" => "OmnisSecurityHostType_label"
      }
      on_error => "no_OmnisSecurityHostType"
    }
  }

  if [HostGroupCount] != "" {
    mutate {
      replace => {
        "HostGroupCount_label.key" => "HostGroupCount"
        "HostGroupCount_label.value" => "%{HostGroupCount}"
      }
      merge => {
        "security_result.detection_fields" => "HostGroupCount_label"
      }
      on_error => "no_HostGroupCount"
    }
  }

  if [HostGroup] != "" {
    mutate {
      replace => {
        "HostGroup_label.key" => "HostGroup"
        "HostGroup_label.value" => "%{HostGroup}"
      }
      merge => {
        "security_result.detection_fields" => "HostGroup_label"
      }
      on_error => "no_HostGroup"
    }
  }

  if [IOCSeverity] != "" {
    mutate {
      replace => {
        "IOCSeverity_label.key" => "IOCSeverity"
        "IOCSeverity_label.value" => "%{IOCSeverity}"
      }
      merge => {
        "security_result.detection_fields" => "IOCSeverity_label"
      }
      on_error => "no_IOCSeverity"
    }
  }

  if [IOCConfidence] != "" {
    mutate {
      replace => {
        "IOCConfidence_label.key" => "IOCConfidence"
        "IOCConfidence_label.value" => "%{IOCConfidence}"
      }
      merge => {
        "security_result.detection_fields" => "IOCConfidence_label"
      }
      on_error => "no_IOCConfidence"
    }
  }

  if [OmnisSecurityHostCount] != "" {
    mutate {
      replace => {
        "OmnisSecurityHostCount_label.key" => "OmnisSecurityHostCount"
        "OmnisSecurityHostCount_label.value" => "%{OmnisSecurityHostCount}"
      }
      merge => {
        "security_result.detection_fields" => "OmnisSecurityHostCount_label"
      }
      on_error => "no_OmnisSecurityHostCount"
    }
  }

  if [OmnisSecurityInterfaceCount] != "" {
    mutate {
      replace => {
        "OmnisSecurityInterfaceCount_label.key" => "OmnisSecurityInterfaceCount"
        "OmnisSecurityInterfaceCount_label.value" => "%{OmnisSecurityInterfaceCount}"
      }
      merge => {
        "security_result.detection_fields" => "OmnisSecurityInterfaceCount_label"
      }
      on_error => "no_OmnisSecurityInterfaceCount"
    }
  }

  if [OmnisSecurityViolationCount] != "" {
    mutate {
      replace => {
        "OmnisSecurityViolationCount_label.key" => "OmnisSecurityViolationCount"
        "OmnisSecurityViolationCount_label.value" => "%{OmnisSecurityViolationCount}"
      }
      merge => {
        "security_result.detection_fields" => "OmnisSecurityViolationCount_label"
      }
      on_error => "no_OmnisSecurityViolationCount"
    }
  }

  if [App] != "" {
    mutate {
      replace => {
        "App_label.key" => "App"
        "App_label.value" => "%{App}"
      }
      merge => {
        "security_result.detection_fields" => "App_label"
      }
      on_error => "no_App"
    }
  }

  if [App] != "" {
    mutate {
      replace => {
        "target.application" => "%{App}"
      }
      on_error => "no_application"
    }
  }

  if [UserIdentity] != "" {
    mutate {
      replace => {
        "UserIdentity_label.key" => "UserIdentity"
        "UserIdentity_label.value" => "%{UserIdentity}"
      }
      merge => {
        "security_result.detection_fields" => "UserIdentity_label"
      }
      on_error => "no_UserIdentity"
    }
  }

  if [remoteGeolocation] != "" {
    mutate {
      replace => {
        "target.location.name" => "%{remoteGeolocation}"
      }
      on_error => "no_remoteGeolocation"
    }
  }

  if [serverPort] != "" {
    mutate {
      convert => {
        "serverPort" => "integer"
      }
      on_error => "conversion_failed"
    }
    mutate {
      rename => {
        "serverPort" => "principal.port"
      }
    }
  }

  if [OmnisSecurityUrl] != "" {
    mutate {
      replace => {
        "target.url" => "%{OmnisSecurityUrl}"
      }
      on_error => "no_OmnisSecurityUrl"
    }
    grok {
      match => {
        "OmnisSecurityUrl" => "https://%{DATA:target_url}/.*"
      }
      overwrite => ["target_url"]
      on_error => "pattern_not_matched"
    }
    if ![pattern_not_matched] {
      grok {
        match => {
          "target_url" => [
            "%{IP:target_ip}:%{INT:target_port}"
            "%{DATA:target_host}:%{INT:target_port}"
          ]
        }
        on_error => "grok_failed"
        overwrite => ["target_ip", "target_host", "target_port"]
      }
      if ![grok_failed] {
        if [target_ip] != "" {
          mutate {
            merge => {
              "target.ip" => "target_ip"
              "target.asset.ip" => "target_ip"
            }
            replace => {
              "has_target_machine" => "true"
            }
            on_error => "no_ip"
          }
        }
        else if [target_host] != "" {
          mutate {
            replace => {
              "target.hostname" => "%{target_host}"
              "target.asset.hostname" => "%{target_host}"
              "has_target_machine" => "true"
            }
            on_error => "no_host"
          }
        }
      }
      if [target_port] != "" {
        mutate {
          convert => {
            "target_port" => "integer"
          }
          on_error => "conversion_failed"
        }
        mutate {
          rename => {
            "target_port" => "target.port"
          }
        }
      }
    }
  }

  if [start] != "" {
    date {
      match => ["start", "UNIX_MS"]
      target => "vuln.scan_start_time"
      on_error => "invalid_date"
    }
  }
  if [end] != "" {
    date {
      match => ["end", "UNIX_MS"]
      target => "vuln.scan_end_time"
      on_error => "invalid_date"
    }
  }

  if [vuln] != "" and [has_principal_machine] == "true" and [has_target_machine] == "true" {
    mutate {
      replace => {
        "event_type" => "SCAN_VULN_NETWORK"
      }
    }
  }
  else if [has_principal_machine] == "true" {
    mutate {
      replace => {
        "event_type" => "SCAN_NETWORK"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
      on_error => "no_event_type"
    }
  }
  if [device_product] != "" {
    mutate {
      replace => {
        "metadata.product_name" => "%{device_product}"
        "metadata.vendor_name" => "NETSCOUT"
      }
      on_error => "no_device_product"
    }
  }

  if [mitreTactic] != "" {
    mutate {
      replace => {
        "mitre_tactic_label.value" => "%{mitreTactic}"
        "mitre_tactic_label.key" => "mitreTactic"
      }
      on_error => "no_mitre_tactic"
    }
    if ![no_mitre_tactic] {
      mutate {
        merge => {
          "security_result.detection_fields" => "mitre_tactic_label"
        }
        on_error => "no_mitre_tactic_label"
      }
    }
  }

  if [mitreTechnique] != "" {
    mutate {
      replace => {
        "mitre_technique_label.value" => "%{mitreTechnique}"
        "mitre_technique_label.key" => "mitreTechnique"
      }
      on_error => "no_mitre_technique"
    }
    if ![no_mitre_technique] {
      mutate {
        merge => {
          "security_result.detection_fields" => "mitre_technique_label"
        }
        on_error => "no_mitre_technique_label"
      }
    }
  }

  if [srcCount] != "" {
    mutate {
      replace => {
        "src_count_label.value" => "%{srcCount}"
        "src_count_label.key" => "srcCount"
      }
      on_error => "no_src_count"
    }
    if ![no_src_count] {
      mutate {
        merge => {
          "security_result.detection_fields" => "src_count_label"
        }
        on_error => "no_src_count_label"
      }
    }
  }

  if [dstCount] != "" {
    mutate {
      replace => {
        "dst_count_label.value" => "%{dstCount}"
        "dst_count_label.key" => "dstCount"
      }
      on_error => "no_dst_count"
    }
    if ![no_dst_count] {
      mutate {
        merge => {
          "security_result.detection_fields" => "dst_count_label"
        }
        on_error => "no_dst_count_label"
      }
    }
  }

  if [srcHostGroupCount] != "" {
    mutate {
      replace => {
        "src_host_group_label.value" => "%{srcHostGroupCount}"
        "src_host_group_label.key" => "srcHostGroupCount"
      }
      on_error => "no_src_host_group"
    }
    if ![no_src_host_group] {
      mutate {
        merge => {
          "security_result.detection_fields" => "src_host_group_label"
        }
        on_error => "no_src_host_group_label"
      }
    }
  }

  if [dstHostGroupCount] != "" {
    mutate {
      replace => {
        "dst_host_group_label.value" => "%{dstHostGroupCount}"
        "dst_host_group_label.key" => "dstHostGroupCount"
      }
      on_error => "no_dst_host_group"
    }
    if ![no_dst_host_group] {
      mutate {
        merge => {
          "security_result.detection_fields" => "dst_host_group_label"
        }
        on_error => "no_dst_host_group_label"
      }
    }
  }

  if [interfaceCount] != "" {
    mutate {
      replace => {
        "interfaceCount_label.value" => "%{interfaceCount}"
        "interfaceCount_label.key" => "interfaceCount"
      }
      on_error => "no_interfaceCount"
    }
    if ![no_interfaceCount] {
      mutate {
        merge => {
          "security_result.detection_fields" => "interfaceCount_label"
        }
        on_error => "no_interfaceCount_label"
      }
    }
  }

  if [violationCount] != "" {
    mutate {
      replace => {
        "violationCount_label.value" => "%{violationCount}"
        "violationCount_label.key" => "violationCount"
      }
      on_error => "no_violationCount"
    }
    if ![no_violationCount] {
      mutate {
        merge => {
          "security_result.detection_fields" => "violationCount_label"
        }
        on_error => "no_violationCount_label"
      }
    }
  }

  if [dstHostGroup] != "" {
    mutate {
      replace => {
        "dstHostGroup_label.value" => "%{dstHostGroup}"
        "dstHostGroup_label.key" => "dstHostGroup"
      }
      on_error => "no_dstHostGroup"
    }
    if ![no_dstHostGroup] {
      mutate {
        merge => {
          "security_result.detection_fields" => "dstHostGroup_label"
        }
        on_error => "no_dstHostGroup_label"
      }
    }
  }

  if [srcHostGroup] != "" {
    mutate {
      replace => {
        "srcHostGroup_label.value" => "%{srcHostGroup}"
        "srcHostGroup_label.key" => "srcHostGroup"
      }
      on_error => "no_srcHostGroup"
    }
    if ![no_srcHostGroup] {
      mutate {
        merge => {
          "security_result.detection_fields" => "srcHostGroup_label"
        }
        on_error => "no_srcHostGroup_label"
      }
    }
  }

  if [Policy] != "" {
    mutate {
      replace => {
        "policy_label.value.string_value" => "%{Policy}"
        "policy_label.key" => "Policy"
      }
      on_error => "no_policy"
    }
    if ![no_policy] {
      mutate {
        merge => {
          "additional.fields" => "policy_label"
        }
        on_error => "no_policy_label"
      }
    }
  }

  if [Category] != "" {
    mutate {
      merge => {
        "security_result.category_details" => "Category"
      }
      on_error => "no_category"
    }
  }

  if [Classification] != "" {
    mutate {
      replace => {
        "classification_label.value.string_value" => "%{Classification}"
        "classification_label.key" => "Classification"
      }
      on_error => "no_classification"
    }
    if ![no_classification] {
      mutate {
        merge => {
          "additional.fields" => "classification_label"
        }
        on_error => "no_classification_label"
      }
    }
  }

  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [vuln] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.extensions.vulns.vulnerabilities" => "vuln"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

