# Product: SANGFOR_PROXY
# Category: Application server logs
# Supported Format: SYSLOG
# Reference: N/A
# Last Updated: 2025-02-18
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "principal" => ""
      "metadata" => ""
      "additional" => ""
      "target" => ""
      "security_result" => ""
      "network" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "has_user" => "false"
      "timestamp" => ""
      "port" => ""
      "log_type" => ""
      "record_time" => ""
      "username" => ""
      "group" => ""
      "host_ip" => ""
      "dst_ip" => ""
      "serv" => ""
      "app" => ""
      "site" => ""
      "tm_type" => ""
      "uncommon_data" => ""
      "up_flux" => ""
      "down_flux" => ""
      "net_action" => ""
      "url" => ""
      "dns" => ""
      "file_name" => ""
      "file_type" => ""
      "title" => ""
      "snapshot" => ""
      "dns_answers" => ""
      "risk_level" => ""
      "virus" => ""
      "identify" => ""
      "category" => ""
      "host" => ""
      "family" => ""
      "nProtocol" => ""
      "src_port" => ""
      "ioc_id" => ""
    }
  }
  mutate {
    gsub => ["message", " \\n", ""]
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} localhost BA\\[%{DATA:port}\\]: \\[log_type:%{DATA:log_type}\\] \\[record_time:%{TIMESTAMP_ISO8601:record_time}\\] \\[log_type:%{DATA:log_type}\\] \\[usr_name:%{USERNAME:username}\\] \\[grp_name:%{DATA:grp_name}\\] \\[hst_ip:%{IPV4:host_ip}\\] \\[login_time:%{DATA:login_time}\\] \\[online_time:%{DATA:online_time}\\]",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} localhost BA\\[%{DATA:port}\\]: \\[log_type:%{DATA:log_type}\\] \\[record_time:%{TIMESTAMP_ISO8601:record_time}\\] \\[user:%{USERNAME:username}\\] \\[group:%{DATA:group}\\] \\[host_ip:%{IPV4:host_ip}\\] \\[dst_ip:%{DATA:dst_ip}\\] \\[serv:%{DATA:serv}\\] \\[app:%{DATA:app}\\] \\[site:%{DATA:site}\\] \\[tm_type:%{DATA:tm_type}\\] %{GREEDYDATA:uncommon_data}",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} localhost BA\\[%{DATA:port}\\]: \\[log_type:%{DATA:log_type}\\] \\[record_time:%{TIMESTAMP_ISO8601:record_time}\\] \\[user:%{USERNAME:username}\\] \\[group:%{DATA:group}\\] \\[host_ip:%{IPV4:host_ip}\\] \\[dst_ip:%{DATA:dst_ip}\\] \\[serv:%{DATA:serv}\\] \\[site:%{DATA:site}\\] \\[tm_type:%{DATA:tm_type}\\] %{GREEDYDATA:uncommon_data}",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} localhost BA\\[%{DATA:port}\\]: \\[log_type:%{DATA:log_type}\\] \\[record_time:%{TIMESTAMP_ISO8601:record_time}\\] \\[usr_name:%{USERNAME:username}\\] \\[hst_ip:%{IPV4:host_ip}\\] \\[dst_ip:%{DATA:dst_ip}\\] \\[site:%{DATA:site}\\] \\[tm_type:%{DATA:tm_type}\\] \\[serv_port:%{DATA:serv}\\] \\[risk_level:%{DATA:risk_level}\\] \\[net_action:%{DATA:net_action}\\] \\[virus:%{DATA:virus}\\] \\[url:%{DATA:url}\\] \\[identify:%{DATA:identify}\\] \\[category:%{DATA:category}\\] \\[host:%{DATA:host}\\] \\[family:%{DATA:family}\\] \\[nProtocol:%{DATA:nProtocol}\\] \\[src_port:%{DATA:src_port}\\] \\[ioc_id:%{DATA}\\]",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} localhost BA\\[%{DATA:port}\\]: \\[log_type:%{DATA:log_type}\\] \\[record_time:%{TIMESTAMP_ISO8601:record_time}\\] \\[usr_name:%{USERNAME:username}\\] \\[hst_ip:%{IPV4:host_ip}\\] \\[dst_ip:%{DATA:dst_ip}\\] \\[site:%{DATA:site}\\] \\[tm_type:%{DATA:tm_type}\\] \\[serv_port:%{DATA:serv}\\] \\[risk_level:%{DATA:risk_level}\\] \\[net_action:%{DATA:net_action}\\] \\[virus:%{DATA:virus}\\] \\[url:%{DATA:url}\\] \\[category:%{DATA:category}\\] \\[host:%{DATA:host}\\] \\[family:%{DATA:family}\\] \\[nProtocol:%{DATA:nProtocol}\\] \\[src_port:%{DATA:src_port}\\] \\[ioc_id:%{DATA}\\]",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} localhost BA\\[%{DATA:port}\\]: \\[log_type:%{DATA:log_type}\\] \\[record_time:%{DATA:record_time}\\]"

      ]
    }
    overwrite => ["timestamp", "port", "log_type", "record_time", "username", "group", "host_ip", "dst_ip", "serv", "app", "site", "tm_type", "uncommon_data", "risk_level", "net_action", "virus", "url", "identify", "category", "host", "family", "nProtocol", "src_port", "ioc_id"]
    on_error => "grok_error"
  }

  if [port] != "" {
    mutate {
      convert => {
        "port" => "integer"
      }
      on_error => "port_error"
    }
    if ![port_error] {
      mutate {
        rename => {
          "port" => "target.port"
        }
        on_error => "port_error"
      }
    }
  }

  if [log_type] != "" {
    mutate {
      replace => {
        "log_type_label.key" => "log_type"
        "log_type_label.value.string_value" => "%{log_type}"
      }
      on_error => "log_type_error"
    }
    if ![log_type_error] {
      mutate {
        merge => {
          "additional.fields" => "log_type_label"
        }
        on_error => "log_type_label_error"
      }
    }
  }

  if [record_time] != "" {
    date {
      match => ["record_Timestamp", "RFC3339"]
      target => "metadata_token.event_timestamp"
      on_error => "no_timestamp"
    }
  }

  if [username] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{username}"
        "has_user" => "true"
      }
      on_error => "no_username"
    }
  }

  if [group] != "" {
    mutate {
      replace => {
        "principal.group.group_display_name" => "%{group}"
      }
      on_error => "no_group"
    }
  }

  if [host_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "host_ip"
        "principal.asset.ip" => "host_ip"
      }
      on_error => "no_host_ip"
    }
    if ![no_host_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [dst_ip] not in ["","::"] {
    grok {
      match => {
        "dst_ip" => [ "%{IP:dst_ip}" ]
      }
      overwrite => ["dst_ip"]
      on_error => "dst_ip_failure"
    }
    if ![dst_ip_failure] {
      mutate {
        merge => {
          "target.ip" => "dst_ip"
          "target.asset.ip" => "dst_ip"
        }
        on_error => "no_dst_ip"
      }
      if ![no_dst_ip] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }
  }

  if [serv] != "" {
    mutate {
      replace => {
        "serv_label.key" => "serv"
        "serv_label.value.string_value" => "%{serv}"
      }
      on_error => "no_serv"
    }
    if ![no_serv] {
      mutate {
        merge => {
          "additional.fields" => "serv_label"
        }
        on_error => "serv_label_error"
      }
    }
  }

  if [app] != "" {
    mutate {
      replace => {
        "target.application" => "%{app}"
      }
      on_error => "no_app"
    }
  }

  if [site] not in ["", "Not specified"] {
    mutate {
      replace => {
        "site_label.key" => "site"
        "site_label.value" => "%{site}"
      }
      on_error => "no_site"
    }
    if ![no_site] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "site_label"
        }
        on_error => "site_label_error"
      }
    }
  }

  if [tm_type] =~ "Win" {
    mutate {
      replace => {
        "target.platform" => "WINDOWS"
      }
    }
  }
  else if [tm_type] =~ "Mac" {
    mutate {
      replace => {
        "target.platform" => "MAC"
      }
    }
  }
  else if [tm_type] == "Linux" {
    mutate {
      replace => {
        "target.platform" => "LINUX"
      }
    }
  }

  grok {
    match => {
      "uncommon_data" => [
        "\\[up_flux:%{DATA:up_flux}\\] \\[down_flux:%{DATA:down_flux}\\]",
        "\\[net_action:%{DATA:net_action}\\] \\[url:%{DATA:url}\\] \\[DNS:%{DATA:dns}\\] \\[filename:%{DATA:file_name}\\] \\[filetype:%{DATA:file_type}\\]",
        "\\[net_action:%{DATA:net_action}\\] \\[url:%{DATA:url}\\] \\[DNS:%{DATA:dns}\\] \\[title:%{DATA:title}\\] \\[snapshot:%{DATA:snapshot}\\]"
      ]
    }
    overwrite => ["up_flux", "down_flux", "net_action", "url", "dns", "file_name", "file_type", "title", "snapshot"]
    on_error => "uncommon_data_error"
  }

  if [up_flux] != "" {
    mutate {
      rename => {
        "up_flux" => "network.sent_bytes"
      }
      on_error => "no_up_flux"
    }
    mutate {
      convert => {
        "network.sent_bytes" => "uinteger"
      }
      on_error => "no_up_flux"
    }
  }

  if [down_flux] != "" {
    mutate {
      rename => {
        "down_flux" => "network.received_bytes"
      }
      convert => {
        "network.received_bytes" => "uinteger"
      }
      on_error => "no_down_flux"
    }
  }

  if [net_action] != "" {
    mutate {
      replace => {
        "net_action_label.key" => "net_action"
        "net_action_label.value.string_value" => "%{net_action}"
      }
      on_error => "no_net_action"
    }
    if ![no_net_action] {
      mutate {
        merge => {
          "additional.fields" => "net_action_label"
        }
        on_error => "net_action_label_error"
      }
    }
  }

  if [url] not in ["","-"] {
    mutate {
      replace => {
        "url_label.key" => "url"
        "url_label.value.string_value" => "%{url}"
      }
      on_error => "no_url"
    }
    if ![no_url] {
      mutate {
        merge => {
          "additional.fields" => "url_label"
        }
        on_error => "url_label_error"
      }
    }
  }

  if [dns] != "" {
    mutate {
      replace => {
        "dns_answers.data" => "%{dns}"
      }
      on_error => "no_dns"
    }
  }

  if [file_name] not in ["","-"] {
    mutate {
      replace => {
        "target.process.file.full_path" => "%{file_name}"
      }
      on_error => "no_file_name"
    }
  }

  if [file_type] not in ["","-"] {
    mutate {
      replace => {
        "target.process.file.mime_type" => "%{file_type}"
      }
      on_error => "no_file_type"
    }
  }

  if title not in ["","-"] {
    mutate {
      replace => {
        "title_label.key" => "title"
        "title_label.value.string_value" => "%{title}"
      }
      on_error => "no_title"
    }
    if ![no_title] {
      mutate {
        merge => {
          "additional.fields" => "title_label"
        }
        on_error => "title_label_error"
      }
    }
  }

  if [snapshot] not in ["","-"] {
    mutate {
      replace => {
        "snapshot_label.key" => "snapshot"
        "snapshot_label.value.string_value" => "%{snapshot}"
      }
      on_error => "no_snapshot"
    }
    if ![no_snapshot] {
      mutate {
        merge => {
          "additional.fields" => "snapshot_label"
        }
        on_error => "snapshot_label_error"
      }
    }
  }

  if [risk_level] != "" {
    mutate {
      convert => {
        "risk_level" => "string"
      }
      on_error => "no_risk_level"
    }
    mutate {
      replace => {
        "risk_level_label.key" => "risk_level"
        "risk_level_label.value.string_value" => "%{risk_level}"
      }
      on_error => "no_risk_level"
    }
    if ![no_risk_level] {
      mutate {
        merge => {
          "additional.fields" => "risk_level_label"
        }
        on_error => "risk_level_label_error"
      }
    }
  }

  if [virus] != "" {
    mutate {
      replace => {
        "virus_field.key" => "virus"
        "virus_field.value" => "%{virus}"
      }
      on_error => "no_virus"
    }
    if ![no_virus] {
      mutate {
        merge => {
          "security_result.detection_fields" => "virus_field"
        }
        on_error => "merge_virus_field_failed"
      }
    }
  }

  if [identify] != "" {
    mutate {
      convert => {
        "identify" => "string"
      }
      on_error => "no_identify"
    }
    mutate {
      replace => {
        "identify_label.key" => "identify"
        "identify_label.value.string_value" => "%{identify}"
      }
      on_error => "no_identify"
    }
    if ![no_identify] {
      mutate {
        merge => {
          "additional.fields" => "identify_label"
        }
        on_error => "identify_label_error"
      }
    }
  }

  if [category] != "" {
    mutate {
      replace => {
        "category_label.key" => "category"
        "category_label.value.string_value" => "%{category}"
      }
      on_error => "no_category"
    }
    if ![no_category] {
      mutate {
        merge => {
          "additional.fields" => "category_label"
        }
        on_error => "category_label_error"
      }
    }
  }

  if [host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host}"
        "principal.asset.hostname" => "%{host}"
        "has_user" => "true"
      }
      on_error => "no_host"
    }
  }

  if [family] != "" {
    mutate {
      replace => {
        "family_label.key" => "family"
        "family_label.value.string_value" => "%{family}"
      }
      on_error => "no_family"
    }
    if ![no_family] {
      mutate {
        merge => {
          "additional.fields" => "family_label"
        }
        on_error => "family_label_error"
      }
    }
  }

  if [nProtocol] != "" {
    mutate {
      convert => {
        "nProtocol" => "string"
      }
      on_error => "no_nProtocol"
    }
    mutate {
      replace => {
        "nProtocol_label.key" => "nProtocol"
        "nProtocol_label.value.string_value" => "%{nProtocol}"
      }
      on_error => "no_nProtocol"
    }
    if ![no_nProtocol] {
      mutate {
        merge => {
          "additional.fields" => "nProtocol_label"
        }
        on_error => "nProtocol_label_error"
      }
    }
  }

  if [src_port] != "" {
    mutate {
      convert => {
        "src_port" => "integer"
      }
      on_error => "no_src_port"
    }
    mutate {
      rename => {
        "src_port" => "principal.port"
      }
    }
  }

  if [ioc_id] not in ["","-"] {
    mutate {
      replace => {
        "ioc_id_label.key" => "ioc_id"
        "ioc_id_label.value.string_value" => "%{ioc_id}"
      }
      on_error => "no_ioc_id"
    }
    if ![no_ioc_id] {
      mutate {
        merge => {
          "additional.fields" => "ioc_id_label"
        }
        on_error => "ioc_id_label_error"
      }
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "SANGFOR_PROXY"
      "metadata.product_name" => "SANGFOR_PROXY"
    }
  }


  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
      on_error => "no_principal_and_target"
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
      on_error => "no_principal"
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
      on_error => "no_user"
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
      on_error => "no_event_type"
    }
  }
  if [dns_answers] != "" {
    mutate {
      merge => {
        "network.dns.answers" => "dns_answers"
      }
      on_error => "no_dns_answers"
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_sec_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
