# Product: Forcepoint Mail Relay
# Category: Email Server
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2025-04-09
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "event" => ""
      "kv_data" => ""
      "network" => ""
      "intermediary" => ""
      "security_result" => ""
      "additional" => ""
      "vendor_name" => ""
      "product_name" => ""
      "product_version" => ""
      "identSrc" => ""
      "identHostName" => ""
      "devTime" => ""
      "connectionId" => ""
      "messageId" => ""
      "sender" => ""
      "recipient" => ""
      "subject" => ""
      "srcBytes" => ""
      "trueSrc" => ""
      "from" => ""
      "replyTo" => ""
      "to" => ""
      "cc" => ""
      "deviceDirection" => ""
      "deviceProcessName" => ""
      "act" => ""
      "url" => ""
      "cat" => ""
      "virus" => ""
      "fnameAndfileHash" => ""
      "deviceFacility" => ""
      "hybridSpamScore" => ""
      "localSpamScore" => ""
      "exceptionReason" => ""
      "x-mailer" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "has_network_email" => "false"
      "product_event_type" => ""
      "src" => ""
      "summary" => ""
      "action1" => ""
      "dst" => ""
    }
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP} %{HOSTNAME} LEEF:%{DATA}\\|%{DATA:vendor_name}\\|%{DATA:product_name}\\|%{DATA:product_version}\\|%{DATA:product_event_type}\\|%{WORD:summary}%{GREEDYDATA:kv_data}"
      ]
    }
    overwrite => ["vendor_name","product_name","product_version","kv_data","product_event_type", "summary"]
    on_error => "grok_failed"
  }

  if [grok_failed] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [kv_data] != "" {
    mutate {
      gsub => ["kv_data", "□([0-9a-zA-Z_.-]+?)=", "^$1="]
    }
    mutate {
      gsub => ["kv_data", "\\t([0-9a-zA-Z_.-]+?)=", "^$1="]
    }
    kv {
      source => "kv_data"
      field_split => "^"
      value_split => "="
      on_error => "kv_failed"
    }
  }
  if [summary] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{summary}"
      }
      on_error => "no_security_result_summary"
    }
  }
  if [summary] =~ "(?i)clean" {
    mutate {
      replace => {
        "action1" => "ALLOW"
      }
    }
  }
  if [action1] != "" {
    mutate {
      merge => {
        "security_result.action" => "action1"
      }
      on_error => "no_security_result_action"
    }
  }
  if [identSrc] != "" {
    mutate {
      merge => {
        "principal.ip" => "identSrc"
        "principal.asset.ip" => "identSrc"
      }
      on_error => "no_principal_ip"
    }
    if ![no_principal_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [product_event_type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{product_event_type}"
      }
      on_error => "no_metadata_product_event_type"
    }
  }

  if [identHostName] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{identHostName}"
        "principal.asset.hostname" => "%{identHostName}"
        "has_principal" => "true"
      }
      on_error => "no_principal_hostname"
    }
  }

  if [sender] != "" {
    mutate {
      merge => {
        "principal.user.email_addresses" => "sender"
      }
      on_error => "no_principal_user_email"
    }
    mutate {
      replace => {
        "network.email.from" => "%{sender}"
        "has_network_email" => "true"
      }
      on_error => "no_network_email_from"
    }
  }

  if [recipient] != "" {
    mutate {
      merge => {
        "target.user.email_addresses" => "recipient"
        "network.email.to" => "recipient"
      }
      on_error => "no_target_user_email"
    }
    if ![no_target_user_email] {
      mutate {
        replace => {
          "has_network_email" => "true"
        }
      }
    }
  }

  if [subject] != "" {
    mutate {
      merge => {
        "network.email.subject" => "subject"
      }
      on_error => "no_network_email_subject"
    }
    mutate {
      replace => {
        "has_network_email" => "true"
      }
    }
  }

  if [trueSrc] != "" {
    mutate {
      merge => {
        "principal.ip" => "trueSrc"
        "principal.asset.ip" => "trueSrc"
      }
      on_error => "no_trueSrc"
    }
    if ![no_trueSrc] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [src] != "" {
    mutate {
      merge => {
        "principal.ip" => "src"
        "principal.asset.ip" => "src"
      }
      on_error => "no_src"
    }
    if ![no_src] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [dst] != "" {
    mutate {
      merge => {
        "target.ip" => "dst"
        "target.asset.ip" => "dst"
      }
      on_error => "no_dst"
    }
    if ![no_dst] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }

  if [act] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{act}"
      }
      on_error => "no_security_result_action_details"
    }
  }

  if [hybridSpamScore] != "" {
    mutate {
      replace => {
        "hybridSpamScore_label.value" => "%{hybridSpamScore}"
        "hybridSpamScore_label.key" => "hybridSpamScore"
      }
      on_error => "no_hybridSpamScore_label"
    }
    if ![no_hybridSpamScore_label] {
      mutate {
        merge => {
          "security_result.detection_fields" => "hybridSpamScore_label"
        }
        on_error => "no_security_result_detection_fields"
      }
    }
  }

  if [localSpamScore] != "" {
    mutate {
      replace => {
        "localSpamScore_label.value" => "%{localSpamScore}"
        "localSpamScore_label.key" => "localSpamScore"
      }
      on_error => "no_localSpamScore_label"
    }
    if ![no_localSpamScore_label] {
      mutate {
        merge => {
          "security_result.detection_fields" => "localSpamScore_label"
        }
        on_error => "no_localSpamScore_label_value"
      }
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "FORCEPOINT_MAIL_RELAY"
      "metadata.product_name" => "FORCEPOINT_MAIL_RELAY"
      "metadata.event_type" => "GENERIC_EVENT"
    }
  }

  if [has_network_email] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "EMAIL_TRANSACTION"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_empty"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
