# Product: YAMAHA_ROUTER
# Category: Switches AND Routers
# Supported Format: SYSLOG
# Reference: N/A
# Last Updated: 2024-04-19
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      # UDM fields
      "target" => ""
      "metadata" => ""
      "principal" => ""
      "additional" => ""
      "host" => ""
      "time" => ""
      "user" => ""
      "target_ip" => ""
      "description" => ""
      "principal_ip" => ""
      "user_present" => "false"
      "target_present" => "false"
      "principal_present" => "false"
    }
  }
  grok {
    match => {
      "message" => [
        "%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host}\\s+\\[SSHD\\]\\s+(?P<description>invalid user) %{GREEDYDATA:user}",
        "%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host}\\s+\\[SSHD\\]\\s+(?P<description>Connection .*) by %{IP:principal_ip}",
        "%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host} ('%{DATA:user}' )?(?P<description>.*): %{IP:principal_ip} %{GREEDYDATA}",
        "%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host} %{DATA}\\] %{DATA:description} to %{IP:target_ip} \\(local address %{IP:principal_ip}\\)",
        "%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host} %{DATA}\\] %{DATA} %{IP:principal_ip}",
        "%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host} %{DATA}\\] %{GREEDYDATA:description}",
        "%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host} %{GREEDYDATA:description}"
      ]
    }
    overwrite => ["time","host","description","user","target_ip","principal_ip"]
    on_error => "pattern_not_matched"
  }

  if [pattern_not_matched] {
    drop {
      tag => "TAG_UNSUPPORTED"
    }
  }

  if [time] != "" {
    date {
      match => ["time","MMM dd HH:mm:ss","MMM  d HH:mm:ss"]
      target => "metadata.event_timestamp"
      rebase => true
      on_error => "date_pattern_fail"
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{description}"
      }
      on_error => "invalid_description"
    }
  }

  if [principal_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "principal_ip"
        "principal.asset.ip" => "principal_ip"
      }
      on_error => "invalid_principal_ip"
    }
    if not [invalid_principal_ip] {
      mutate {
        replace => {
          "principal_present" => "true"
        }
      }
    }
  }

  if [host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host}"
        "principal.asset.hostname" => "%{host}"
      }
      on_error => "invalid_host"
    }
    if not [invalid_host] {
      mutate {
        replace => {
          "principal_present" => "true"
        }
      }
    }
  }

  if [user] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{user}"
      }
      on_error => "invalid_user"
    }
    if not [invalid_user] {
      mutate {
        replace => {
          "user_present" => "true"
        }
      }
    }
  }

  if [target_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "target_ip"
        "target.asset.ip" => "target_ip"
      }
      on_error => "invalid_target_ip"
    }
    if not [invalid_target_ip] {
      mutate {
        replace => {
          "target_present" => "true"
        }
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "YAMAHA_ROUTER"
      "metadata.vendor_name" => "YAMAHA_ROUTER"
      "metadata.event_type" => "GENERIC_EVENT"
    }
  }

  if [principal_present] == "true" and [target_present] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  } else if [user_present] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  } else if [principal_present] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
