# Product: COMFORTE_SECURDPS
# Category: Data loss prevention
# Supported Format: SYSLOG + KV, JSON
# Reference: N/A
# Last Updated: 2024-06-10
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      # fields
      "time" => ""
      "pid" => ""
      "kv_data_2" => ""
      "json_data" => ""
      "app" => ""
      "severity" => ""
      "prod_event_type" => ""
      "description" => ""
      "sec_description" => ""
    }
  }

  mutate {
    gsub => ["message", "\\r\\n", ""]
  }
  mutate {
    gsub => ["message", "\\n", ""]
  }

  mutate {
    gsub => ["message", "message", "msg_data"]
  }

  mutate {
    replace => {
      "json_data" => "{\"records\":%{message}}"
    }
    on_error => "message_not_found"
  }

  json {
    source => "json_data"
    array_function => "split_columns"
    on_error => "source_not_json"
  }

  if ![source_not_json] {
    for record in records {
      mutate {
        replace => {
          # fields
          "event" => ""
          "msg_data" => ""
          "severity" => ""
          "facility" => ""
          "host" => ""
          "severityName" => ""
          "facilityName" => ""
          "record_time" => ""
          "raw_value" => ""
          "index" => ""
          "sourcetype" => ""
          "cribl_pipe" => ""
          "pid" => ""
          # kv_data fields
          "kv_data" => ""
          "_STRATEGY" => ""
          "_APPLICATION" => ""
          "_USER" => ""
          "_PROTECTS" => ""
          "_DENIEDPROTECTS" => ""
          "_REVEALS" => ""
          "_DENIEDREVEALS" => ""
          "_LOOKUPS" => ""
          "_INTERVAL" => ""
          "_IPADDRESS" => ""
          "_ZOSUSER" => ""
          "_TIME" => ""
          "sha_256_value" => ""
          # initialising labels
          "strategy_label" => ""
          "protects_label" => ""
          "deniedprotects_label" => ""
          "reveals_label" => ""
          "deniedreveals_label" => ""
          "lookups_label" => ""
          "interval_label" => ""
          "sha256_label" => ""
          # event type specific
          "metadata_event_type" => ""
          "principal_mid_present" => "false"
          "target_mid_present" => "false"
          "target_user_present" => "false"
          # udm noun
          "metadata" => ""
          "principal" => ""
          "target" => ""
          "additional" => ""
          "security_result" => ""
        }
      }

      mutate {
        replace => {
          "msg_data" => "%{record.msg_data}"
        }
        on_error => "msg_data_not_found"
      }
      if ![msg_data_not_found] and [msg_data] != "" {
        mutate {
          replace => {
            "metadata.description" => "%{msg_data}"
          }
          on_error => "msg_data_invalid"
        }
      }

      mutate {
        convert => {
          "record.severity" => "string"
        }
        on_error => "severity_conversion_failed"
      }
      mutate {
        replace => {
          "severity" => "%{record.severity}"
        }
        on_error => "severity_not_found"
      }
      if ![severity_not_found] and [severity] != "" {
        mutate {
          replace => {
            "security_result.severity_details" => "%{severity}"
          }
          on_error => "severity_not_found"
        }
      }

      mutate {
        convert => {
          "record.facility" => "string"
        }
        on_error => "facility_conversion_failed"
      }
      mutate {
        replace => {
          "facility_label" => ""
          "facility" => "%{record.facility}"
        }
        on_error => "facility_not_found"
      }
      if ![facility_not_found] and [facility] != "" {
        mutate {
          replace => {
            "facility_label.key" => "facility"
            "facility_label.value" => "%{record.facility}"
          }
          on_error => "facility_not_found"
        }
        if ![facility_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "facility_label"
            }
          }
        }
      }

      mutate {
        replace => {
          "host" => "%{record.host}"
        }
        on_error => "host_not_found"
      }
      if ![host_not_found] and [host] != "" {
        grok {
          match => {
            "host" => [
              "%{IP:validated_host}"
            ]
          }
          overwrite => ["validated_host"]
          on_error => "host_not_ip"
        }
        if ![host_not_ip] {
          mutate {
            merge => {
              "principal.ip" => "validated_host"
              "principal.asset.ip" => "validated_host"
            }
            on_error => "validated_host_merge_failed"
          }
        }
        else {
          mutate {
            replace => {
              "principal.hostname" => "%{host}"
              "principal.asset.hostname" => "%{host}"
            }
            on_error => "host_invalid"
          }
        }
        mutate {
          replace => {
            "principal_mid_present" => "true"
          }
        }
      }

      mutate {
        replace => {
          "severityName" => "%{record.severityName}"
        }
        on_error => "severityName_not_found"
      }
      if ![severityName_not_found] {
        if [severityName] =~ "(?i)(info)" {
          mutate {
            replace => {
              "security_result.severity" => "INFORMATIONAL"
            }
          }
        }
        else if [severityName] =~ "(?i)(warn)" {
          mutate {
            replace => {
              "security_result.severity" => "WARNING"
            }
          }
        }
        else if [severityName] =~ "(?i)(error)" {
          mutate {
            replace => {
              "security_result.severity" => "ERROR"
            }
          }
        }
      }

      mutate {
        replace => {
          "facilityName_label" => ""
          "facilityName" => "%{record.facilityName}"
        }
        on_error => "facilityName_not_found"
      }
      if ![facilityName_not_found] and [facilityName] != "" {
        mutate {
          replace => {
            "facilityName_label.key" => "facilityName"
            "facilityName_label.value" => "%{facilityName}"
          }
          on_error => "facilityName_invalid"
        }
        if ![facilityName_invalid] {
          mutate {
            merge => {
              "security_result.detection_fields" => "facilityName_label"
            }
            on_error => "facilityName_label_merge_failed"
          }
        }
      }

      mutate {
        convert => {
          "record._time" => "string"
        }
        on_error => "record_time_conversion_failed"
      }
      mutate {
        replace => {
          "record_time" => "%{record._time}"
        }
        on_error => "record_time_not_found"
      }
      if ![record_time_not_found] and [record_time] != "" {
        date {
          match => ["record_time", "UNIX"]
          on_error => "date_match_failed"
        }
      }

      mutate {
        replace => {
          "index_label" => ""
          "index" => "%{record.index}"
        }
        on_error => "index_not_found"
      }
      if ![index_not_found] and [index] != "" {
        mutate {
          replace => {
            "index_label.key" => "index"
            "index_label.value.string_value" => "%{index}"
          }
          on_error => "index_invalid"
        }
        if ![index_invalid] {
          mutate {
            merge => {
              "additional.fields" => "index_label"
            }
            on_error => "index_label_merge_failed"
          }
        }
      }

      mutate {
        replace => {
          "sourcetype" => "%{record.sourcetype}"
        }
        on_error => "sourcetype_not_found"
      }
      if ![sourcetype_not_found] and [sourcetype] != "" {
        mutate {
          replace => {
            "metadata.product_event_type" => "%{sourcetype}"
          }
          on_error => "sourcetype_invalid"
        }
      }

      mutate {
        replace => {
          "cribl_pipe_label" => ""
          "cribl_pipe" => "%{record.cribl_pipe}"
        }
        on_error => "cribl_pipe_not_found"
      }
      if ![cribl_pipe_not_found] and [cribl_pipe] != "" {
        mutate {
          replace => {
            "cribl_pipe_label.key" => "cribl_pipe"
            "cribl_pipe_label.value.string_value" => "%{cribl_pipe}"
          }
          on_error => "cribl_pipe_invalid"
        }
        if ![cribl_pipe_invalid] {
          mutate {
            merge => {
              "additional.fields" => "cribl_pipe_label"
            }
            on_error => "cribl_pipe_label_merge_failed"
          }
        }
      }

      # raw_value: kv_data
      mutate {
        replace => {
          "raw_value" => "%{record._raw}"
        }
        on_error => "raw_not_found"
      }
      if ![raw_not_found] and [raw_value] != "" {
        grok {
          match => {
            "raw_value" => [
              "SDRedis\\[%{DATA:pid}\\]%{DATA}}}%{GREEDYDATA:kv_data}"
            ]
          }
          overwrite => ["pid", "kv_data"]
          on_error => "raw_value_pattern_match_failed"
        }

        if [pid] != "" {
          mutate {
            replace => {
              "target.process.pid" => "%{pid}"
            }
            on_error => "pid_invalid"
          }
        }

        if [kv_data] != "" {
          mutate {
            gsub => ["kv_data", "=([\\w-:.\\s]+),\\s+", "=$1#"]
          }
          kv {
            source => "kv_data"
            field_split => "#"
            value_split => "="
            on_error => "kv_data_invalid"
          }
        }

        if [_STRATEGY] != "" {
          mutate {
            replace => {
              "strategy_label.key" => "_STRATEGY"
              "strategy_label.value" => "%{_STRATEGY}"
            }
            on_error => "strategy_invalid"
          }
          if ![strategy_invalid] {
            mutate {
              merge => {
                "security_result.detection_fields" => "strategy_label"
              }
              on_error => "strategy_label_merge_failed"
            }
          }
        }

        if [_PROTECTS] != "" {
          mutate {
            replace => {
              "protects_label.key" => "_PROTECTS"
              "protects_label.value" => "%{_PROTECTS}"
            }
            on_error => "protects_invalid"
          }
          if ![protects_invalid] {
            mutate {
              merge => {
                "security_result.detection_fields" => "protects_label"
              }
              on_error => "protects_label_merge_failed"
            }
          }
        }

        if [_DENIEDPROTECTS] != "" {
          mutate {
            replace => {
              "deniedprotects_label.key" => "_DENIEDPROTECTS"
              "deniedprotects_label.value" => "%{_DENIEDPROTECTS}"
            }
            on_error => "deniedprotects_invalid"
          }
          if ![deniedprotects_invalid] {
            mutate {
              merge => {
                "security_result.detection_fields" => "deniedprotects_label"
              }
              on_error => "deniedprotects_label_merge_failed"
            }
          }
        }

        if [_REVEALS] != "" {
          mutate {
            replace => {
              "reveals_label.key" => "_REVEALS"
              "reveals_label.value" => "%{_REVEALS}"
            }
            on_error => "reveals_invalid"
          }
          if ![reveals_invalid] {
            mutate {
              merge => {
                "security_result.detection_fields" => "reveals_label"
              }
              on_error => "reveals_label_merge_failed"
            }
          }
        }

        if [_DENIEDREVEALS] != "" {
          mutate {
            replace => {
              "deniedreveals_label.key" => "_DENIEDREVEALS"
              "deniedreveals_label.value" => "%{_DENIEDREVEALS}"
            }
            on_error => "deniedreveals_invalid"
          }
          if ![deniedreveals_invalid] {
            mutate {
              merge => {
                "security_result.detection_fields" => "deniedreveals_label"
              }
              on_error => "deniedreveals_label_merge_failed"
            }
          }
        }

        if [_LOOKUPS] != "" {
          mutate {
            replace => {
              "lookups_label.key" => "_LOOKUPS"
              "lookups_label.value" => "%{_LOOKUPS}"
            }
            on_error => "lookups_invalid"
          }
          if ![lookups_invalid] {
            mutate {
              merge => {
                "security_result.detection_fields" => "lookups_label"
              }
              on_error => "lookups_label_merge_failed"
            }
          }
        }

        if [_INTERVAL] != "" {
          mutate {
            replace => {
              "interval_label.key" => "_INTERVAL"
              "interval_label.value" => "%{_INTERVAL}"
            }
            on_error => "interval_invalid"
          }
          if ![interval_invalid] {
            mutate {
              merge => {
                "security_result.detection_fields" => "interval_label"
              }
              on_error => "interval_label_merge_failed"
            }
          }
        }

        if [_APPLICATION] != "" {
          mutate {
            replace => {
              "target.application" => "%{_APPLICATION}"
            }
            on_error => "application_invalid"
          }
        }

        if [_ZOSUSER] != "" {
          mutate {
            replace => {
              "target.user.userid" => "%{_ZOSUSER}"
              "target_user_present" => "true"
            }
            on_error => "zosuser_invalid"
          }
        }

        if [_IPADDRESS] != "" {
          mutate {
            merge => {
              "target.ip" => "_IPADDRESS"
              "target.asset.ip" => "_IPADDRESS"
            }
            on_error => "ipaddress_invalid"
          }
          if ![ipaddress_invalid] {
            mutate {
              replace => {
                "target_mid_present" => "true"
              }
            }
          }
        }

        if [_USER] != "" {
          grok {
            match => {
              "_USER" => [
                "%{GREEDYDATA}SHA256:%{GREEDYDATA:sha_256_value}"
              ]
            }
            overwrite => ["sha_256_value"]
            on_error => "user_pattern_match_failed"
          }
          mutate {
            lowercase => ["sha_256_value"]
          }
          if [sha_256_value] =~ "^[0-9a-f]+$" {
            mutate {
              lowercase => ["sha_256_value"]
            }
            mutate {
              replace => {
                "target.file.sha256" => "%{sha_256_value}"
              }
              on_error => "sha_256_value_invalid"
            }
          }
          else {
            mutate {
              replace => {
                "sha256_label.key" => "sha256"
                "sha256_label.value" => "%{sha256}"
              }
              on_error => "sha256_invalid"
            }
            if ![sha256_invalid] {
              mutate {
                merge => {
                  "target.resource.attribute.labels" => "sha256_label"
                }
                on_error => "sha256_label_merge_failed"
              }
            }
          }
        }
      }

      # metadata info
      mutate {
        replace => {
          "metadata.vendor_name" => "COMFORTE_SECURDPS"
          "metadata.product_name" => "Comforte SecureDPS"
        }
      }

      if [metadata_event_type] == "" {
        if [principal_mid_present] == "true" and [target_mid_present] == "true" {
          mutate {
            replace => {
              "metadata_event_type" => "NETWORK_CONNECTION"
            }
          }
        }
        else if [target_user_present] == "true" {
          mutate {
            replace => {
              "metadata_event_type" => "USER_UNCATEGORIZED"
            }
          }
        }
        else if [principal_mid_present] == "true" {
          mutate {
            replace => {
              "metadata_event_type" => "STATUS_UPDATE"
            }
          }
        }
        else {
          mutate {
            replace => {
              "metadata_event_type" => "GENERIC_EVENT"
            }
          }
        }
      }

      if [metadata_event_type] != "" {
        mutate {
          replace => {
            "metadata.event_type" => "%{metadata_event_type}"
          }
          on_error => "metadata_event_type_empty"
        }
      }


      # merge the data into udm nouns.
      if [metadata] != "" {
        mutate {
          rename => {
            "metadata" => "event.idm.read_only_udm.metadata"
          }
        }
      }
      if [principal] != "" {
        mutate {
          rename => {
            "principal" => "event.idm.read_only_udm.principal"
          }
        }
      }
      if [target] != "" {
        mutate {
          rename => {
            "target" => "event.idm.read_only_udm.target"
          }
        }
      }
      if [additional] != "" {
        mutate {
          rename => {
            "additional" => "event.idm.read_only_udm.additional"
          }
        }
      }
      if [security_result] != "" {
        mutate {
          merge => {
            "event.idm.read_only_udm.security_result" => "security_result"
          }
          on_error => "security_result_empty"
        }
      }

      mutate {
        merge => {
          "@output" => "event"
        }
      }
    }
  }
  else {
    grok {
      match => {
        "message" => [
          "<%{INT}>%{SYSLOGTIMESTAMP:time}\\s+SDRedis\\[%{INT:pid}\\]%{DATA}}}%{GREEDYDATA:kv_data_2}",
          "<%{INT}>%{SYSLOGTIMESTAMP:time}\\s+%{DATA:app}\\[%{INT:pid}\\]:\\s+%{DATA:severity}:\\s+%{DATA:prod_event_type}:\\s+%{GREEDYDATA:description}",
          "<%{INT}>%{SYSLOGTIMESTAMP:time}\\s+%{DATA:app}\\[%{INT:pid}\]:\\s+%{GREEDYDATA:sec_description}"
        ]
      }
      overwrite => ["time", "pid", "kv_data_2", "app", "severity", "prod_event_type", "description", "sec_description"]
      on_error => "header_grok_match_failed"
    }

    mutate {
      replace => {
        # kv_data_2 fields
        "_STRATEGY" => ""
        "_APPLICATION" => ""
        "_USER" => ""
        "_PROTECTS" => ""
        "_DENIEDPROTECTS" => ""
        "_REVEALS" => ""
        "_DENIEDREVEALS" => ""
        "_LOOKUPS" => ""
        "_INTERVAL" => ""
        "_IPADDRESS" => ""
        "_ZOSUSER" => ""
        "_TIME" => ""
        "sha_256_value" => ""
        "principal_ip" => ""
        "principal_port" => ""
        # event type specific
        "metadata_event_type" => ""
        "principal_mid_present" => "false"
        "target_mid_present" => "false"
        "target_user_present" => "false"
        # udm noun
        "metadata" => ""
        "principal" => ""
        "target" => ""
        "additional" => ""
        "security_result" => ""
      }
    }
    if [kv_data_2] != "" {
      mutate {
        gsub => ["kv_data_2", "=([\\w-:.\\s]+),\\s+", "=$1#"]
      }
      kv {
        source => "kv_data_2"
        field_split => "#"
        value_split => "="
        on_error => "kv_data_2_invalid"
      }
    }

    if [time] != "" {
      date {
        match => ["time", "UNIX"]
        on_error => "date_match_failed_1"
      }
    }

    if [pid] != "" {
      mutate {
        replace => {
          "target.process.pid" => "%{pid}"
        }
        on_error => "pid_invalid_1"
      }
    }

    if [app] != "" {
      mutate {
        replace => {
          "target.application" => "%{app}"
        }
        on_error => "app_invalid"
      }
    }

    if [severity] != "" {
      mutate {
        replace => {
          "security_result.severity_details" => "%{severity}"
        }
        on_error => "severity_invalid"
      }
    }
    if [severity] =~ "(?i)(info)" {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    }
    else if [severity] =~ "(?i)(warn)" {
      mutate {
        replace => {
          "security_result.severity" => "WARNING"
        }
      }
    }
    else if [severity] =~ "(?i)(error)" {
      mutate {
        replace => {
          "security_result.severity" => "ERROR"
        }
      }
    }

    if [prod_event_type] != "" {
      mutate {
        replace => {
          "metadata.product_event_type" => "%{prod_event_type}"
        }
        on_error => "prod_event_type_invalid"
      }
    }

    if [description] != "" {
      mutate {
        replace => {
          "metadata.description" => "%{description}"
        }
        on_error => "description_invalid"
      }
    }

    if [sec_description] != "" {
      grok {
        match => {
          "sec_description" => [
            "Connection\\s+closed\\s+by\\s+%{IP:principal_ip}\\s+port\\s+%{INT:principal_port}"
          ]
        }
        overwrite => ["principal_ip", "principal_port"]
        on_error => "sec_description_pattern_match_failed"
      }

      mutate {
        replace => {
          "security_result.description" => "%{sec_description}"
        }
        on_error => "sec_description_invalid"
      }
    }

    if [principal_ip] != "" {
      mutate {
        merge => {
          "principal.ip" => "principal_ip"
          "principal.asset.ip" => "principal_ip"
        }
        on_error => "principal_ip_invalid"
      }
      if ![principal_ip_invalid] {
        mutate {
          replace => {
            "principal_mid_present" => "true"
          }
        }
      }
    }

    if [principal_port] != "" {
      mutate {
        replace => {
          "principal.port" => "%{principal_port}"
        }
        on_error => "principal_port_invalid"
      }
      mutate {
        convert => {
          "principal.port" => "integer"
        }
        on_error => "principal_port_conversion_failed"
      }
    }

    if [_STRATEGY] != "" {
      mutate {
        replace => {
          "strategy_label.key" => "_STRATEGY"
          "strategy_label.value" => "%{_STRATEGY}"
        }
        on_error => "strategy_invalid"
      }
      if ![strategy_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "strategy_label"
          }
          on_error => "strategy_label_merge_failed"
        }
      }
    }

    if [_PROTECTS] != "" {
      mutate {
        replace => {
          "protects_label.key" => "_PROTECTS"
          "protects_label.value" => "%{_PROTECTS}"
        }
        on_error => "protects_invalid"
      }
      if ![protects_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "protects_label"
          }
          on_error => "protects_label_merge_failed"
        }
      }
    }

    if [_DENIEDPROTECTS] != "" {
      mutate {
        replace => {
          "deniedprotects_label.key" => "_DENIEDPROTECTS"
          "deniedprotects_label.value" => "%{_DENIEDPROTECTS}"
        }
        on_error => "deniedprotects_invalid"
      }
      if ![deniedprotects_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "deniedprotects_label"
          }
          on_error => "deniedprotects_label_merge_failed"
        }
      }
    }

    if [_REVEALS] != "" {
      mutate {
        replace => {
          "reveals_label.key" => "_REVEALS"
          "reveals_label.value" => "%{_REVEALS}"
        }
        on_error => "reveals_invalid"
      }
      if ![reveals_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "reveals_label"
          }
          on_error => "reveals_label_merge_failed"
        }
      }
    }

    if [_DENIEDREVEALS] != "" {
      mutate {
        replace => {
          "deniedreveals_label.key" => "_DENIEDREVEALS"
          "deniedreveals_label.value" => "%{_DENIEDREVEALS}"
        }
        on_error => "deniedreveals_invalid"
      }
      if ![deniedreveals_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "deniedreveals_label"
          }
          on_error => "deniedreveals_label_merge_failed"
        }
      }
    }

    if [_LOOKUPS] != "" {
      mutate {
        replace => {
          "lookups_label.key" => "_LOOKUPS"
          "lookups_label.value" => "%{_LOOKUPS}"
        }
        on_error => "lookups_invalid"
      }
      if ![lookups_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "lookups_label"
          }
          on_error => "lookups_label_merge_failed"
        }
      }
    }

    if [_INTERVAL] != "" {
      mutate {
        replace => {
          "interval_label.key" => "_INTERVAL"
          "interval_label.value" => "%{_INTERVAL}"
        }
        on_error => "interval_invalid"
      }
      if ![interval_invalid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "interval_label"
          }
          on_error => "interval_label_merge_failed"
        }
      }
    }

    if [_APPLICATION] != "" {
      mutate {
        replace => {
          "target.application" => "%{_APPLICATION}"
        }
        on_error => "application_invalid"
      }
    }

    if [_ZOSUSER] != "" {
      mutate {
        replace => {
          "target.user.userid" => "%{_ZOSUSER}"
          "target_user_present" => "true"
        }
        on_error => "zosuser_invalid"
      }
    }

    if [_IPADDRESS] != "" {
      mutate {
        merge => {
          "target.ip" => "_IPADDRESS"
          "target.asset.ip" => "_IPADDRESS"
        }
        on_error => "ipaddress_invalid"
      }
      if ![ipaddress_invalid] {
        mutate {
          replace => {
            "target_mid_present" => "true"
          }
        }
      }
    }

    if [_USER] != "" {
      grok {
        match => {
          "_USER" => [
            "%{GREEDYDATA}SHA256:%{GREEDYDATA:sha_256_value}"
          ]
        }
        overwrite => ["sha_256_value"]
        on_error => "user_pattern_match_failed"
      }
      mutate {
        lowercase => ["sha_256_value"]
      }
      if [sha_256_value] =~ "^[0-9a-f]+$" {
        mutate {
          lowercase => ["sha_256_value"]
        }
        mutate {
          replace => {
            "target.file.sha256" => "%{sha_256_value}"
          }
          on_error => "sha_256_value_invalid"
        }
      }
      else {
        mutate {
          replace => {
            "sha256_label.key" => "sha256"
            "sha256_label.value" => "%{sha256}"
          }
          on_error => "sha256_invalid"
        }
        if ![sha256_invalid] {
          mutate {
            merge => {
              "target.resource.attribute.labels" => "sha256_label"
            }
            on_error => "sha256_label_merge_failed"
          }
        }
      }
    }

    # metadata info
    mutate {
      replace => {
        "metadata.vendor_name" => "COMFORTE_SECURDPS"
        "metadata.product_name" => "Comforte SecureDPS"
      }
    }

    if [metadata_event_type] == "" {
      if [principal_mid_present] == "true" and [target_mid_present] == "true" {
        mutate {
          replace => {
            "metadata_event_type" => "NETWORK_CONNECTION"
          }
        }
      }
      else if [target_user_present] == "true" {
        mutate {
          replace => {
            "metadata_event_type" => "USER_UNCATEGORIZED"
          }
        }
      }
      else if [principal_mid_present] == "true" {
        mutate {
          replace => {
            "metadata_event_type" => "STATUS_UPDATE"
          }
        }
      }
      else {
        mutate {
          replace => {
            "metadata_event_type" => "GENERIC_EVENT"
          }
        }
      }
    }

    if [metadata_event_type] != "" {
      mutate {
        replace => {
          "metadata.event_type" => "%{metadata_event_type}"
        }
        on_error => "metadata_event_type_empty"
      }
    }


      # merge the data into udm nouns.
    if [metadata] != "" {
      mutate {
        rename => {
          "metadata" => "event.idm.read_only_udm.metadata"
        }
      }
    }
    if [principal] != "" {
      mutate {
        rename => {
          "principal" => "event.idm.read_only_udm.principal"
        }
      }
    }
    if [target] != "" {
      mutate {
        rename => {
          "target" => "event.idm.read_only_udm.target"
        }
      }
    }
    if [additional] != "" {
      mutate {
        rename => {
          "additional" => "event.idm.read_only_udm.additional"
        }
      }
    }
    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
        on_error => "security_result_empty"
      }
    }

    mutate {
      merge => {
        "@output" => "event"
      }
    }
  }
}
