# Product: S4P4
# Category: DATTO_FILE_PROTECTION
# Supported Format: SYSLOG
# Reference: https://fileprotection.datto.com/managerhelp/Content/0_HOME/ManagerHome.htm
# Last Updated: 2022-08-22
# Copyright 2022 Chronicle LLC


filter {
  mutate {
    replace => {
      "timestamp" => ""
      "hostname" => ""
      "log_id" => ""
      "desc" => ""
      "vendor" => ""
      "product" => ""
      "description" => ""
      "prod_dvc_version" => ""
      "event_class_id" => ""
      "syslog_severity_code" => ""
      "extensions" => ""
      "metadata.event_type" => ""
    }
  }

  if [message] != "" {
    grok {
      match => {
        "message" => ["<%{INT}>%{SYSLOGTIMESTAMP:timestamp}\\s+%{HOST:hostname}\\s+datto.audit\\[%{NUMBER:log_id}\\]:\\s+%{GREEDYDATA:desc}"]
      }
      overwrite => ["timestamp","hostname","log_id","desc"]
      on_error => "grok_failure"
    }
  }

  if [timestamp] != "" {
    date {
      match => ["timestamp","MMM d HH:mm:ss", "MMM d HH:mm:ss "]
      rebase =>  true
      on_error => "date_error"
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
      }
    }
  }
  if [log_id] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{log_id}"
      }
    }
  }
  if [desc] != "" {
    grok {
      match => {
        "message" => ["CEF:%{INT}\\|%{WORD:vendor}\\|%{WORD:product}\\|%{DATA:prod_dvc_version}\\|%{WORD:event_class_id}\\|%{DATA:description}\\|%{INT:syslog_severity_code}\\|%{GREEDYDATA:extensions}"]
      }
      overwrite => ["vendor","product","prod_dvc_version","event_class_id",
                    "description","syslog_severity_code","extensions"]
      on_error => "grok_desc_failure"
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "Datto"
    }
  }
  mutate {
    replace => {
      "metadata.product_name" => "S4P4"
    }
  }
  if [prod_dvc_version] != "" {
    mutate {
      replace => {
        "metadata.product_version" => "%{prod_dvc_version}"
      }
    }
  }
  if [description] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{description}"
      }
    }
  }
  if [syslog_severity_code] < "3" {
    mutate {
      replace => {
          "security_result.severity" => "LOW"
      }
    }
  }
  else if [syslog_severity_code] > "2" && [syslog_severity_code] < "6" {
    mutate {
      replace => {
          "security_result.severity" => "MEDIUM"
      }
    }
  }
  else if [syslog_severity_code] > "5" {
    mutate {
      replace => {
          "security_result.severity" => "HIGH"
      }
    }
  }

  if [extensions] != "" {
    mutate {
      gsub => ["extensions"," ([A-Za-z0-9_]+=)","#$1"]
    }

    kv {
       source => "extensions"
       value_split => "="
       field_split => "#"
       on_error => "not_kv"
    }

    if [act] != "" {
      mutate {
        merge => {
          "security_result.category_details" => "act"
        }
      }
    }
    if [dvc] != "" {
      mutate {
        merge => {
          "target.ip" => "dvc"
        }
      }
    }
  }

  if [hostname] != "" or [dvc] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  mutate {
    rename => {
      "principal" => "event.idm.read_only_udm.principal"
      "metadata" => "event.idm.read_only_udm.metadata"
      "target" => "event.idm.read_only_udm.target"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
