# Product: MICROSTRATEGY
# Category: Application server logs
# Supported Format: SYSLOG
# Reference: NA
# Last Updated: 2025-03-21
# Copyright 2025 Google SecOps


filter {
  mutate {
    replace => {
      "Event_start" => ""
      "Hostname" => ""
      "Source_host" => ""
      "Source_server" => ""
      "PID" => ""
      "Thread_ID" => ""
      "level" => ""
      "Log_level" => ""
      "UID" => ""
      "SID" => ""
      "OID" => ""
      "user" => ""
      "module" => ""
      "method" => ""
      "Authentication_message" => ""
      "security_result" => ""
      "principal" => ""
      "target" => ""
      "src" => ""
      "id" => ""
      "server_ip" => ""
      "client_ip" => ""
      "Account_Name" => ""
      "Account_Login" => ""
      "Account_Creation_Timestamp" => ""
      "Account_Modification_Timestamp" => ""
      "Account_Status_DESC" => ""
      "Object_Owner_Name" => ""
      "User_Group_Name" => ""
      "User" => ""
      "Account" => ""
      "Session" => ""
      "Timestamp" => ""
      "has_principal" => "false"
      "has_target" => "false"
    }
  }
  date {
    match => ["Event_start", "MMM dd HH:mm:ss"]
    rebase => true
    on_error => "no_date"
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:Event_start} %{HOSTNAME:Hostname} \\[HOST:%{HOSTNAME:Source_host}\\]\\[SERVER:%{WORD:Source_server}\\]\\[PID:%{INT:PID}\\]\\[THR:%{INT:Thread_ID}\\]\\[%{WORD:level}\\]\\[%{DATA} %{WORD:Log_level}\\]\\[UID:%{DATA:UID}\\]\\[SID:%{DATA:SID}\\]\\[OID:%{DATA:OID}\\] %{DATA:module}::%{DATA:method}: %{GREEDYDATA:Authentication_message}",
        "<%{INT}>%{SYSLOGTIMESTAMP:Event_start} %{HOSTNAME:Hostname} \\[HOST:%{HOSTNAME:Source_host}\\]\\[SERVER:%{WORD:Source_server}\\]\\[PID:%{INT:PID}\\]\\[THR:%{INT:Thread_ID}\\]\\[%{WORD:level}\\]\\[%{DATA} %{WORD:Log_level}\\]\\[UID:%{DATA:UID}\\]\\[SID:%{DATA:SID}\\]\\[OID:%{DATA:OID}\\] %{GREEDYDATA:Authentication_message}",
        "<%{INT}>%{SYSLOGTIMESTAMP:Event_start} %{HOSTNAME:Hostname} \\[HOST:%{HOSTNAME:Source_host}\\]\\[SERVER:%{WORD:Source_server}\\]\\[PID:%{INT:PID}\\]\\[THR:%{INT:Thread_ID}\\]\\[%{DATA:level}\\]\\[%{DATA:Log_level}\\]\\[UID:%{DATA:UID}\\]\\[SID:%{DATA:SID}\\]\\[OID:%{DATA:OID}\\] %{DATA:Authentication_message} User ID='%{DATA:id}'",
        '<%{INT}>%{SYSLOGTIMESTAMP:Event_start} %{HOSTNAME:Hostname} \\[HOST:%{HOSTNAME:Source_host}\\]\\[SERVER:%{WORD:Source_server}\\]\\[PID:%{INT:PID}\\]\\[THR:%{INT:Thread_ID}\\]\\[%{DATA:level}\\]\\[%{DATA:Log_level}\\]\\[UID:%{DATA:UID}\\]\\[SID:%{DATA:SID}\\]\\[OID:%{DATA:OID}\\] Create user runtime',
        "<%{INT}>%{SYSLOGTIMESTAMP:Event_start} %{HOSTNAME:Hostname} \\[HOST:%{HOSTNAME:Source_host}\\]\\[SERVER:%{WORD:Source_server}\\]\\[PID:%{INT:PID}\\]\\[THR:%{INT:Thread_ID}\\]\\[%{DATA:level}\\]\\[%{DATA:Log_level}\\]\\[UID:%{DATA:UID}\\]\\[SID:%{DATA:SID}\\]\\[OID:%{DATA:OID}\\] Login using Standard Security with User='%{DATA:user}' from client'Server Machine: %{IP:server_ip} Client Machine: (?:%{IP:client_ip}|%{DATA:client_name})'",
        "<%{INT}>%{SYSLOGTIMESTAMP:Event_start} %{HOSTNAME:Hostname} # %{GREEDYDATA}",
        "%{DATA:Account_Name},%{DATA:Account_Login},%{MONTHDAY}/%{MONTHNUM2}/%{YEAR} %{TIME:Account_Creation_Timestamp},%{MONTHDAY}/%{MONTHNUM2}/%{YEAR} %{TIME:Account_Modification_Timestamp},%{WORD:Account_Status_DESC},%{DATA:Object_Owner_Name},%{GREEDYDATA:User_Group_Name}",
        "%{DATA:User};%{DATA:Account};%{DATA:Session};%{MONTHDAY}/%{MONTHNUM2}/%{YEAR} %{TIME:Timestamp}"
        ]
    }
    on_error => "pattern_mismatch"
    overwrite => ["Event_start","Hostname","Source_host", "Source_server", "PID", "Thread_ID", "level", "Log_level", "UID", "SID", "OID", "module", "method", "Authentication_message","id","server_ip", "client_ip", "Account_Name", "Account_Login", "Account_Creation_Timestamp", "Account_Modification_Timestamp", "Account_Status_DESC", "Object_Owner_Name", "User_Group_Name", "User", "Account", "Session", "Timestamp","user"]
  }
  if [Hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{Hostname}"
        "principal.asset.hostname" => "%{Hostname}"
        "has_principal" => "true"
      }
      on_error => "no_hostname"
    }
  }
  if [Source_host] != "" {
    mutate {
      replace => {
        "src.hostname" => "%{Source_host}"
        "src.asset.hostname" => "%{Source_host}"
      }
      on_error => "no_source_host"
    }
  }
  if [Source_server] != "" {
    mutate {
      replace => {
        "principal.application" => "%{Source_server}"
        "has_principal" => "true"
      }
      on_error => "no_source_server"
    }
  }
  if [PID] != "" {
    mutate {
      replace => {
        "target.process.pid" => "%{PID}"
        "has_target" => "true"
      }
      on_error => "no_pid"
    }
  }
  if [Thread_ID] != "" {
    mutate {
      replace => {
        "Thread_ID_label.key" => "Thread_ID"
        "Thread_ID_label.value" => "%{Thread_ID}"
      }
      on_error => "no_thread_id"
    }
    if not [no_thread_id] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "Thread_ID_label"
        }
        on_error => "thread_id_label_merge_failed"
      }
    }
  }
  if [level] != "" {
    mutate {
      replace => {
        "principal.platform_patch_level" => "%{level}"
        "has_principal" => "true"
      }
      on_error => "no_level"
    }
  }
  if [Log_level] != "" {
    mutate {
      replace => {
        "Log_level_label.key"   => "Log Level"
        "Log_level_label.value" => "%{Log_level}"
      }
      on_error => "no_log_level"
    }
    if ![no_log_level] {
      mutate {
        merge => {
          "security_result.detection_fields" => "Log_level_label"
        }
        on_error => "log_level_label_merge_failed"
      }
    }
  }
  if [UID] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{UID}"
        "has_target" => "true"
      }
      on_error => "no_uid"
    }
  }
  if [SID] != "" {
    mutate {
      replace => {
        "SID_label.key" => "SID"
        "SID_label.value" => "%{SID}"
      }
      on_error => "no_sid"
    }
    if not [no_sid] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "SID_label"
        }
        on_error => "sid_label_merge_failed"
      }
    }
  }
  if [OID] != "" {
    mutate {
      replace => {
        "target.resource.id" => "%{OID}"
        "has_target" => "true"
      }
      on_error => "no_oid"
    }
  }
  if [module] != "" {
    mutate {
      replace => {
        "target.application" => "%{module}"
        "has_target" => "true"
      }
      on_error => "no_module"
    }
  }
  if [method] != "" {
    mutate {
      replace => {
        "method_label.key" => "Method"
        "method_label.value" => "%{method}"
      }
      on_error => "no_method"
    }
    mutate {
      merge => {
        "target.resource.attribute.labels" => "method_label"
      }
      on_error => "method_label_merge_failed"
    }
  }
  if [Authentication_message] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{Authentication_message}"
      }
      on_error => "no_authentication_message"
    }
  }
  if [id] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{id}"
        "has_principal" => "true"
      }
      on_error => "no_id"
    }
  }
  if [server_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "server_ip"
        "principal.asset.ip" => "server_ip"
      }
      on_error => "no_server_ip"
    }
    if ![no_server_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
        on_error => "no_server_ip"
      }
    }
  }
  if [client_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "client_ip"
        "target.asset.ip" => "client_ip"
      }
      on_error => "no_client_ip"
    }
    if ![no_client_ip] {
      mutate {
        replace => {
          "has_target" => "true"
        }
        on_error => "no_client_ip"
      }
    }
  }
  if [Account_Name] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{Account_Name}"
        "has_target" => "true"
      }
      on_error => "no_account_name"
    }
  }
  if [Account_Login] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{Account_Login}"
        "has_principal" => "true"
      }
      on_error => "no_account_login"
    }
  }
  if [Account_Creation_Timestamp] != "" {
    mutate {
      replace => {
        "account_creation_timestamp_label.key" => "Account Creation Timestamp"
        "account_creation_timestamp_label.value.string_value" => "%{Account_Creation_Timestamp}"
      }
      on_error => "no_account_creation_timestamp"
    }
    if ![no_account_creation_timestamp] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "account_creation_timestamp_label"
        }
        on_error => "account_creation_timestamp_label_merge_failed"
      }
    }
  }
  if [Account_Modification_Timestamp] != "" {
    mutate {
      replace => {
        "account_modification_timestamp_label.key" => "Account Modification Timestamp"
        "account_modification_timestamp_label.value.string_value" => "%{Account_Modification_Timestamp}"
      }
      on_error => "no_account_modification_timestamp"
    }
    if ![no_account_modification_timestamp] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "account_modification_timestamp_label"
        }
        on_error => "account_modification_timestamp_label_merge_failed"
      }
    }
  }
  if [Account_Status_DESC] != "" {
    mutate {
      replace => {
        "account_status_desc_label.key" => "Account Status DESC"
        "account_status_desc_label.value" => "%{Account_Status_DESC}"
      }
      on_error => "no_account_status_desc"
    }
    if not [no_account_status_desc] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "account_status_desc_label"
        }
        on_error => "account_status_desc_label_merge_failed"
      }
    }
  }
  if [Object_Owner_Name] != "" {
    mutate {
      replace => {
        "target.resource.name" => "%{Object_Owner_Name}"
        "has_target" => "true"
      }
      on_error => "no_object_owner_name"
    }
  }
  if [User_Group_Name] != "" {
    mutate {
      merge => {
        "principal.user.group_identifiers" => "User_Group_Name"
      }
      on_error => "no_user_group_name"
    }
    if ![no_user_group_name] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
        on_error => "no_user_group_name"
      }
    }
  }
  if [User] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{User}"
        "has_principal" => "true"
      }
      on_error => "no_User"
    }
  }
  if [user] != "" {
    mutate {
      replace => {
        "target.user.user_display_name" => "%{user}"
        "has_target" => "true"
      }
      on_error => "no_user"
    }
  }
  if [Account] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{Account}"
        "has_principal" => "true"
      }
      on_error => "no_account"
    }
  }
  if [Session] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{Session}"
        "has_target" => "true"
      }
      on_error => "no_session"
    }
  }
  if [Timestamp] != "" {
    mutate {
      replace => {
        "timestamp_label.key" => "Timestamp"
        "timestamp_label.value.string_value" => "%{Timestamp}"
      }
      on_error => "no_timestamp"
    }
    if ![no_timestamp] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "timestamp_label"
        }
        on_error => "timestamp_label_merge_failed"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [src] != "" {
    mutate {
      rename => {
        "src" => "event.idm.read_only_udm.src"
      }
    }
  }
  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  } else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  } else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "MICROSTRATEGY"
      "event.idm.read_only_udm.metadata.product_name" => "MICROSTRATEGY"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
