# Product: CITRIX_ANALYTICS
# Category: Monitoring of DaaS
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2024-06-03
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "security_result" => ""
      "udm_event_type" => ""
      # datasourceCVADEventDetails
      "event_type" => ""
      "tenant_id" => ""
      "entity_id" => ""
      "entity_type" => ""
      "timestamp" => ""
      "version" => ""
      "event_id" => ""
      "occurrence_event_type" => ""
      "product" => ""
      "client_ip" => ""
      "session_key" => ""
      "app_name" => ""
      "product_version" => ""
      "device_id" => ""
      "domain" => ""
      "os_name" => ""
      "os_version" => ""
      "os_extra_info" => ""
      "workspaceAppStatus" => ""
      "printer_name" => ""

      # indicatorEventDetails
      "session_user_name" => ""
      "server_name" => ""

      # indicatorSummary
      "severity" => ""
      "indicator_category" => ""
      "indicator_name" => ""
      "data_source" => ""
      "occurrence_details.condition" => ""
      "occurrence_details.type" => ""
      "occurrence_details.new_entities" => ""
      "risk_probability" => ""
      "ui_link" => ""

      # riskScoreChange
      "alert_value" => ""
      "cur_riskscore" => ""
      "alert_type" => ""
      "alert_message" => ""

    }
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }
  if [timestamp] != "" {
    date {
      match => ["timestamp", "ISO8601"]
      on_error => "invalid_date"
    }
  }

  if [device_id] != "" && [device_id] != "NA"{
    # device_id is the user's machines hostname
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{device_id}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{device_id}"
      }
      on_error => "replace_failed"
    }
  }
 if [event_type] != "" && [event_type] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" =>
            "%{event_type}"
      }
      on_error => "replace_failed"
    }
 }
 if [occurrence_event_type] != "" && [occurrence_event_type] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" =>
            "%{occurrence_event_type}"
      }
      on_error => "replace_failed"
    }
    if [occurrence_event_type] == "Session.Logon" ||
       [occurrence_event_type] == "Account.Logon" {
      mutate {
        replace => {
          "udm_event_type" => "USER_LOGIN"
          "event.idm.read_only_udm.extensions.auth.type" =>
              "AUTHTYPE_UNSPECIFIED"
        }
        on_error => "replace_failed"
      }
    } else if [occurrence_event_type] == "Session.End" ||
              [occurrence_event_type] == "Account.Logout" {
      mutate {
        replace => {
          "udm_event_type" => "USER_LOGOUT"
          "event.idm.read_only_udm.extensions.auth.type" =>
              "AUTHTYPE_UNSPECIFIED"
        }
        on_error => "replace_failed"
      }
    } else if [occurrence_event_type] == "App.Start" ||
              [occurrence_event_type] == "App.End" {
      if [occurrence_event_type] == "App.Start" {
        mutate {
          replace => {
            "udm_event_type" => "PROCESS_LAUNCH"
          }
          on_error => "replace_failed"
        }
      } else {
        mutate {
          replace => {
            "udm_event_type" => "PROCESS_TERMINATION"
          }
          on_error => "replace_failed"
        }
      }
    } else if [occurrence_event_type] == "Printing" {
      mutate {
        replace => {
          "udm_event_type" => "USER_RESOURCE_ACCESS"
          "event.idm.read_only_udm.target.resource.name" => "%{printer_name}"
        }
        on_error => "replace_failed"
      }
    }
  }
  if [udm_event_type] in ["USER_LOGOUT", "USER_LOGIN"] {
    # user field belongs in target for these event types
    if [session_user_name] != "" && [session_user_name] != "NA"{
      mutate {
        replace => {
          "event.idm.read_only_udm.target.user.user_display_name" =>
              "%{session_user_name}"
          "event.idm.read_only_udm.target.user.userid" => "%{session_user_name}"
        }
        on_error => "replace_failed"
      }
    }
    if [entity_type] == "user" && [entity_id] != "" && [entity_id] != "NA" {
      if [entity_id] =~ "^.+@.+$" {
        mutate {
          merge => {
            "event.idm.read_only_udm.target.user.email_addresses" =>
              "entity_id"
          }
          on_error => "merge_failed"
        }
      } else {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.user.userid" => "%{entity_id}"
          }
          on_error => "replace_failed"
        }
      }
    }
  } else {
    # non login/logout event user details goes into principal
    if [session_user_name] != "" && [session_user_name] != "NA"{
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.user_display_name" =>
              "%{session_user_name}"
          "event.idm.read_only_udm.principal.user.userid" =>
              "%{session_user_name}"
        }
        on_error => "replace_failed"
      }
    }
    if [entity_type] == "user" && [entity_id] != "" && [entity_id] != "NA" {
      if [entity_id] =~ "^.+@.+$" {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.user.email_addresses" =>
              "entity_id"
          }
          on_error => "merge_failed"
        }
      } else {
        mutate {
          replace => {
            "event.idm.read_only_udm.principal.user.userid" => "%{entity_id}"
          }
          on_error => "replace_failed"
        }
      }
      if [udm_event_type] == "" {
        mutate {
          replace => {
            "udm_event_type" => "USER_UNCATEGORIZED"
          }
          on_error => "replace_failed"
        }
      }
    }
  }
  if [app_name] != "" &&
       ([app_name] != "NA" ||
        [udm_event_type] in ["PROCESS_LAUNCH", "PROCESS_TERMINATION"]) {
          # NA when unknown process launch/termination event
      mutate {
        replace => {
          "event.idm.read_only_udm.target.application" => "%{app_name}"
        }
        merge => {
          "event.idm.read_only_udm.target.process.file.names" => "app_name"
        }
        on_error => "no_field"
      }
  }

  if [os_name] =~ "(?i)windows" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.platform" => "WINDOWS"
      }
      on_error => "replace_failed"
    }
  }
  else if [os_name] =~ "(?i)mac" or [os_name] =~ "(?i)osx" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.platform" => "MAC"
      }
      on_error => "replace_failed"
    }
  }
  else if [os_name] =~ "(?i)linux" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.platform" => "LINUX"
      }
      on_error => "replace_failed"
    }
  }
  if [os_version] != "" && [os_version] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.platform_version" => "%{os_version}"
      }
      on_error => "replace_failed"
    }
  }
  if [os_extra_info] != "" && [os_extra_info] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.platform_patch_level" =>
          "%{os_extra_info}"
      }
      on_error => "replace_failed"
    }
  }
  if [domain] != "" && [domain] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.administrative_domain" => "%{domain}"
      }
      on_error => "replace_failed"
    }
  }
  if [session_key] != "" && [session_key] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{session_key}"
      }
      on_error => "replace_failed"
    }
  }
  if [tenant_id] != "" && [tenant_id] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_deployment_id" =>
            "%{tenant_id}"
      }
      on_error => "replace_failed"
    }
  }
  if [event_id] != "" && [event_id] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{event_id}"
      }
      on_error => "replace_failed"
    }
  }
  if [client_ip] != "" && [client_ip] != "NA" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "client_ip"
          "event.idm.read_only_udm.principal.asset.ip" => "client_ip"
        }
        on_error => "merge_failed"
      }
  }
  if [severity] != "" && [severity] != "NA" {
    # https://docs.citrix.com/en-us/security-analytics/custom-risk-indicators#selecting-the-severity
    mutate {
      uppercase => ["severity"]
    }
    mutate {
      replace => {
        "security_result.severity" => "%{severity}"
      }
      on_error => "replace_failed"
    }
  }

  if [risk_probability] != "" && [risk_probability] != "NA" {
    mutate {
      copy => {
        "security_result.confidence_score" => "risk_probability"
      }
      on_error => "copy_failed"
    }
  }
  if [alert_value] != "" {
      mutate {
        convert => {
          "alert_value" => "string"
        }
        on_error => "convert_failed"
      }
      mutate {
        replace => {
          "label.value" => "%{alert_value}"
          "label.key" => "alert_value"
        }
        on_error => "replace_failed"
      }
      mutate {
        merge => {
          "security_result.outcomes" => "label"
        }
        on_error => "merge_failed"
      }
      mutate {
        replace => {
          "label" => ""
        }
      }
  }
  if [cur_riskscore] != "" && [cur_riskscore] != "NA" {
    mutate {
      copy => {
        "security_result.risk_score" => "cur_riskscore"
      }
      on_error => "copy_failed"
    }
  }
  if [indicator_name] != "" && [indicator_name] != "NA" {
      mutate {
        replace => {
          "security_result.description" => "%{indicator_name}"
        }
        on_error => "replace_failed"
      }
  }
  if [alert_message] != "" && [alert_message] != "NA" {
      mutate {
        replace => {
          "security_result.action_details" => "%{alert_message}"
        }
        on_error => "replace_failed"
      }
  }
  if [occurrence_details][type] != "" && [occurrence_details][type] != "NA" {

      mutate {
        replace => {
          "analytic.analytic" => "%{occurrence_details.type}"
        }
        on_error => "replace_failed"
      }
      mutate {
        merge => {
          "security_result.analytics_metadata" => "analytic"
        }
        on_error => "merge_failed"
      }
  }
  if [occurrence_details][condition] != "" &&
     [occurrence_details][condition] != "NA" {
      mutate {
        replace => {
          "label.value" => "%{occurrence_details.condition}"
          "label.key" => "condition"
        }
        on_error => "replace_failed"
      }
      mutate {
        merge => {
          "security_result.detection_fields" => "label"
        }
        on_error => "merge_failed"
      }
  }
  if [occurrence_details][new_entities] != "" &&
     [occurrence_details][new_entities] != "NA" {
      mutate {
        replace => {
          "label" => ""
        }
        on_error => "replace_failed"
      }

      mutate {
        replace => {
          "label.value" => "%{occurrence_details.new_entities}"
          "label.key" => "new_entities"
        }
        on_error => "replace_failed"
      }
      mutate {
        merge => {
          "security_result.detection_fields" => "label"
        }
        on_error => "merge_failed"
      }
  }
  if [indicator_category] != "" && [indicator_category] != "NA" {
    # https://docs.citrix.com/en-us/security-analytics/users-dashboard#risk-categories
    if [indicator_category] == "Data exfiltration" {
      mutate {
        replace => {
          "category" => "DATA_EXFILTRATION"
        }
        merge => {
          "security_result.category" => "category"
        }
        on_error => "indicator_failed"
      }
    } else {
      # other: "Compromised users" "Insider threats"
      mutate {
        replace => {
          "category" => "UNKNOWN_CATEGORY"
        }
      }
      mutate {
        merge => {
          "security_result.category" => "category"
        }
        on_error => "merge_failed"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "merge_failed"
    }
  }

  if [ui_link] != "" && [ui_link] != "NA" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.url_back_to_product" => "%{ui_link}"
      }
      on_error => "replace_failed"
    }
  }
  if [workspaceAppStatus] != "" && [workspaceAppStatus] != "Supported" {
    mutate {
      replace => {
        "vulnerability.name" => "Workspace App Status: %{workspaceAppStatus}"
      }
      on_error => "replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.asset.vulnerabilities" =>
          "vulnerability"
      }
      on_error => "merge_failed"
    }
  }
  if [server_name] != "" && [server_name] != "NA" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{server_name}"
        "intermediary.asset.hostname" => "%{server_name}"
      }
      on_error => "replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
    }
  }

  if [udm_event_type] == "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
      on_error => "replace_failed"
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{udm_event_type}"
      }
      on_error => "replace_failed"
    }
  }
  if [udm_event_type] in ["USER_LOGIN", "USER_LOGOUT"] && [entity_id] == "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
      on_error => "replace_failed"
    }
  }

  if [product] == "" || [product] == "NA" && [data_source] != "" {
    mutate {
      replace => {
        "product" => "%{data_source}"
      }
      on_error => "replace_failed"
    }

  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "%{product}"
      "event.idm.read_only_udm.metadata.vendor_name" => "CITRIX_ANALYTICS"
      "event.idm.read_only_udm.metadata.product_version" => "%{product_version}"
    }
    on_error => "replace_failed"
  }

  mutate {
    merge => {
      "@output" => "event"
    }
    on_error => "merge_failed"
  }
}
