# Product: CLEARSWIFT
# Category: Information Security
# Supported Format: SYSLOG
# Reference: N/A
# Last Updated: 2023-11-22
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "event_type" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "extensions" => ""
      "metadata" => ""
      "principal_host" => ""
      "target_host" => ""
      "has_target" => "false"
      "has_principal" => "false"
      "target_application" => ""
      "prod_event_type" => ""
      "desc" => ""
      "severity" => ""
      "target_url" => ""
      "security_result" => ""
      "file_path" => ""
      "has_target_file" => "false"
      "description" => ""
      "response_code" => ""
      "target_ip" => ""
      "has_target_url" => "false"
      "is_http" => "false"
      "key1" => ""
      "value1" => ""
      "key2" => ""
      "value2" => ""
      "key3" => ""
      "value3" => ""
    }
  }
  grok {
    match => {
      "message" => [
          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:principal_host} %{HOSTNAME:target_application}\\s+- - -\\s+Successful download: %{DATA:target_url} %{GREEDYDATA:prod_event_type}",
          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:principal_host} %{HOSTNAME:target_application}\\s+- - -\\s+%{DATA:severity} \\[%{DATA:prod_event_type}\\]-\\s+%{GREEDYDATA:desc}"
          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:principal_host} %{HOSTNAME:target_application}\\s+- - -\\s+%{SYSLOGTIMESTAMP} %{HOSTNAME:principal_host} %{HOSTNAME:target_host}:\\s+%{GREEDYDATA:desc}"
          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:principal_host} %{HOSTNAME:target_application}\\s+- - -\\s+%{DATA:prod_event_type} %{DATA:severity} %{GREEDYDATA:desc}"
          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:principal_host} %{HOSTNAME:target_application}\\s+- - -\\s+%{DATA:prod_event_type} %{DATA:severity} %{WORD}: %{GREEDYDATA:desc}"
          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:principal_host} %{HOSTNAME:target_application}\\s+- - -\\s+%{DATA:prod_event_type} %{DATA:severity} %{GREEDYDATA:desc}"
          "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:principal_host} %{HOSTNAME:target_application}\\s+- - -\\s+%{INT:response_code}\\|%{INT}\\|%{INT}\\|%{IP:target_ip}%{DATA}\\\"%{GREEDYDATA}\\|%{GREEDYDATA:target_url}"
        ]
    }
    on_error => "grok_fail"
    overwrite  => ["timestamp","principal_host","target_application","desc","severity","prod_event_type","desc","target_url","target_host","response_code","target_ip"]
  }
  if [desc] != "" {
    grok {
      match => {
        "desc" => ["Attempting SAL download from:\\s+%{GREEDYDATA:target_url}",
                  "%{DATA}: \\[%{DATA}\\] %{DATA:target_host} ...%{GREEDYDATA}"
                  "%{DATA} \\[%{DATA}\\] %{GREEDYDATA:description}"
                  "\\[%{DATA}\\] %{DATA:target_host} %{GREEDYDATA}",
                  "%{DATA:severity}: %{GREEDYDATA:description}",
                  "%{INT} RESPMOD %{INT:response_code} %{GREEDYDATA:target_url}"
                  "ManagedList:%{DATA:target_url}?file=%{GREEDYDATA:file_path}"
                  "%{DATA}, %{DATA:key1} \\[%{DATA:value1}\\], %{DATA:key2} \\[%{DATA:value2}\\], %{DATA:key3} \\[%{DATA:value3}\\]"
        ]
      }
      on_error => "no_match"
      overwrite => ["target_url","prod_event_type","target_host","desc","severity","file_path","description","response_code","key1","value1","key2","value2","key3","value3"]
    }

    if [no_match] {
      mutate {
        replace => {
          "metadata.description" => "%{desc}"
        }
        on_error => "desc_error"
      }
    }
    if [description] != "" {
      mutate {
        replace => {
          "metadata.description" => "%{description}"
        }
        on_error => "description_error"
      }
    }
  }
  if [file_path] != "" {
    mutate {
      replace  => {
        "target.file.full_path" => "%{file_path}"
        "has_target_file" => "true"
      }
      on_error => "file_path_error"
    }
  }
  if [target_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "target_ip"
      }
      replace => {
        "has_target" => "true"
      }
      on_error => "ip_error"
    }
  }
  if [response_code] != "" {
    mutate {
      replace => {
        "network.http.response_code" => "%{response_code}"
        "is_http" => "true"
      }
      convert => {
        "network.http.response_code" => "integer"
      }
      on_error => "not_integer"
    }
  }
  if [key1] != "" and [value1] != "" {
    mutate {
      replace => {
        "label_1.value" => "%{value1}"
        "label_1.key" => "%{key1}"
      }
      on_error => "label_1_error"
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "label_1"
      }
      on_error => "label_1_merge_error"
    }
  }
  if [key2] != "" and [value2] != "" {
    mutate {
      replace => {
        "label_2.value" => "%{value2}"
        "label_2.key" => "%{key2}"
      }
      on_error => "label_2_error"
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "label_2"
      }
      on_error => "label_2_merge_error"
    }
  }
  if [key3] != "" and [value3] != "" {
    mutate {
      replace => {
        "label_3.value" => "%{value3}"
        "label_3.key" => "%{key3}"
      }
      on_error => "label_3_error"
    }
    mutate {
      merge => {
        "security_result.detection_fields" => "label_3"
      }
      on_error => "label_3_merge_error"
    }
  }
  if [target_url] != "" {
    mutate {
      replace => {
        "target.url" => "%{target_url}"
        "has_target_url" => "true"
      }
      on_error => "target_url_error"
    }
  }
  if [principal_host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{principal_host}"
        "has_principal" => "true"
      }
      on_error => "principal_host_not_present"
    }
  }
  if [target_host] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{target_host}"
        "has_target" => "true"
      }
      on_error => "target_host_not_present"
    }
  }
  if [target_application] != "" {
    mutate {
      replace => {
        "target.application" => "%{target_application}"
      }
      on_error => "target_application_not_present"
    }
  }
  if [prod_event_type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{prod_event_type}"
      }
      on_error => "prod_event_type_error"
    }
  }
  if [severity] != "" {
    if [severity] =~ "(?i)info" {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
        on_error => "severity_error"
      }
    }
    else if [severity] =~ "(?i)Error" {
      mutate {
        replace => {
          "security_result.severity" => "ERROR"
        }
        on_error => "severity_error"
      }
    }
    else if [severity] =~ "(?i)Warning" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
        on_error => "severity_error"
      }
    }
    else {
      mutate {
        replace => {
          "security_result.severity" => "UNKNOWN_SEVERITY"
        }
        on_error => "severity_error"
      }
    }
  }
  if [has_principal] == "true" and [has_target] == "true" and [has_target_url] == "true" and [is_http] == "true" {
    mutate {
      replace => {
        "network.application_protocol" => "HTTP"
      }
      on_error => "protocol_error"
    }
    mutate {
      replace => {
        "event_type" => "NETWORK_HTTP"
      }
      on_error => "event_type_error"
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" and [network] != "" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
      on_error => "event_type_error"
    }
  }
  else if [has_principal] == "true" and ([has_target_file] == "true" or [has_target_url] == "true") {
    mutate {
      replace => {
        "event_type" => "USER_RESOURCE_ACCESS"
      }
      on_error => "event_type_error"
    }
  }
  else if [has_principal] == "true" and [has_target] == "false" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
      on_error => "event_type_error"
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event_type" => "USER_LOGIN"
      }
      on_error => "event_type_error"
    }
    mutate {
      replace => {
        "extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
      on_error => "extensions_error"
    }
  }
  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
      on_error => "event_type_error"
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
      on_error => "event_type_error"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "sec_result_error"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
