# Product: IVANTI ENDPOINT MANAGER MOBILE
# Category: MOBILE
# Supported Format: SYSLOG
# Reference: N/A
# Last Updated: 2026-05-04
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "has_user" => "false"
      "has_principal" => "false"
      "has_target" => "false"
      "has_http" => "false"
      "intermediary" => ""
      "security_result" => ""
      "syslog_timestamp" => ""
      "hostname" => ""
      "program" => ""
      "product_version" => ""
      "event_timestamp" => ""
      "module_info" => ""
      "module" => ""
      "severity" => ""
      "security_result_description" => ""
      "file_info" => ""
      "file" => ""
      "line" => ""
      "client_ip" => ""
      "client_port" => ""
      "event_code" => ""
      "url" => ""
      "target_ip" => ""
      "target_port" => ""
      "description" => ""
      "principal_hostname" => ""
      "pid" => ""
      "kv_data" => ""
      "user" => ""
      "clean_timestamp" => ""
      "year" => ""
    }
  }
  grok {
    match => {
      "message" => [
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},\\[%{DATA:event_timestamp}\\] \\[%{DATA:module_info}\\] \\[pid %{NUMBER:pid}\\] %{GREEDYDATA:security_result_description}",
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},%{DATA:event_timestamp} %{LOGLEVEL:severity}\\s+%{GREEDYDATA:security_result_description}",
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},(?<event_timestamp>%{YEAR}\\s+%{SYSLOGTIMESTAMP}) %{HOSTNAME:principal_hostname} %{GREEDYDATA:security_result_description}",
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},%{SYSLOGTIMESTAMP:event_timestamp} %{HOSTNAME:principal_hostname} %{GREEDYDATA:security_result_description}",
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},%{SYSLOGTIMESTAMP:event_timestamp} %{GREEDYDATA:security_result_description}",
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},\\s*(?<security_result_description>at %{GREEDYDATA})",
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},%{IP:client_ip}:%{NUMBER:client_port} - - %{DATA:event_timestamp} %{GREEDYDATA:security_result_description}",
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},(?<security_result_description>[a-zA-Z0-9\\.\\_]+Exception: %{GREEDYDATA})",
        "%{SYSLOGTIMESTAMP:syslog_timestamp} %{HOSTNAME:hostname} %{WORD:program}: PRODUCT=%{NOTSPACE:product_version},%{GREEDYDATA:kv_data}"
      ]
    }
    on_error => "no_grok_match"
    overwrite => ["syslog_timestamp", "hostname", "program", "product_version", "event_timestamp", "module_info", "pid", "severity", "security_result_description", "kv_data", "principal_hostname", "client_ip", "client_port"]
  }

  if [kv_data] != "" {
    kv {
      source => "kv_data"
      field_split => ","
      value_split => "="
      target => "parsed_kv"
    }
    for key, value in parsed_kv map {
      if [key] == "PID" {
        mutate {
          replace => {
            "event.idm.read_only_udm.principal.process.pid" => "%{value}"
          }
          on_error => "no_pid"
        }
      }
      else if [key] == "USER" {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.user.userid" => "%{value}"
            "has_user" => "true"
          }
          on_error => "no_user"
        }
      }
      else if [key] == "COMMAND" {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.process.command_line" => "%{value}"
          }
          on_error => "no_command_line"
        }
      }
      else {
        mutate {
          replace => {
            "kv_field_label" => ""
          }
        }
        mutate {
          replace => {
            "kv_field_label.key" => "%{key}"
            "kv_field_label.value" => "%{value}"
          }
          on_error => "no_kv_field"
        }
        if ![no_kv_field] {
          mutate {
            merge => {
              "security_result.detection_fields" => "kv_field_label"
            }
            on_error => "no_kv_field_merge"
          }
        }
      }
    }
  }

  if [security_result_description] != "" {
    grok {
      match => {
        "security_result_description" => [
          "%{NOTSPACE:file_info}: \\[client %{IP:client_ip}:%{NUMBER:client_port}\\] %{GREEDYDATA:description}",
          "%{NOTSPACE:file_info}: \\[client %{IP:client_ip}\\] %{GREEDYDATA:description}",
          "\\[client %{IP:client_ip}:%{NUMBER:client_port}\\] %{GREEDYDATA:description}",
          "\\[client %{IP:client_ip}\\] %{GREEDYDATA:description}",
          "%{GREEDYDATA:description} userId %{WORD:user}, %{GREEDYDATA}",
          "%{GREEDYDATA:description} userId %{WORD:user}",
          "%{GREEDYDATA:description} user %{WORD:user}"
        ]
      }
      overwrite => ["file_info", "client_ip", "client_port", "description", "user"]
      on_error => "no_security_result_description_grok_match"
    }
    if [user] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.user.userid" => "%{user}"
          "has_user" => "true"
        }
        on_error => "no_user_match"
      }
    }
    if [no_security_result_description_grok_match] {
      mutate {
        replace => {
          "security_result.description" => "%{security_result_description}"
        }
        on_error => "no_security_result_description_match"
      }
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{description}"
      }
      on_error => "no_security_result_summary_match"
    }
    grok {
      match => {
        "description" => [
          "%{WORD:event_code}: connecting %{NOTSPACE:url} to %{IP:target_ip}:%{NUMBER:target_port}",
          "%{WORD:event_code}: select protocol from , choices=%{NOTSPACE} for server %{HOSTNAME:principal_hostname}",
          "%{WORD:event_code}: %{GREEDYDATA:description}"
        ]
      }
      on_error => "no_target_match"
      overwrite => ["event_code", "url", "target_ip", "target_port", "principal_hostname", "description"]
    }
  }

  if [principal_hostname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{principal_hostname}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{principal_hostname}"
        "has_principal" => "true"
      }
      on_error => "no_principal_hostname_match"
    }
  }

  if [module_info] != "" {
    grok {
      match => {
        "module_info" => [
          "%{WORD:module}:%{WORD:severity}"
        ]
      }
      on_error => "no_module_match"
      overwrite => ["module", "severity"]
    }
  }

  if [module] != "" {
    mutate {
      replace => {
        "module_kv.key" => "module"
        "module_kv.value.string_value" => "%{module}"
      }
      on_error => "no_module_match"
    }
    if ![no_module_match] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "module_kv"
        }
        on_error => "no_module_merge"
      }
    }
  }

  if [severity] != "" {
    mutate {
      uppercase => ["severity"]
    }
    if [severity] in ["INFO", "DEBUG"] {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    }
    else if [severity] in ["WARN", "MEDIUM"] {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    else if [severity] in ["ERROR", "HIGH"] {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
      }
    }
  }

  if [file_info] != "" {
    mutate {
      replace => {
        "source_location_kv.key" => "source_location"
        "source_location_kv.value.string_value" => "%{file_info}"
      }
      on_error => "no_source_location_match"
    }
    if ![no_source_location_match] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "source_location_kv"
        }
        on_error => "no_source_location_merge"
      }
    }
  }

  if [pid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.pid" => "%{pid}"
      }
      on_error => "no_pid_match"
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{hostname}"
      }
      on_error => "no_hostname_match"
    }
  }

  if [program] != "" {
    mutate {
      merge => {
        "security_result.category_details" => "program"
      }
    }
  }

  if [event_code] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{event_code}"
      }
      on_error => "no_event_code_match"
    }
  }

  if [client_ip] != "" {
    grok {
      match => {
        "client_ip" => [
          "%{IP:client_ip}"
        ]
      }
      on_error => "no_client_ip_match"
      overwrite => ["client_ip"]
    }
    if ![no_client_ip_match] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "client_ip"
          "event.idm.read_only_udm.principal.asset.ip" => "client_ip"
        }
        on_error => "no_client_ip_match"
      }
      if ![no_client_ip_match] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
  }

  if [client_port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.port" => "%{client_port}"
      }
      on_error => "no_client_port_match"
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.principal.port" => "integer"
      }
      on_error => "no_client_port_convert"
    }
  }

  if [target_ip] != "" {
    grok {
      match => {
        "target_ip" => [
          "%{IP:target_ip}"
        ]
      }
      on_error => "no_target_ip_match"
      overwrite => ["target_ip"]
    }
    if ![no_target_ip_match] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "target_ip"
          "event.idm.read_only_udm.target.asset.ip" => "target_ip"
        }
        on_error => "no_target_ip_match"
      }
      if ![no_target_ip_match] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }
  }

  if [target_port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.port" => "%{target_port}"
      }
      on_error => "no_target_port_match"
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.target.port" => "integer"
      }
      on_error => "no_target_port_convert"
    }
  }

  if [url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.url" => "%{url}"
      }
      on_error => "no_url_match"
    }
  }
  if [event_timestamp] != "" {
    grok {
      match => {
        "event_timestamp" => [
          "%{DAY}\\s+(?<clean_timestamp>%{MONTH}\\s+%{MONTHDAY}\\s+%{TIME})\\.%{INT}\\s+(?<year>%{YEAR})"
        ]
      }
      overwrite => ["clean_timestamp", "year"]
      on_error => "no_clean_timestamp"
    }
    if ![no_clean_timestamp] {
      mutate {
        replace => {
          "event_timestamp" => "%{clean_timestamp} %{year}"
        }
        on_error => "no_event_timestamp"
      }
    }
    date {
      match => [
        "event_timestamp", "MMM dd HH:mm:ss yyyy", "MMM  d HH:mm:ss yyyy", "EEE MMM dd HH:mm:ss.SSSSSS yyyy", "EEE MMM  d HH:mm:ss.SSSSSS yyyy", "yyyy-MM-dd HH:mm:ss,SSS", "yyyy-MM-dd HH:mm:ss", "yyyy MMM dd HH:mm:ss", "yyyy MMM  d HH:mm:ss", "MMM dd HH:mm:ss", "MMM  d HH:mm:ss", "yyyy-MM-dd--HH-mm-ss"
      ]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "no_event_timestamp"
    }
  }


  if [has_principal] == "true" and [has_target] == "true" and [has_http] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "IVANTI ENDPOINT MANAGER MOBILE"
      "event.idm.read_only_udm.metadata.vendor_name" => "IVANTI"
    }
  }

  if [product_version] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{product_version}"
      }
      on_error => "no_product_version_match"
    }
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
      on_error => "no_intermediary"
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

