# Product: Cortex XDR
# Category: EDR
# Supported Format: CSV + KV
# Reference: https://docs.paloaltonetworks.com/cortex/cortex-xdr/cortex-xdr-pro-admin/logs/cortex-xdr-log-notification-formats/agent-logs-format-syslog-export-logging-service
# Last Updated: 2022-08-22
# Copyright 2022 Chronicle LLC


filter {
  mutate {
    replace => {
      "cs1" => ""
      "cs2" => ""
      "cs1Label" => ""
      "cs2Label" => ""
      "cs3Label" => ""
      "cat" => ""
      "suser" => ""
      "shost" => ""
      "request" => ""
      "fileHash" => ""
      "targetprocessname" => ""
      "targetprocesscmd" => ""
      "targetprocesssha256" =>""
      "filePath" => ""
      "msg" => ""
      "endpoint_desc" => ""
      "tenantname" => ""
      "sec_category_details" => ""
      "security_result" => ""
      "additional_label" => ""
      "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      "event.idm.read_only_udm.metadata.vendor_name" => "Palo Alto Networks"
      "event.idm.read_only_udm.metadata.product_name" => "Cortex XDR"
    }
  }

  if [message] =~ "Kernel Extension Initialization Failed" {
    mutate {
      gsub => ["message", "To resolve this," , "To resolve this"]
    }
  }

  grok {
    match => {
      "message" => ["%{SYSLOGTIMESTAMP:date_time} %{IP:src_ip} %{INT} %{DATA:date1} %{HOSTNAME:host} - - - - %{GREEDYDATA:csv_data}"]
    }
    on_error => "grok_fail"
  }

  if [grok_fail] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if ![grok_fail] {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "src_ip"
      }
    }

    date {
      match => ["date_time","MMM dd HH:mm:ss", "MMM  d HH:mm:ss"]
      rebase => true
    }
  }

  if [message] =~ "CEF:" {
    csv {
      source => "csv_data"
      separator => "|"
      target => "csv"
      on_error => "not_valid"
    }

    if ![not_valid] {
      mutate {
        rename => {
          "csv.column8" => "cef_body"
        }
      }
    }

    if [not_valid] {
      grok {
        match => {
          "csv_data" => "%{GREEDYDATA:csv_data}end=%{GREEDYDATA:cef_body}"
        }
        overwrite => ["csv_data"]
      }
      csv {
        source => "csv_data"
        separator => "|"
        target => "csv"
        on_error => "not_valid"
      }
      mutate {
        replace => {
          "cef_body" => "end=%{cef_body}"
        }
      }
    }

    mutate {
      rename => {
        "csv.column4" => "product_version"
        "csv.column5" => "eventType"
        "csv.column6" => "desc"
        "csv.column7" => "severity_val"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{product_version}"
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{desc}"
      }
    }

    if [severity_val] == "0" {
      mutate {
        replace => {
          "security_result.severity_details" => "UNKNOWN_SEVERITY"
        }
      }
    } else if [severity_val] == "6" {
      mutate {
        replace => {
          "security_result.severity" => "LOW"
        }
      }
    } else if [severity_val] == "8" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    } else if [severity_val] == "9" {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
      }
    }

    mutate {
      gsub => ["cef_body", " ([A-Za-z0-9]+)=", "#$1="]
    }

    kv {
      source => "cef_body"
      field_split => "#"
      value_split => "="
      on_error => "invalid_format"
    }

    if [suser] != "" {
      mutate {
        gsub => ["suser", "\\[|\\]|\\'", ""]
      }

      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.user_display_name" => "%{suser}"
        }
      }
    }
    if [cs1Label] == "email" and [cs1] =~ "^.+@.+$" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.user.email_addresses" => "cs1"
        }
      }
    }

    if [cs2Label] == "subtype" {
      mutate {
        replace => {
          "security_result.description" => "%{cs2}"
        }
      }
    }

    if [cs3Label] == "result" {
      mutate {
        replace => {
          "security_result.action_details" => "%{cs3}"
        }
      }
    }

    if [msg] != "" {
      mutate {
        replace => {
          "security_result.summary" => "%{msg}"
        }
      }
    }

    grok {
      match => {
        "msg" => ["%{GREEDYDATA} to \\[\\'%{GREEDYDATA:email_receiver}\\'\\]"]
      }
      on_error => "grok_fails"
    }

    if ![grok_fails] and [email_receiver] =~ "[^.+@.+$]" {
      mutate {
        merge => {
          "event.idm.read_only_udm.network.email.to" => "email_receiver"
        }
      }
    }

    if [tenantname] != "" {
      mutate {
        replace => {
          "tenantnme.key" => "Tenant name"
          "tenantnme.value" => "%{tenantname}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "tenantnme"
        }
      }
    }

    if [shost] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{shost}"
        }
      }
    }

    if [request] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.url" => "%{request}"
        }
      }
    }

    if [cs1Label] =~ "Initiated by" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.application" => "%{cs1}"
        }
      }
    }

    if [cs2Label] =~ "Initiator CMD" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.command_line" => "%{cs2}"
        }
      }
    }

    if [filePath] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.file.full_path" => "%{filePath}"
        }
      }
    }

    if [fileHash] != "" {
      mutate {
        lowercase => ["fileHash"]
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.file.sha256" => "%{fileHash}"
        }
      }
    }

   if [targetprocessname] != "" {
     mutate {
       replace => {
         "event.idm.read_only_udm.target.application" => "%{targetprocessname}"
       }
     }
   }

   if [targetprocesscmd] != "" {
     mutate {
       replace => {
         "event.idm.read_only_udm.target.process.command_line" => "%{targetprocesscmd}"
       }
     }
   }

   if [targetprocesssha256] != "" {
     mutate {
      lowercase => ["targetprocesssha256"]
    }
     mutate {
       replace => {
         "event.idm.read_only_udm.target.process.file.sha256" => "%{targetprocesssha256}"
       }
     }
   }

   if [cat] != "" {
     mutate {
       replace => {
         "security_result.rule_name" => "%{cat}"
       }
     }
   }

   if [eventType] == "Management Audit Logs" {
     mutate {
       replace => {
         "event.idm.read_only_udm.metadata.event_type" => "EMAIL_TRANSACTION"
       }
     }
   }
   if [eventType] =~ "(XDR Analytics BIOC|Behavioral Threat)" or [desc] =~ "Behavioral Threat"{
     mutate {
       replace => {
         "event.idm.read_only_udm.metadata.event_type" => "SCAN_NETWORK"
       }
     }
     mutate {
       replace => {
         "sr_category" => "NETWORK_SUSPICIOUS"
       }
     }
     mutate {
       merge => {
         "security_result.category" => "sr_category"
       }
     }
   }
   if [desc] =~ "Suspicious Process Creation" {
     mutate {
       replace => {
         "event.idm.read_only_udm.metadata.event_type" => "SCAN_PROCESS"
       }
     }
   }
 }
  else if [message] =~ "Recurring Rare IP Access" {
    csv {
      source => "csv_data"
      separator => ","
      target => "csv"
      on_error => "not_valid"
    }
    mutate {
      rename => {
        "csv.column8" => "eventType"
        "csv.column9" => "desc"
        "csv.column11" => "sec_desc"
        "csv.column21" => "proto"
        "csv.column34" => "interm_ip"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{desc}"
      }
      on_error => "no_desc"
    }

    mutate {
      replace => {
        "security_result.description" => "%{sec_desc}"
      }
    }

    grok {
      match => {
        "interm_ip" => ["%{IP:interm_ip}"]
      }
      overwrite => ["interm_ip"]
    }

    mutate {
      merge => {
        "inter.ip" => "interm_ip"
      }
    }

    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "inter"
      }
    }

    if [proto] =~ "udp" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.ip_protocol" => "UDP"
        }
      }
    }
  }

  else {
    csv {
        source => "csv_data"
        separator => ","
        target => "csv"
        on_error => "not_valid_csv"
    }
    mutate {
      rename => {
        "csv.column1" => "recordType"
        "csv.column2" => "class"
        "csv.column3" => "subClass"
        "csv.column4" => "subClassId"
        "csv.column5" => "eventType"
        "csv.column6" => "event_category"
        "csv.column7" => "generated_time"
        "csv.column8" => "serverTime"
        "csv.column10" => "facility"
        "csv.column11" => "customerId"
        "csv.column12" => "trapsId"
        "csv.column13" => "serverHost"
        "csv.column14" => "serverComponentVersion"
        "csv.column15" => "regionId"
        "csv.column16" => "isEndpoint"
        "csv.column17" => "agentId"
        "csv.column18" => "severity"
        "csv.column19" => "trapsSeverity"
        "csv.column20" => "messageCode"
        "csv.column21" => "friendlyName"
        "csv.column23" => "msgTextEn"
        "csv.column24" => "userFullName"
        "csv.column25" => "userName"
        "csv.column26" => "userRole"
        "csv.column27" => "userDomain"
        "csv.column28" => "agentTime"
        "csv.column29" => "tzOffset"
        "csv.column30" => "osType"
        "csv.column31" => "isVdi"
        "csv.column32" => "osVersion"
        "csv.column33" => "is64"
        "csv.column34" => "agentIp"
        "csv.column35" => "deviceName"
        "csv.column36" => "deviceDomain"
        "csv.column37" => "agentVersion"
        "csv.column38" => "contentVersion"
        "csv.column39" => "protectionStatus"
        "csv.column40" => "userFullName1"
        "csv.column41" => "userName1"
        "csv.column42" => "userRole1"
        "csv.column43" => "userDomain1"
        "csv.column44" => "messageName"
        "csv.column45" => "messageId"
        "csv.column46" => "processStatus"
        "csv.column47" => "errorText"
        "csv.column48" => "errorData"
        "csv.column49" => "resultData"
        "csv.column50" => "parameters"
        "csv.column51" => "additionalData"
        "csv.column52" => "loggedInUser"
      }
    }
    mutate {
      replace => {
        "sec_category_details" => "%{class}: %{subClass}"
      }
      on_error => "no_class"
    }

    if [sec_category_details] != "" {
      mutate {
        merge => {
          "security_result.category_details" => "sec_category_details"
        }
      }
    }

    mutate {
      replace => {
        "facility_label.value.string_value" => "%{facility}"
      }
      on_error => "value_not_present"
    }

    if ![value_not_present] {
      mutate {
        replace => {
          "facility_label.key" => "Facility"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "facility_label"
        }
      }
    }

    mutate {
      replace => {
        "record_type_label.value.string_value" => "%{recordType}"
      }
      on_error => "value_not_present"
    }

    if ![value_not_present] {
      mutate {
        replace => {
          "record_type_label.key" => "Record Type"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "record_type_label"
        }
      }
    }

    mutate {
      replace => {
        "customer_id_label.value.string_value" => "%{customerId}"
      }
      on_error => "value_not_present"
    }

    if ![value_not_present] {
      mutate {
        replace => {
          "customer_id_label.key" => "Customer ID"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "customer_id_label"
        }
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{serverHost}"
      }
      on_error => "no_host"
    }

    if [regionId] == "10" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.location.country_or_region" => "Americas (N. Virginia)"
        }
      }
    }
    else if [regionId] == "70" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.location.country_or_region" => "EMEA (Frankfurt)"
        }
      }
    }

    if [isEndpoint] == "0" {
      mutate {
        replace => {
          "endpoint_desc" => "No, host is not an endpoint"
        }
      }
    }
    else if [isEndpoint] == "1" {
      mutate {
        replace => {
          "endpoint_desc" => "Yes, host is an endpoint."
        }
      }
    }

    if [endpoint_desc] != "" {
      mutate {
        replace => {
          "endpoint.key" => "Is Endpoint"
          "endpoint.value" => "%{endpoint_desc}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "endpoint"
        }
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{friendlyName}"
      }
      on_error => "no_desc"
    }

    mutate {
      replace => {
        "security_result.description" => "%{msgTextEn}"
      }
      on_error => "no_text"
    }

    if [severity] == "2" {
      mutate {
        replace => {
          "security_result.severity" => "CRITICAL"
        }
      }
    } else if [severity] == "3" {
      mutate {
        replace => {
          "security_result.severity" => "ERROR"
        }
      }
    } else if [severity] == "4" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    } else if [severity] == "5" {
      mutate {
        replace => {
          "security_result.severity" => "LOW"
        }
      }
    } else if [severity] == "6" {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    }

    if [osType] == "1" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.platform" => "WINDOWS"
        }
      }
    } else if [osType] == "2" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.platform" => "MAC"
        }
      }
    } else if [osType] == "3" {
      mutate {
        replace => {
          "os_platform.key" => "OS"
          "os_platform.value" => "%{osType}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "os_platform"
        }
      }
    } else if [osType] == "4" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.platform" => "LINUX"
        }
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.target.platform_version" => "%{osVersion}"
      }
      on_error => "no_os_version"
    }

    if [isVdi] == "1" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.resource.resource_type" => "VIRTUAL_MACHINE"
        }
      }
    }

    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "agentIp"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{deviceName}"
      }
      on_error => "no_device_name"
    }

    if [friendlyName] =~ "Kernel Extension Initialization Failed|XDR Agent Policy Updated Successfully" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_event_type" => "%{eventType}"
    }
    on_error => "no_event_type"
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
