# Product: CIS Albert Alerts
# Category: Alerts
# Supported Format: SYSLOG, JSON
# Reference: N/A
# Last Updated: 2025-05-19
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "metadata.vendor_name" => "CIS"
      "metadata.product_name" => "Albert"
      "category" => ""
      "principal_port" => ""
      "target_hostname" => ""
      "sensor" => ""
      "intermediary" => ""
      "security_result.severity" => "LOW"
      "src_ip" => ""
      "target_ip" => ""
      "target_port" => ""
      "protocol" => ""
      "priority" => ""
      "datetime" =>  ""
      "hostname" => ""
      "product" => ""
      "extension" => ""
      "sourceip" => ""
      "description" => ""
      "ticket_id" => ""
      "event_id" => ""
      "queue" => ""
      "logical_sensor_id" => ""
      "queue_time" => ""
      "activity_summary" => ""
      "siem_event_id" => ""
      "severity" => ""
      "analysis" => ""
      "previous_escalations" => ""
      "status" => ""
      "has_principal" => "false"
      "has_target" => "false"
    }
  }

  mutate {
    gsub => ["message", "([a-zA-Z0-9_]+)\\\\'", "$1"]
  }

  grok {
    match => {
      "message" => [ "<%{INT:priority}>%{SYSLOGTIMESTAMP:datetime} %{DATA:hostname} %{DATA:product} \\\"%{GREEDYDATA:extension}\"" ]
    }
    overwrite => ["priority", "datetime", "hostname", "product", "extension"]
    on_error => "grok_failed"
  }
  if ![grok_failed] {
  # This is a special case where the extension message has single quotes in it, so it won't be parsed because we replace
  # the ' with \", and then the json extraction fails because it thinks \"not found\" is a variable.
    if [extension] =~ "event_id.*4923422" {
      mutate {
        gsub => ["extension", "Even though the destination file gives a 'not found' error, the destination", "Even though the destination file gives a not found error, the destination"]
      }
    }
    # fix log format from 'description': 'ZoomInfo's Contact Contributor Install'
    # to \"description\": \"ZoomInfo's Contact Contributor Install\"
    mutate {
      gsub => ["extension", "([a-zA-Z]+)\\\\\\'", "$1"]
    }
    mutate {
      gsub => ["extension", "'", "\""]
    }

    # from 'analysis': \"\"Source IP 10.10.10.1 was\"\"
    # to 'analysis': \"Source IP 10.10.10.1 was\"
    mutate {
      gsub => ["extension", "\"\"", "\""]
    }
    mutate {
      gsub => ["extension", "(\\\"analysis\\\": \\\".+)\\\"(.+\\\\n\\\",\\s+\\\")","$1$2"]
    }
    # from word\"s
    # to   word's
    mutate {
      gsub => ["extension", '([a-zA-Z])(\")([a-zA-Z])', "$1'$3"]
    }

    mutate {
      gsub => ["extension", "None,", '"None",']
    }
    mutate {
      gsub => ["extension", "\\\\n\\\\n", " "]
    }
    mutate {
      gsub => ["extension", "\\\\n\\s+", ""]
    }
    mutate {
      gsub => ["extension", "\\\\r\\\\n", " "]
    }
    json {
      source => "extension"
      array_function => "split_columns"
      on_error => "not_json"
    }

    if [not_json] {
      mutate {
        gsub => ["extension", '(\\\"analysis\\\": \\\".+?)\\\"(.+?)\\\"(.+?\\\",\\s+\\\"previous_escalations)',"$1$2$3"]
      }
      mutate {
        gsub => ["extension", "(\\\"analysis\\\": \\\".+?)\\\"(.+?\\\",\\s+\\\"previous_escalations)","$1$2"]
      }
      mutate {
        gsub => ["extension", "(\\\"analysis\\\": \\\".+?)\\\"(.+?\\\",\\s+\\\"previous_escalations)","$1$2"]
      }
      mutate {
        gsub => ["extension", ".\\{.*\\},",","]
      }
      json {
        source => "extension"
        array_function => "split_columns"
        on_error => "extension_not_json"
      }

      if [extension_not_json] {
        grok {
          match => {
            "extension" => [
              '%{DATA:json1}.  Observed.*(?P<json2>, \\\"previo.*)'
              '(?P<json1>.*analysis.*\\.) .*(?P<json2>, \\"previo.*)'
            ]
          }
          on_error => "grok_failed_extension"
        }
        mutate {
          replace =>{
            "extension" => '%{json1}\"%{json2}'
          }
          on_error => "grok_failed_extension"
        }
        json {
          source => "extension"
          array_function => "split_columns"
          on_error => "extension_not_json"
        }
        if [extension_not_json] {
          drop {
            tag => "TAG_MALFORMED_ENCODING"
          }
        }
      }
    }
    # from 'analysis': \"somewebsite[.]com\"
    # to 'analysis': \"somewebsite.com\"
    mutate {
      gsub => ["analysis", "\\[\\.\\]", "."]
    }

    # and replace \n by empty space
    mutate {
      gsub => ["analysis", "\\n", " "]
    }

    # remove [CIS] from description
    mutate {
      gsub => ["description", "^\\[CIS\\] ", "" ]
    }

    date {
      match => ["stime", "yyyy-MM-dd HH:mm:ss"]
    }

    grok {
      match => {
        "analysis" => [
        "%{DATA} %{IP:src_ip} %{DATA} %{IP:target_ip} %{DATA} %{HOSTNAME:target_hostname}\\) %{DATA} %{NUMBER:target_port}/%{WORD:protocol}. %{GREEDYDATA:analisys_extension}",
        "%{DATA} %{IP:src_ip} %{DATA} %{IP:target_ip} %{DATA} %{NUMBER:target_port}/%{WORD:protocol}. %{GREEDYDATA:analisys_extension}",
        "%{DATA} %{IP:src_ip} %{DATA} %{IP:target_ip} %{DATA} %{NUMBER:target_port}/%{WORD:protocol} %{DATA} %{NUMBER:principal_port}/%{WORD:principal_protocol}%{GREEDYDATA:analisys_extension}"
        "%{DATA} %{IP:src_ip} %{DATA} %{IP:target_ip} %{DATA} %{NUMBER}%{DATA}/%{WORD:protocol} \\(source port %{NUMBER:principal_port}%{DATA}/%{WORD:principal_protocol}\\). %{GREEDYDATA:analisys_extension}"
        ]
      }
      overwrite=>["principal_port", "target_hostname", "target_ip", "src_ip", "target_port", "protocol"]
      on_error => "grok_failed_analysis"
    }
    if [src_ip] != "" {
      mutate {
        merge => {
          "principal.ip" => "src_ip"
        }
        on_error => "src_ip_not_found"
      }
      if ![src_ip_not_found] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    if [target_ip] != "" {
      mutate {
        merge => {
          "target.ip" => "target_ip"
        }
        on_error => "target_ip_not_found"
      }
      if ![target_ip_not_found] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }
    if [target_port] != "" {
      mutate {
        replace => {
          "target.port" => "%{target_port}"
        }
        convert => {
          "target.port" => "integer"
        }
      }
    }
    if [protocol] != "" {
      mutate {
        replace => {
          "network.ip_protocol" => "%{protocol}"
        }
      }
    }
    mutate {
      replace => {
        "observer.hostname" => "%{hostname}"
        "security_result.summary" => "%{description}"
        "security_result.description" => "%{analysis}"
      }
    }

    if [principal_port] != "" {
      mutate {
        replace => {
          "principal.port" => "%{principal_port}"
        }
      }

      mutate {
        convert => {
          "principal.port" => "integer"
        }
      }
    }

    if [target_port] == 80 {
      mutate {
        replace => {
          "network.application_protocol" => "HTTP"
        }
      }
    } else if [target_port] == 443 {
      mutate {
        replace => {
          "network.application_protocol" => "HTTPS"
        }
      }
    }

    if [sourceip]  != "" {
      mutate {
        merge => {
          "principal.ip" => "sourceip"
          "principal.asset.ip" => "sourceip"
        }
        on_error => "ip_not_found"
      }
      if ![ip_not_found] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
      if [description] != "" {
        mutate {
          replace => {
            "metadata.description" => "%{description}"
          }
          on_error => "description_not_found"
        }
      }
      if [event_id] != "" {
        mutate {
          replace => {
            "metadata.product_log_id" => "%{event_id}"
          }
          on_error => "event_id_not_found"
        }
      }
      if [queue] != "" {
        mutate {
          replace => {
            "queue_label.key" => "queue"
            "queue_label.value" => "%{queue}"
          }
          on_error => "queue_not_found"
        }
        if ![queue_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "queue_label"
            }
            on_error => "queue_not_found"
          }
        }
      }
      if [logical_sensor_id] != "" {
        mutate {
          replace => {
            "principal.resource.id" => "%{logical_sensor_id}"
          }
          on_error => "logical_sensor_id_not_found"
        }
      }
      if [activity_summary] != "" {
        mutate {
          replace => {
            "activity_summary_label.key" => "activity_summary"
            "activity_summary_label.value" => "%{activity_summary}"
          }
          on_error => "activity_summary_not_found"
        }
        if ![activity_summary_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "activity_summary_label"
            }
            on_error => "activity_summary_not_found"
          }
        }
      }
      if [siem_event_id] != "" {
        mutate {
          replace => {
            "siem_event_id_label.key" => "siem_event_id"
            "siem_event_id_label.value" => "%{siem_event_id}"
          }
          on_error => "siem_event_id_not_found"
        }
        if ![siem_event_id_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "siem_event_id_label"
            }
            on_error => "siem_event_id_not_found"
          }
        }
      }
      if [severity] == "Informational" {
        mutate {
          replace => {
            "security_result.severity" => "INFORMATIONAL"
          }
        }
      }
      else if [severity] == "Warning" {
        mutate {
          replace => {
            "security_result.severity" => "MEDIUM"
          }
        }
      }
      else if [severity] == "Critical" {
        mutate {
          replace => {
            "security_result.severity" => "CRITICAL"
          }
        }
      }
      if [analysis] != "" {
        mutate {
          replace => {
            "security_result.description" => "%{analysis}"
          }
          on_error => "analysis_not_found"
        }
      }
      if [sensor] != "" {
        mutate {
          replace => {
            "principal.hostname" => "%{sensor}"
          }
          on_error => "sensor_not_found"
        }
        if ![sensor_not_found] {
          mutate {
            replace => {
              "has_principal" => "true"
            }
          }
        }
      }
      if [previous_escalations] != "" {
        mutate {
          replace => {
            "previous_escalations_label.key" => "previous_escalations"
            "previous_escalations_label.value" => "%{previous_escalations}"
          }
          on_error => "previous_escalations_not_found"
        }
        if ![previous_escalations_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "previous_escalations_label"
            }
            on_error => "previous_escalations_not_found"
          }
        }
      }
      if [status] != "" {
        mutate {
          replace => {
            "status_label.key" => "status"
            "status_label.value" => "%{status}"
          }
          on_error => "status_not_found"
        }
        if ![status_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "status_label"
            }
            on_error => "status_not_found"
          }
        }
      }

    # try to extract threat_name from description
    grok {
      match => {
        "description" => [
          "Possible %{GREEDYDATA:threat_name} Style IP Address Check",
          "Observed %{GREEDYDATA:threat_name}",
          "Possible %{GREEDYDATA:threat_name}",
          "%{DATA:threat_name} Requesting ClickFraud Commands from CnC"
        ]
      }
      on_error => "not_custom_threat_name"
    }

    if [not_custom_threat_name]{
      mutate {
        replace => {
          "security_result.threat_name" => "%{description}"
        }
      }
    } else {
      mutate {
        replace => {
          "security_result.threat_name" => "%{threat_name}"
        }
      }
    }

    mutate {
      convert => {
        "event_id" => "string"
      }
    }
    mutate {
      replace => {
        "metadata.product_log_id" => "%{event_id}"
      }
    }

    if [event_id] == "4579777" {
      # [CIS] Internal traffic to DHCP client IP running a webserver
      grok {
        match => {
          "analisys_extension" => "%{DATA},%{DATA:agent}, %{DATA}"
        }
        on_error => "agent_value_not_found"
      }

      mutate {
        rename => {
          "agent" => "network.http.user_agent"
        }
        replace => {
          "metadata.event_type" => "NETWORK_HTTP"
          "category" => "NETWORK_SUSPICIOUS"
          "security_result.severity" => "LOW"
        }
      }
    } else if [event_id] in [ "4615033", "4613486", "4657587" ]  {
      # ZoomInfo Contact Contributor Install
      # https://www.joesandbox.com/analysis/53152/0/executive
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_HTTP"
          "category" => "NETWORK_SUSPICIOUS"
          "security_result.severity" => "LOW"
        }
      }

      if [target_hostname] != "" {
        mutate {
          replace => {
            "target.hostname" => "%{target_hostname}"
          }
          on_error => "target_hostname_not_found"
        }
        if ![target_hostname_not_found] {
          mutate {
            replace => {
              "has_target" => "true"
            }
          }
        }
      }
    } else if [event_id] == "4613949" {
      # Possible Zerologon NetrServerAuthenticate with 0x00 Client Credentials (CVE-2020-1472)
      grok {
        match => {
          "analisys_extension" => "%{DATA} \\(%{DATA:cve_code}\\). %{DATA} hxxps://%{DATA:cve_url} %{DATA}"
        }
      }

      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_UNCATEGORIZED"
          "category" => "NETWORK_SUSPICIOUS"
          "security_result.threat_id" => "%{cve_code}"
          "security_result.severity" => "HIGH"
          "security_result.url_back_to_product" => "https://%{cve_url}"
        }
      }
    } else if [event_id] == "4614824" {
      # TAIDOOR APT RAT CnC
      grok {
        match => {
          "analisys_extension" => "%{DATA} hxxp://%{DATA} hxxps://%{GREEDYDATA:url}"
        }
      }
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_UNCATEGORIZED"
          "category" => "NETWORK_COMMAND_AND_CONTROL"
          "security_result.severity" => "HIGH"
          "security_result.url_back_to_product" => "https://%{url}"
        }
      }
    } else if [event_id] == "4615390" {
      # Observed CobaltStrike Style SSL Cert (Amazon Profile)
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_UNCATEGORIZED"
          "category" => "NETWORK_MALICIOUS"
          "security_result.severity" => "HIGH"
        }
      }
    } else if [event_id] == "4615719" {
      # Possible Java/Unk.Backdoor Style IP Address Check
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_HTTP"
          "category" => "NETWORK_SUSPICIOUS"
          "security_result.severity" => "HIGH"
          "target.hostname" => "%{target_hostname}"
        }
        on_error => "target_hostname_not_found"
      }
      if ![target_hostname_not_found] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    } else if [event_id] == "4617278" {
      # Win32.Chroject.B Requesting ClickFraud Commands from CnC
      grok {
        match => {
          "analisys_extension" => "%{DATA}Reference: hxxps://%{DATA:url} %{GREEDYDATA}"
        }
      }

      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_HTTP"
          "category" => "NETWORK_COMMAND_AND_CONTROL"
          "security_result.severity" => "HIGH"
          "security_result.url_back_to_product" => "https://%{url}"
        }
      }
    } else if [event_id] == "4618523" {
      # [Fireeye] Backdoor.HTTP.GORAT.[Build ID]
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_UNCATEGORIZED"
          "category" => "NETWORK_COMMAND_AND_CONTROL"
          "security_result.severity" => "HIGH"
        }
      }
    } else if [event_id] in [ "4651690", "4657520", "4655545", "4655546" ] {
      # 4651690: Internal traffic to DHCP client IP running a webserver
      # 4657520: Internal traffic to DHCP client IP running a webserver
      # 4655545: Possible Apache Struts OGNL Command Execution CVE-2013-2251 action
      # 4655546: Possible Apache Struts OGNL Command Execution CVE-2013-2251 redirectAction
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_UNCATEGORIZED"
          "category" => "NETWORK_SUSPICIOUS"
          "security_result.severity" => "LOW"
        }
      }
    } else if [event_id] in [ "14557562", "14569920", "14571066", "14561867", "14587098" ] {
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_CONNECTION"
          "category" => "NETWORK_SUSPICIOUS"
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    else if [event_id] in [ "14571365",  "14573050" ] {
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_HTTP"
          "category" => "NETWORK_SUSPICIOUS"
          "security_result.severity" => "MEDIUM"
        }
      }
    } else if [event_id] in [ "14558578", "14574181", "14574117"] {
      mutate {
        replace => {
          "metadata.event_type" => "NETWORK_CONNECTION"
          "security_result.severity" => "MEDIUM"
        }
      }
    } else {
      if [has_principal] == "true" && [has_target] == "true" {
        mutate {
          replace => {
            "metadata.event_type" => "NETWORK_CONNECTION"
          }
        }
      }
      else if [sourceip] != "" {
        mutate {
          replace => {
            "metadata.event_type" => "STATUS_UPDATE"
          }
        }
      }
      else if [src_ip] == "" {
        mutate {
          replace => {
            "metadata.event_type" => "GENERIC_EVENT"
          }
        }
      } else {
        mutate {
          replace => {
            "metadata.event_type" => "NETWORK_CONNECTION"
          }
        }
      }


      # Set severity based on log's severity for GENERIC_EVENTs
      if [severity] == "Informational" {
        mutate {
          replace => {
            "security_result.severity" => "LOW"
          }
        }
      } else if [severity] == "Warning" {
        mutate {
          replace => {
            "security_result.severity" => "MEDIUM"
          }
        }
      } else if [severity] == "Critical" {
        mutate {
          replace => {
            "security_result.severity" => "CRITICAL"
          }
        }
      }
    }

    if [category] != "" {
      mutate {
        merge => {
          "security_result.category" => "category"
        }
      }
    }
    if [sensor] != "" {
      mutate {
        replace => {
          "intermediary.hostname" => "%{sensor}"
        }
      }
    }
  }
  else {
    mutate {
      gsub => ["message", "\\r\\n\\s+", ""]
    }
    mutate {
      gsub => ["message", "([a-zA-Z]+)'", "$1"]
    }
    mutate {
      gsub => ["message", "\\'",'\"']
    }
    json {
      source => "message"
      array_function => "split_columns"
      on_error => "not_json"
    }
    if [not_json] {
      drop {
        tag => "TAG_MALFORMED_ENCODING"
      }
    }
    else {
      if [sourceip]  != "" {
        mutate {
          merge => {
            "principal.ip" => "sourceip"
            "principal.asset.ip" => "sourceip"
          }
          on_error => "ip_not_found"
        }
        if ![ip_not_found] {
          mutate {
            replace => {
              "has_principal" => "true"
            }
          }
        }
      }
      if [description] != "" {
        mutate {
          replace => {
            "metadata.description" => "%{description}"
          }
          on_error => "description_not_found"
        }
      }
      if [event_id] != "" {
        mutate {
          replace => {
            "metadata.product_log_id" => "%{event_id}"
          }
          on_error => "event_id_not_found"
        }
      }
      if [queue] != "" {
        mutate {
          replace => {
            "queue_label.key" => "queue"
            "queue_label.value" => "%{queue}"
          }
          on_error => "queue_not_found"
        }
        if ![queue_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "queue_label"
            }
            on_error => "queue_not_found"
          }
        }
      }
      if [logical_sensor_id] != "" {
        mutate {
          replace => {
            "principal.resource.id" => "%{logical_sensor_id}"
          }
          on_error => "logical_sensor_id_not_found"
        }
      }
      if [activity_summary] != "" {
        mutate {
          replace => {
            "activity_summary_label.key" => "activity_summary"
            "activity_summary_label.value" => "%{activity_summary}"
          }
          on_error => "activity_summary_not_found"
        }
        if ![activity_summary_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "activity_summary_label"
            }
            on_error => "activity_summary_not_found"
          }
        }
      }
      if [siem_event_id] != "" {
        mutate {
          replace => {
            "siem_event_id_label.key" => "siem_event_id"
            "siem_event_id_label.value" => "%{siem_event_id}"
          }
          on_error => "siem_event_id_not_found"
        }
        if ![siem_event_id_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "siem_event_id_label"
            }
            on_error => "siem_event_id_not_found"
          }
        }
      }
      if [severity] == "Informational" {
        mutate {
          replace => {
            "security_result.severity" => "INFORMATIONAL"
          }
        }
      }
      else if [severity] == "Warning" {
        mutate {
          replace => {
            "security_result.severity" => "MEDIUM"
          }
        }
      }
      else if [severity] == "Critical" {
        mutate {
          replace => {
            "security_result.severity" => "CRITICAL"
          }
        }
      }
      if [analysis] != "" {
        mutate {
          replace => {
            "security_result.description" => "%{analysis}"
          }
          on_error => "analysis_not_found"
        }
      }
      mutate {
        gsub => ["analysis", "\\[\\.\\]", "."]
      }

      mutate {
        gsub => ["analysis", "\\n", " "]
      }
      grok {
        match => {
          "analysis" => [
          "%{DATA} %{IP:src_ip} %{DATA} %{IP:target_ip} %{DATA} %{HOSTNAME:target_hostname}\\) %{DATA} %{NUMBER:target_port}/%{WORD:protocol}. %{GREEDYDATA:analisys_extension}",
          "%{DATA} %{IP:src_ip} %{DATA} %{IP:target_ip} %{DATA} %{NUMBER:target_port}\\/%{WORD:protocol}. %{GREEDYDATA:analisys_extension}",
          "%{DATA} %{IP:src_ip} %{DATA} %{IP:target_ip} %{DATA} %{NUMBER:target_port}/%{WORD:protocol} %{DATA} %{NUMBER:principal_port}/%{WORD:principal_protocol}%{GREEDYDATA:analisys_extension}"
          "%{DATA} %{IP:src_ip} %{DATA} %{IP:target_ip} %{DATA} %{NUMBER:}%{DATA}/%{WORD:protocol} \\(source port %{NUMBER:principal_port}%{DATA}/%{WORD:principal_protocol}\\). %{GREEDYDATA:analisys_extension}"
          ]
        }
        overwrite=>["principal_port", "target_hostname", "target_ip", "src_ip", "target_port", "protocol", "analisys_extension"]
        on_error => "grok_failed_analysis"
      }
      if [src_ip] != "" {
        mutate {
          merge => {
            "principal.ip" => "src_ip"
            "principal.asset.ip" => "src_ip"
          }
          on_error => "src_ip_not_found"
        }
        if ![src_ip_not_found] {
          mutate {
            replace => {
              "has_principal" => "true"
            }
          }
        }
      }
      if [target_ip] != "" {
        mutate {
          merge => {
            "target.ip" => "target_ip"
            "target.asset.ip" => "target_ip"
          }
          on_error => "target_ip_not_found"
        }
        if ![target_ip_not_found] {
          mutate {
            replace => {
              "has_target" => "true"
            }
          }
        }
      }
      if [target_port] != "" {
        mutate {
          replace => {
            "target.port" => "%{target_port}"
          }
          convert => {
            "target.port" => "integer"
          }
          on_error => "target_port_not_found"
        }
      }
      if [protocol] != "" {
        mutate {
          replace => {
            "network.ip_protocol" => "%{protocol}"
          }
          on_error => "protocol_not_found"
        }
      }

      if [sensor] != "" {
        mutate {
          replace => {
            "principal.hostname" => "%{sensor}"
          }
          on_error => "sensor_not_found"
        }
        if ![sensor_not_found] {
          mutate {
            replace => {
              "has_principal" => "true"
            }
          }
        }
      }
      if [previous_escalations] != "" {
        mutate {
          replace => {
            "previous_escalations_label.key" => "previous_escalations"
            "previous_escalations_label.value" => "%{previous_escalations}"
          }
          on_error => "previous_escalations_not_found"
        }
        if ![previous_escalations_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "previous_escalations_label"
            }
            on_error => "previous_escalations_not_found"
          }
        }
      }
      if [status] != "" {
        mutate {
          replace => {
            "status_label.key" => "status"
            "status_label.value" => "%{status}"
          }
          on_error => "status_not_found"
        }
        if ![status_not_found] {
          mutate {
            merge => {
              "security_result.detection_fields" => "status_label"
            }
            on_error => "status_not_found"
          }
        }
      }
      if [has_principal] == "true" && [has_target] == "true" {
        mutate {
          replace => {
            "metadata.event_type" => "NETWORK_CONNECTION"
          }
        }
      }
      else if [has_principal] == "true" {
        mutate {
          replace => {
            "metadata.event_type" => "STATUS_UPDATE"
          }
        }
      }
      else{
        mutate {
          replace => {
            "metadata.event_type" => "GENERIC_EVENT"
          }
        }
      }
    }
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
    }
  }
  mutate {
    merge => {
      "event.idm.read_only_udm.security_result" => "security_result"
    }
  }

  mutate {
    rename => {
      "metadata" => "event.idm.read_only_udm.metadata"
      "principal" => "event.idm.read_only_udm.principal"
      "target" => "event.idm.read_only_udm.target"
      "observer" => "event.idm.read_only_udm.observer"
      "network" => "event.idm.read_only_udm.network"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
