# Product: Dope Security Secure Web Gateway (CSV)
# Category: Secure Access Service Edge
# Supported Format: CSV,JSON
# Reference: https://inflight.dope.security/dope.console/settings/siem-integration#log-data-format
# Last Updated: 2025-03-12
# Copyright 2025 Google SecOps


filter {
  mutate {
    gsub => ["message","\\r\\n",""]
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }
  if ![not_json]
  {
    mutate {
      replace => {
        "timestamp" => ""
        "principal" => ""
        "metadata" => ""
        "additional" => ""
        "target" => ""
        "security_result" => ""
        "network" => ""
        "has_principal" => "false"
        "has_target" => "false"
        "has_user" => "false"
        "schemaVersion" => ""
        "destination.matchedDestination" => ""
        "destination.url" => ""
        "destination.destinationIP" => ""
        "endpoint.tenantID" => ""
        "endpoint.agentID" => ""
        "endpoint.user" => ""
        "endpoint.deviceName" => ""
        "endpoint.oidcUser" => ""
        "bandwidth.dataSentInBytes" => ""
        "bandwidth.dataReceivedInBytes" => ""
        "policy.verdict" => ""
        "policy.policyType" => ""
        "policy.policyName" => ""
        "policy.categories" => ""
        "request.duration" => ""
        "request.httpVersion" => ""
        "request.processName" => ""
        "request.processTree" => ""
        "dest_ipAdd" => ""
        "dest_ip" => ""
        "has_http" => "false"
      }
    }
    json {
      source => "message"
      array_function => "split_columns"
      on_error => "not_json"
    }
    if [timestamp] != "" {
      date{
        match=>["timestamp","ISO8601"]
        target=>"event.idm.read_only_udm.metadata.event_timestamp"
        on_error => "no_timestamp"
      }
    }
    if [schemaVersion] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.product_version" => "%{schemaVersion}"
        }
        on_error => "no_schemaVersion"
      }
    }
    if [destination][matchedDestination] != "" {
      mutate {
        replace => {
          "dest_ipAdd" => "%{destination.matchedDestination}"
        }
        on_error => "no_matchedDestination"
      }
      grok {
        match =>{
          "dest_ipAdd" => "%{IP:dest_ipAdd}"
        }
        overwrite => ["dest_ipAdd"]
        on_error => "no_matchedDestination"
      }
      if ![no_matchedDestination] {
        mutate {
          merge => {
            "event.idm.read_only_udm.target.ip" => "dest_ipAdd"
            "event.idm.read_only_udm.target.asset.ip" => "dest_ipAdd"
          }
          on_error => "no_matchedDestination"
        }
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
      else {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.hostname" => "%{destination.matchedDestination}"
            "event.idm.read_only_udm.target.asset.hostname" => "%{destination.matchedDestination}"
            "has_target" => "true"
          }
          on_error => "no_matchedDestination"
        }
      }
    }
    if [destination][url] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.url" => "%{destination.url}"
        }
        on_error => "no_url"
      }
    }
    if [destination][destinationIP] != "" {
      mutate {
        replace => {
          "dest_ip" => "destination.destinationIP"
        }
        on_error => "no_destinationIP"
      }
      grok {
        match => {
          "dest_ip" => "%{IP:dest_ip}"
        }
        overwrite => ["dest_ip"]
        on_error => "no_destinationIP"
      }
      if ![no_destinationIP] {
        mutate {
          merge => {
            "event.idm.read_only_udm.target.ip" => "dest_ip"
            "event.idm.read_only_udm.target.asset.ip" => "dest_ip"
          }
          on_error => "no_destinationIP"
        }
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }
    if [endpoint][tenantID] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.asset.attribute.cloud.project.id" => "%{endpoint.tenantID}"
        }
        on_error => "no_tenantID"
      }
    }
    if [endpoint][agentID] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.asset.asset_id" => "DS:%{endpoint.agentID}"
        }
        on_error => "no_agentID"
      }
    }
    if [endpoint][user] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{endpoint.user}"
        }
        on_error => "no_user"
      }
      mutate {
        replace => {
          "has_user" => "true"
        }
      }
    }
    if [endpoint][deviceName] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{endpoint.deviceName}"
          "event.idm.read_only_udm.principal.asset.hostname" => "%{endpoint.deviceName}"
          "has_principal" => "true"
        }
        on_error => "no_deviceName"
      }
    }
    if [endpoint][oidcUser] != "" {
      if [endpoint][oidcUser] =~ "^.+@.+$" {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.user.email_addresses" => "endpoint.oidcUser"
          }
          on_error => "no_oidcUser"
        }
        if ![no_oidcUser] {
          mutate {
            replace => {
              "has_user" => "true"
            }
          }
        }
      }
      else {
        mutate {
          replace => {
            "event.idm.read_only_udm.principal.user.user_display_name" => "%{endpoint.oidcUser}"
          }
          on_error => "no_oidcUser"
        }
      }
    }
    if [bandwidth][dataSentInBytes] != "" {
      mutate {
        convert => {
          "bandwidth.dataSentInBytes" => "uinteger"
        }
      }
      mutate {
        rename => {
          "bandwidth.dataSentInBytes" => "event.idm.read_only_udm.network.sent_bytes"
        }
        on_error => "no_dataSentInBytes"
      }
    }
    if [bandwidth][dataReceivedInBytes] != "" {
      mutate {
        convert => {
          "bandwidth.dataReceivedInBytes" => "uinteger"
        }
      }
      mutate {
        rename => {
          "bandwidth.dataReceivedInBytes" => "event.idm.read_only_udm.network.received_bytes"
        }
        on_error => "no_dataReceivedInBytes"
      }
    }
    if [policy][verdict] != "" {
      if [policy][verdict] == "1" {
        mutate {
          replace => { "verdict_string" => "BLOCK" }
          merge => {  "security_result.action" => "verdict_string" }
        }
      }
      else if [policy][verdict] == "0" {
        mutate {
          replace => { "verdict_string" => "ALLOW" }
          merge => {  "security_result.action" => "verdict_string" }
        }
      }
      else if [policy][verdict] == "2" {
        mutate {
          replace => { "verdict_string" => "CHALLENGE" }
          merge => {  "security_result.action" => "verdict_string" }
        }
      }
    }
    if [policy][policyType] != "" {
      mutate {
        replace => {
          "security_result.rule_type" => "%{policy.policyType}"
        }
        on_error => "no_policyType"
      }
    }
    if [policy][policyName] != "" {
      mutate {
        replace => {
          "security_result.rule_name" => "%{policy.policyName}"
        }
        on_error => "no_policyName"
      }
    }
    if [policy][categories] != "" {
      mutate {
        replace => {
          "value_array" => ""
          "policy_categories_label" => ""
        }
        on_error => "policy_categories_label_not_set"
      }
      mutate {
        replace => {
          "policy_categories_label.key" => "policy_categories_values"
        }
        on_error => "policy_categories_label_key_values_not_set"
      }
      for eventValue in policy.categories {
        mutate {
          replace => {
            "value_array" => ""
          }
        }
        mutate {
          convert => {
            "eventValue" => "string"
          }
          on_error => "no_eventValue"
        }
        mutate {
          replace => {
            "value_array.string_value" => "%{eventValue}"
          }
          on_error => "no_policy_categories_array"
        }
        mutate {
          merge => {
            "policy_categories_label.value.list_value.values" => "value_array"
          }
          on_error => "no_policy_categories_array_label"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "policy_categories_label"
        }
        on_error => "policy_categories_not_set"
      }
    }
    if [request][duration] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.session_duration.seconds" => "%{request.duration}"
        }
        on_error => "no_duration"
      }
      mutate {
        convert => {
          "event.idm.read_only_udm.network.session_duration.seconds" => "integer"
        }
        on_error => "no_duration"
      }
    }
    if [request][httpVersion] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.http.user_agent" => "%{request.httpVersion}"
          "has_http" => "true"
        }
        on_error => "no_httpVersion"
      }
    }
    if [request][processName] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.command_line" => "%{request.processName}"
        }
        on_error => "no_request_processName"
      }
    }
    if [request][processTree] != "" {
      mutate {
        replace => {
          "value_array1" => ""
          "request_processTree_label" => ""
        }
        on_error => "request_processTree_label_not_set"
      }
      mutate {
        replace => {
          "request_processTree_label.key" => "request_processTree_values"
        }
        on_error => "request_processTree_label_key_values_not_set"
      }
      for eventValue in policy.categories {
        mutate {
          replace => {
            "value_array1" => ""
          }
        }
        mutate {
          convert => {
            "eventValue" => "string"
          }
          on_error => "no_eventValue"
        }
        mutate {
          replace => {
            "value_array1.string_value" => "%{eventValue}"
          }
          on_error => "no_request_processTree_array"
        }
        mutate {
          merge => {
            "request_processTree_label.value.list_value.values" => "value_array1"
          }
          on_error => "no_request_processTree_array"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "request_processTree_label"
        }
        on_error => "request_processTree_not_set"
      }
    }
    if [security_result] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "security_result"
        }
        on_error => "no_security_result"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.vendor_name" => "DOPE_SWG"
        "event.idm.read_only_udm.metadata.product_name" => "DOPE_SWG"
      }
    }
    if [has_principal] == "true" and [has_target] == "true" and [has_http] == "true" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
        }
        on_error => "no_http"
      }
    }
    else if [has_principal] == "true" and [has_target] == "true" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
        }
        on_error => "no_principal_and_target"
      }
    }
    else if [has_user] == "true" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
        }
        on_error => "no_user"
      }
    }
    else if [has_principal] == "true"{
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
        }
        on_error => "no_principal"
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        }
        on_error => "no_event_type"
      }
    }
  }
  else{
    csv {
      source => "message"
      separator => ","
      on_error => "not_csv_log_format"
    }
    if [not_csv_log_format] {
      # Unknown format, discard it.
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }

    mutate {
      replace => {
        "timestamp" => "%{column1}"
        "duration_ms" => "%{column2}"
        "domain" => "%{column3}"
        "ip" => "%{column4}"
        "tenant_id" => "%{column5}"
        "endpoint_id" => "%{column6}"
        "user" => "%{column7}"
        "sso_user" => "%{column8}"
        "categories" => "%{column9}"
        "verdict" => "%{column10}"
        "bytes_sent" => "%{column11}"
        "bytes_received" => "%{column12}"
        "policy_type" => "%{column13}"
        "block_detail" => "%{column14}"
        "file_name" => "%{column15}"
        "file_hash" => "%{column16}"
        "process_name" => "%{column17}"
        "url" => "%{column18}"
        "policy_name" => "%{column19}"
        "protocol" => "%{column20}"
        "endpoint_hostname" => "%{column21}"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.vendor_name" => "Dope Security"
        "event.idm.read_only_udm.metadata.product_name" => "SWG"
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
      }
    }
    date {
      match => ["timestamp", "ISO8601"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset_id" => "DS:%{endpoint_id}"
        "event.idm.read_only_udm.principal.hostname" => "%{endpoint_hostname}"
        "event.idm.read_only_udm.target.hostname" => "%{domain}"
        "event.idm.read_only_udm.target.url" => "%{url}"
      }
      merge => {
        "event.idm.read_only_udm.principal.process.file.names" => "process_name"
        "event.idm.read_only_udm.target.ip" => "ip"
      }
    }
    if [sso_user] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{sso_user}"
          "event.idm.read_only_udm.principal.user.account_type" => "DOMAIN_ACCOUNT_TYPE"
        }
      }
    } else {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{user}"
          "event.idm.read_only_udm.principal.user.account_type" => "LOCAL_ACCOUNT_TYPE"
        }
      }
    }

    if [verdict] == "1" {
      mutate {
        replace => { "verdict_string" => "BLOCK" }
        merge => {  "security_result.action" => "verdict_string" }
      }
    } else if [verdict] == "0" {
      mutate {
        replace => { "verdict_string" => "ALLOW" }
        merge => {  "security_result.action" => "verdict_string" }
      }
    } else if [verdict] == "2" {
      mutate {
        replace => { "verdict_string" => "CHALLENGE" }
        merge => {  "security_result.action" => "verdict_string" }
      }
    }
    mutate {
      replace => { "security_result.action_details" => "%{categories}" }
      merge => { "event.idm.read_only_udm.security_result" => "security_result" }
    }

    if [bytes_sent] != "" && [bytes_sent] != "0" {
      mutate {
        convert => {
          "bytes_sent" => "uinteger"
        }
      }
      mutate {
        rename => {
          "bytes_sent" => "event.idm.read_only_udm.network.sent_bytes"
        }
      }
    }
    if [bytes_received] != "" && [bytes_received] != "0" {
      mutate {
        convert => {
          "bytes_received" => "uinteger"
        }
      }
      mutate {
        rename => {
          "bytes_received" => "event.idm.read_only_udm.network.received_bytes"
        }
      }
    }

    if [file_name] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.file.names" => "file_name"
        }
      }
    }

    if [file_hash] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.file.sha256" => "%{file_hash}"
        }
      }
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
