# Product: ARRAYNETWORKS_VPN
# Category: VPN
# Supported Format: SYSLOG, SYSLOG + KV
# References: NA
# Last Updated: 2024-05-14
# Copyright 2024 Chronicle LLC

filter {

    mutate {
        replace => {
            "ssl_message" => ""
            "action" => ""
            "user" => ""
            "protocol" => ""
            "prxy_ip" => ""
            "prxy_port" => "0"
            "observer_ip" => ""
            "src_ip" => ""
            "dst_ip" => ""
            "vpn" => ""
            "timestamp" => ""
            "kv_msg" => ""
            "clientip" => ""
            "mac" => ""
            "hostname" => ""
            "cpuid" => ""
            "src" => ""
            "dst" => ""
            "sport" => ""
            "dport" => ""
            "csv_msg" => ""
            "http_method" => ""
            "response_code" => ""
            # "received_byte" => ""
            "msg" => ""
            "user_agent_string" => ""
            "column1" => ""
            "column2" => ""
            "column3" => ""
            "column4" => ""
            "column7" => ""
            "security_result" => ""
            "has_http_value" => "false"
            "has_principal" => "false"
            "has_target" => "false"
        }
    }

    grok {
        match => {
            "message" =>
            [
            "<%{INT}>(?P<timestamp>%{YEAR} %{MONTH} %{MONTHDAY} %{TIME})  (INFO|NOTICE|ERROR|WARNING)\\s+%{NOTSPACE} %{TIMESTAMP_ISO8601:iso_timestamp} %{IP:observer_ip} %{INT:observer_port} %{HOSTNAME:target_hostname}(:%{INT:target_port})? %{GREEDYDATA:user_agent_string} (?P<http_method>GET|POST|UPDATE|DELETE|PATCH|OPTIONS|HEAD|PROPFIND) %{IP:src_ip} %{INT:response_code} %{URIPATH:uri_path}(%{NOTSPACE:uri_param})? (%{NOTSPACE:uri}|-) (%{IP:dst_ip}|-) (%{INT:dst_port}|-) (%{IP:prxy_ip}|-) (%{INT:prxy_port}|-)",
            "<%{INT}>(?P<timestamp>%{YEAR} %{MONTH} %{MONTHDAY} %{TIME})  (INFO|NOTICE|ERROR|WARNING)\\s+%{NOTSPACE} %{TIMESTAMP_ISO8601:iso_timestamp} %{IP:observer_ip} %{INT:observer_port} %{HOSTNAME:target_hostname}(:%{INT:target_port})? %{GREEDYDATA:user_agent_string} (?P<http_method>GET|POST|UPDATE|DELETE|PATCH|OPTIONS|HEAD|PROPFIND) %{IP:src_ip} %{INT:response_code} %{URIPATH:uri_path}(%{NOTSPACE:uri_param})?",
            "<%{INT}>(?P<timestamp>%{YEAR} %{MONTH} %{MONTHDAY} %{TIME})  (INFO|NOTICE|ERROR|WARNING)\\s+%{NOTSPACE} %{TIMESTAMP_ISO8601:iso_timestamp} (%{IP:src_ip}|-) (-|%{INT:src_port}) (%{IP:observer_ip}|-) (-|%{INT:observer_port}) (?P<http_method>GET|POST|UPDATE|DELETE|PATCH|OPTIONS|HEAD|PROPFIND) (%{IP:dst_ip}|-) (%{INT:response_code}|-) %{NOTSPACE:uri_path} (%{NOTSPACE:uri}|-) (%{IP:dst_ip}|-) (%{INT:dst_port}|-) (%{IP:prxy_ip}|-) (aINT:prxy_port}|-)"

            "<%{INT}>(?P<timestamp>%{YEAR} %{MONTH} %{MONTHDAY} %{TIME})  (INFO|NOTICE|ERROR|WARNING)\\s+%{NOTSPACE} (?P<protocol>TCP|UDP) %{IP:observer_ip} %{INT:observer_port} %{IP:src_ip} %{INT:src_port} %{IP:dst_ip} %{INT:dst_port} %{IP:prxy_ip} %{INT:prxy_port}",
            "<%{INT}>(?P<timestamp>%{YEAR} %{MONTH} %{MONTHDAY} %{TIME})  (INFO|NOTICE|ERROR|WARNING)\\s+%{NOTSPACE} %{TIMESTAMP_ISO8601:iso_timestamp} %{IP:src_ip} %{INT:src_port} (%{IP:observer_ip}|-) (%{INT:observer_port}|-) (%{DATA}|-) %{IP:dst_ip} %{INT:response_code} (%{IP:prxy_ip}|-) (%{INT:prxy_port}|-)",
            "<%{INT}>(?P<timestamp>%{YEAR} %{MONTH} %{MONTHDAY} %{TIME})  (INFO|NOTICE|ERROR|WARNING)\\s+%{NOTSPACE} (?P<ssl_message>SSL): The ciphersuites of client %{IP:src_ip} and server %{HOSTNAME:target_hostname} don't match",
            "<%{INT}>(?P<timestamp>%{YEAR} %{MONTH} %{MONTHDAY} %{TIME})  (INFO|NOTICE|ERROR|WARNING)\\s+%{NOTSPACE} Client %{IP:src_ip} %{DATA:action}, select %{DATA} %{HOSTNAME:proxy_hostname}\\."
            "<%{INT}>(?P<timestamp>%{MONTH} %{MONTHDAY} %{YEAR} %{TIME}) %{DATA} %{DATA:kv_msg}clientip\\(%{DATA:clientip}\\);%{DATA}\\(%{MAC:mac}\\);%{DATA}\\(%{DATA:hostname}\\);%{DATA}\\(%{DATA:cpuid}\\)"
            "<%{INT}>%{MONTH} %{MONTHDAY} %{YEAR} %{TIME} %{DATA} %{NUMBER} %{NUMBER} %{DATA:kv_msg} %{GREEDYDATA:csv_msg}"
            "<%{INT}>(?P<timestamp>%{MONTH} %{MONTHDAY} %{YEAR} %{TIME}) %{DATA} %{GREEDYDATA:kv_msg}"
            ]
        }
        on_error => "generic_grok_fail"
        overwrite => ["ssl_message","action" , "user","protocol","prxy_ip","prxy_port","observer_ip","src_ip", "dst_ip", "vpn", "timestamp","kv_msg", "clientip", "mac", "hostname", "cpuid", "http_method", "response_code", "user_agent_string" ,"csv_msg"]
    }


    grok {
        match => {
            "message" => [
                "<%{INT}>(?P<timestamp>%{YEAR} %{MONTH} %{MONTHDAY} %{TIME})()  (INFO|NOTICE|ERROR|WARNING))?\\s+%{DATA} %{DATA:product_name}: %{GREEDYDATA:description}",
                "<%{INT}>(?P<timestamp>%{MONTH} %{MONTHDAY} %{YEAR} %{TIME}) %{DATA} %{DATA:product_name}: %{GREEDYDATA:description}"
            ]
        }
        on_error => "generic_status_message_error"
        overwrite => ["description"]
    }
    grok {
        match => {
            "message" => "<%{INT}>(?P<timestamp>%{MONTH} %{MONTHDAY} %{YEAR} %{TIME}) %{GREEDYDATA:kv_data}"
        }
        on_error => "no_kv"
    }
    mutate {
        gsub => ["kv_msg","([a-zA-Z0-9]+)=","#$1="]
    }
    if [kv_msg] != "" {
        kv {
            source => "kv_msg"
            field_split => "#"
            value_split => "="
            on_error => "not_kv"
        }
    }
    if [csv_msg] != "" {
        csv {
            source => "csv_msg"
            separator => " "
            on_error => "invalid_format"
        }
    }
    if [column1] != "" {
        mutate {
            merge => {
                "event.idm.read_only_udm.principal.ip" => "column1"
                "event.idm.read_only_udm.principal.asset.ip" => "column1"
            }
            on_error => "no_ip"
        }
        mutate {
            replace => {
                "has_principal" => "true"
            }
        }
    }
    if [column7] != "" {
        grok {
            match => {
                "column7" => "%{IP:dst_ip}"
            }
            overwrite => ["dst_ip"]
            on_error => "no_ip"
        }
    }
    if [hostname] != "" {
        mutate {
            replace => {
                "event.idm.read_only_udm.principal.hostname" => "%{hostname}"
                "event.idm.read_only_udm.principal.asset.hostname" => "%{hostname}"
                "has_principal" => "true"
            }
            on_error => "no_hostname"
        }
    }
    if [mac] != "" {
        mutate {
            merge => {
                "event.idm.read_only_udm.principal.mac" => "mac"
            }
            on_error => "no_mac"
        }
        mutate {
            replace => {
                "has_principal" => "true"
            }
        }
    }
    if [clientip] != "" {
        mutate {
            replace => {
                "event.idm.read_only_udm.principal.ip" => "%{clientip}"
                "event.idm.read_only_udm.principal.asset.ip" => "%{clientip}"
            }
            on_error => "no_clientip"
        }
    }
    if [msg] != "" {
        mutate {
            gsub => ["msg",'\\"',""]
        }
        mutate {
            replace => {
                "security_result.description" => "%{msg}"
            }
            on_error => "no_msg"
        }
    }
    if [src] != "" {
        mutate {
            merge => {
                "event.idm.read_only_udm.principal.ip" => "src"
                "event.idm.read_only_udm.principal.asset.ip" => "src"
            }
            on_error => "no_src"
        }
        mutate {
            replace => {
                "has_principal" => "true"
            }
        }
    }
    if [sport] != "" {
        mutate {
            convert => {
             "sport" => "integer"
            }
            on_error => "already_integer"
        }
        mutate {
            rename => {
                "sport" => "event.idm.read_only_udm.principal.port"
            }
        }
    }
    if [dport] != "" {
        mutate {
            convert => {
             "dport" => "integer"
            }
            on_error => "already_integer"
        }
        mutate {
            rename => {
                "dport" => "event.idm.read_only_udm.target.port"
            }
        }
    }
    if [dst] != "" {
        mutate {
            merge => {
                "event.idm.read_only_udm.target.ip" => "dst"
                "event.idm.read_only_udm.target.asset.ip" => "dst"
            }
            on_error => "no_dst"
        }
        mutate {
            replace => {
                "has_target" => "true"
            }
        }
    }

    if [timestamp] != "" {
        date {
            match => ["timestamp","yyyy MMM dd HH:mm:ss","MMM dd yyyy HH:mm:ss"]
            on_error => "no_timestamp"
        }
    }

    if [no_kv] == false {
        kv {
            source => "kv_data"
            trim_value => "\"" #\\"
            on_error => "no_kv"
        }
        if [user] not in ["", "(null)"]
        {
            mutate {
                replace => {
                    "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
                }
            }
        }
        else {
            mutate {
                replace => {
                    "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
                }
            }
        }

        mutate {
            rename => {
                "msg" => "event.idm.read_only_udm.metadata.product_event_type"
            }
        }
    }


    if [generic_status_message_error] == false {
        mutate {
            replace => {
                "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
            }
        }
    }


    mutate {
        #we had to take the uri_param separately to glue it to the uri because
        #this log type is silly and doesn't give us good values.
        #we also may want to replace it if you need to combine strings
        #you can add variables in a replace string with %{parameter}
        replace => {
            "event.idm.read_only_udm.target.url" =>  "%{uri}%{uri_param}"
        }
        #on error you can set a made up variable to true or false and this will keep going, even if it errors (this is for error handling)
        on_error => "no_uri"
    }

    mutate {
        convert => {
            "dst_port" => "integer"
            "observer_port" => "integer"
            "prxy_port" => "integer"
        }
        on_error => "already_integer"
    }

    #proxy_ip needs to be added to observer. Intermediary is repeated itself so we have to merge it. We just create a variable to do that. We have to run merge twice
    if [prxy_ip] != "" {
        mutate {
            merge => {
                "proxy.ip" => "prxy_ip"
            }
            on_error => "no_proxy_ip"
        }
    }

    if [prxy_port] != 0 {
        mutate {
            rename => {
                "prxy_port" => "proxy.port"
            }
        }
    }

    #then we merge this newly created proxy field that has ip and port
    mutate {
        merge => {
            "event.idm.read_only_udm.intermediary" => "proxy"
        }
        on_error => "no_proxy"
    }


    if [observer_ip] != "" {
        mutate {
            merge  => {
                "event.idm.read_only_udm.observer.ip" => "observer_ip"
            }
            on_error => "no_observer_ip"
        }
    }

    if [src_ip] != "" {
        mutate {
            merge => {
                "event.idm.read_only_udm.principal.ip" => "src_ip"
                "event.idm.read_only_udm.principal.asset.ip" => "src_ip"

            }
            on_error => "no_src_ip"
        }
        mutate {
            replace => {
                "has_principal" => "true"
            }
        }
    }

    if [dst_ip] != "" {
        mutate {
            merge  => {
                "event.idm.read_only_udm.target.ip" => "dst_ip"
                "event.idm.read_only_udm.target.asset.ip" => "dst_ip"
            }
            on_error => "no_dst_ip"
        }
        mutate {
            replace => {
                "has_target" => "true"
            }
        }
    }

    #handling the ssl case
    if [ssl_message] != ""
    {
        mutate {
            replace => {
                "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
            }
            on_error => "no_ssl_message"
        }

        grok {
            match => {
                "message" => "<%{INT}>%{GREEDYDATA}  (INFO|NOTICE|ERROR|WARNING)\\s+%{NOTSPACE} SSL: %{GREEDYDATA:description}\\000"
            }
            overwrite => ["description"]
            on_error => "no_ssl_description"
        }

    }

    if [action] == "login" {
        mutate {
            replace => {
                "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
            }
        }
    }

    if [vpn] != "" {
        mutate {
            merge => {
                "event.idm.read_only_udm.target.user.group_identifiers" => "vpn"
            }
            on_error => "no_vpn"
        }
    }

    if [protocol] != ""{
        mutate {
            rename => {
                "protocol" => "event.idm.read_only_udm.network.ip_protocol"

            }
        }
    }

    mutate {
        rename => {
            "target_hostname" => "event.idm.read_only_udm.target.hostname"
            "dst_port" => "event.idm.read_only_udm.target.port"
            "observer_port" => "event.idm.read_only_udm.observer.port"
            "description" => "event.idm.read_only_udm.metadata.description"
            "product_name" => "event.idm.read_only_udm.metadata.product_name"
            "id" => "event.idm.read_only_udm.principal.application"
        }
    }
    if [user] not in ["", "(null)"] {
        mutate {
            replace => {
                "event.idm.read_only_udm.target.user.userid" => "%{user}"
            }
            on_error => "no_user"
        }
    }
    if [column2] =~ "TCP_MISS" {
      mutate {
        replace => {
          "action" => "BLOCK"
        }
        on_error => "no_action"
      }
    } else {
        mutate {
            replace => {
                "action" => "UNKNOWN_ACTION"
            }
        }
    }
    mutate {
        merge => {
            "security_result.action" => "action"
        }
        on_error => "no_action"
    }
    if [column3] != "" {
        mutate {
            replace => {
             "event.idm.read_only_udm.network.received_bytes" => "%{column3}"
            }
            convert => {
             "event.idm.read_only_udm.network.received_bytes" => "uinteger"
            }
            on_error => "no_received_bytes"
        }
    }


    ### Network Fields
    if [message] =~ "TCP" {
        mutate {
            replace => {
                "event.idm.read_only_udm.network.ip_protocol" => "TCP"
            }
            on_error => "no_protocol"
        }
    }

    if [http_method] != "" {
        mutate {
            replace => {
                "event.idm.read_only_udm.network.http.method" => "%{http_method}"
                "has_http_value" => "true"
            }
            on_error => "no_http_method"
        }
    }
    if [column4] != "" {
        mutate {
            replace => {
                "event.idm.read_only_udm.network.http.method" => "%{column4}"
                "has_http_value" => "true"
            }
            on_error => "no_http_method"
        }
    }

    if [response_code] != "" {
       mutate {
            replace => {
              "event.idm.read_only_udm.network.http.response_code" => "%{response_code}"
              "has_http_value" => "true"
            }
            convert => {
              "event.idm.read_only_udm.network.http.response_code" => "integer"
            }
            on_error => "no_response_code"
       }
    }


    if [user_agent_string] != "" {
        mutate {
            replace => {
                "event.idm.read_only_udm.network.http.user_agent" => "%{user_agent_string}"
                "has_http_value" => "true"
            }
            on_error => "no_http_user_agent"
        }
    }
    if [has_principal] == "true" && [has_target] == "true" {
        if [has_http_value] == "true" {
            mutate {
                replace => {
                    "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
                }
            }
        }
        else {
            mutate {
                replace => {
                    "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
                }
            }
        }
    }
    else if [has_principal] == "true" {
        mutate {
            replace => {
                "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
            }
        }
    }
    else if [user] not in ["", "(null)"] {
        mutate {
            replace => {
                "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
            }
        }
    }
    else {
        mutate {
            replace => {
                "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
            }
        }
    }
    if [security_result] != "" {
        mutate {
            merge => {
                "event.idm.read_only_udm.security_result" => "security_result"
            }
            on_error => "no_security_result"
        }
    }

    mutate {
      merge => {
        "@output" => "event"
      }
    }
  }
