# Product: F5 Shape
# Category: Security log
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2024-08-20
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "act" => ""
      "agentLabel" => ""
      "app" => ""
      "appName" => ""
      "asn" => ""
      "attackCause" => ""
      "browserType" => ""
      "countryName" => ""
      "ctag" => ""
      "deviceExternalId" => ""
      "dhost" => ""
      "dpt" => ""
      "dst" => ""
      "flowLabel" => ""
      "intermediary" => ""
      "isAttack" => "false"
      "prCode" => ""
      "principal" => ""
      "rdt" => ""
      "request" => ""
      "requestClientApplication" => ""
      "requestContext" => ""
      "requestHeader.Accept" => ""
      "requestHeader.Accept-Encoding" => ""
      "requestHeader.Cache-Control" => ""
      "requestHeader.Content-Length" => ""
      "requestHeader.Content-Type" => ""
      "requestHeader.Via" => ""
      "requestHeader.X-Forwarded-For" => ""
      "requestHeader.x-shape-src-virtual" => ""
      "severity" => ""
      "description" => ""
      "msg.transactionResult" => ""
      "msg.requestHeaders" => ""
      "msg.src" => ""
      "msg.dst" => ""
      "msg.trueClientIP" => ""
      "msg.host" => ""
      "msg.uri" => ""
      "msg.hashedUserAgent" => ""
      "msg.responseHeaders" => ""
      "msg.transactionId" => ""
      "msg.hashedUsername" => ""
      "msg.dcgShapeFailedOn" => ""
      "msg.method" => ""
      "msg.sseResponseCode" => ""
      "ShapeShifterId" => ""
      "eventType" => ""
      "eventId" => ""
      "latRequest" => ""
      "latResponse" => ""
      "latTotal" => ""
      "latRspWait" => ""
      "count" => ""
      "latEccWait" => ""
      "requestMethod" => ""
      "src" => ""
      "target" => ""
      "tid" => ""
      "accountInfo" => ""
      "security_result" => ""
      "sec_action" => ""
      "requestHeaders" => ""
      "has_principal_machine" => ""
    }
    convert => {
      "isAttack" => "boolean"
    }
  }

  mutate {
    gsub => ["message","accept-encoding","Accept-Encoding"]
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  mutate {
    gsub => ["message", "([0-9a-zA-Z]): ", "$1\":\""]
  }
  mutate {
    gsub => ["message" , "(requestHeader\"):\\[(.*)\\],", "$1:{$2},"]
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [src] != "" {
    mutate {
      merge => {
        "principal.ip" => "src"
        "principal.asset.ip" => "src"
      }
      on_error => "src_empty"
    }
    mutate {
      replace => {
        "has_principal_machine" => "true"
      }
    }
  }
  else if [msg][src] != "" {
    mutate {
      merge => {
        "principal.ip" => "msg.src"
        "principal.asset.ip" => "msg.src"
      }
      on_error => "src_empty"
    }
    mutate {
      replace => {
        "has_principal_machine" => "true"
      }
    }
  }

  if [msg][src] == "" and [msg][trueClientIP] != "" {
    mutate {
      merge => {
        "principal.ip" => "msg.trueClientIP"
        "principal.asset.ip" => "msg.trueClientIP"
      }
      on_error => "trueClientIP_empty"
    }
    mutate {
      replace => {
        "has_principal_machine" => "true"
      }
    }
  }

  if [msg][host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{msg.host}"
        "principal.asset.hostname" => "%{msg.host}"
      }
      on_error => "host_empty"
    }
    mutate {
      replace => {
        "has_principal_machine" => "true"
      }
    }
  }

  if [dst] != "" {
    mutate {
      merge => {
        "target.ip" => "dst"
        "target.asset.ip" => "dst"
      }
      on_error => "dst_empty"
    }
  }
  else if [msg][dst] != "" {
    mutate {
      merge => {
        "target.ip" => "msg.dst"
        "target.asset.ip" => "msg.dst"
      }
      on_error => "dst_empty"
    }
  }

  if [dpt] != "" {
    mutate {
      rename => {
        "dpt" => "target.port"
      }
      convert => {
        "target.port" => "integer"
      }
    }
  }

  if [dhost] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{dhost}"
      }
    }
  }

  if [requestMethod] != "" {
    mutate {
      rename => {
        "requestMethod" => "event.idm.read_only_udm.network.http.method"
      }
    }
  }

  if [requestContext] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.referral_url" => "%{requestContext}"
      }
    }
  }

  if [request] != "" {
    mutate {
      replace => {
        "target.url" => "%{request}"
      }
    }
  }

  if [msg][uri] != "" {
    mutate {
      replace => {
        "principal.url" => "%{msg.uri}"
      }
      on_error => "uri_empty"
    }
  }

  if [appName] != "" {
    mutate {
      rename => {
        "appName" => "target.application"
      }
    }
  }

  if [countryName] != "" {
    mutate {
      replace => {
        "target.location.country_or_region" => "%{countryName}"
      }
    }
  }

  if [requestClientApplication] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" => "%{requestClientApplication}"
      }
    }
  }

  if [app] != "" {
    mutate {
      uppercase => ["app"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "%{app}"
      }
    }
  }

  if [msg][sseResponseCode] != "" {
    mutate {
      rename => {
        "msg.sseResponseCode" => "event.idm.read_only_udm.network.http.response_code"
      }
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.network.http.response_code" => "integer"
      }
      on_error => "sseResponseCode_already_integer"
    }
  }

  if [prCode] != "" {
    mutate {
      rename => {
        "prCode" => "event.idm.read_only_udm.network.http.response_code"
      }
      convert => {
        "event.idm.read_only_udm.network.http.response_code" => "integer"
      }
    }
  }

  if [requestHeader][X-Forwarded-For] != "" {
    mutate {
      gsub => ["requestHeader.X-Forwarded-For", ",[\\s]*", '","']
      replace => {
        "requestHeader.X-Forwarded-For" => '{\"requestHeader.X-Forwarded-For\":["%{requestHeader.X-Forwarded-For}"]}'
      }
    }

    json {
      source => "requestHeader.X-Forwarded-For"
      array_function => "split_columns"
    }

    for index, x_forwarded_ip in requestHeader.X-Forwarded-For {
      if [index] == 0 and [x_forwarded_ip] != [src] {
        mutate {
          merge => {
            "principal.ip" => "x_forwarded_ip"
          }
        }
        mutate {
          replace => {
            "has_principal_machine" => "true"
          }
        }
      } else if [index] > 0 {
        mutate {
          merge => {
            "intermediary.ip" => "x_forwarded_ip"
          }
        }
      }
    }
  }

  if [requestHeader][x-shape-src-virtual] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.observer.ip" => "requestHeader.x-shape-src-virtual"
      }
    }
  }

  if [deviceExternalId] != "" {
    mutate {
      replace => {
        "security_result.about.asset_id" => "Device External Id: %{deviceExternalId}"
      }
    }
  }

  if [flowLabel] != "" {
    mutate {
      replace => {
        "flow_label.key" => "Flow Label"
        "flow_label.value" => "%{flowLabel}"
      }
      merge => {
        "security_result.about.labels" => "flow_label"
      }
    }
  }

  if [agentLabel] != "" {
    mutate {
      replace => {
        "agent_label.key" => "Agent Label"
        "agent_label.value" => "%{agentLabel}"
      }
      merge => {
        "security_result.about.labels" => "agent_label"
      }
    }
  }

  if [requestHeader][Content-Length] != "" {
    mutate {
      replace => {
        "content_length_label.key" => "Content-Length"
        "content_length_label.value" => "%{requestHeader.Content-Length}"
      }
      merge => {
        "security_result.about.labels" => "content_length_label"
      }
    }
  }

  if [requestHeader][Content-Type] != "" {
    mutate {
      replace => {
        "content_type_label.key" => "Content-Type"
        "content_type_label.value" => "%{requestHeader.Content-Type}"
      }
      merge => {
        "security_result.about.labels" => "content_type_label"
      }
    }
  }

  if [requestHeader][Accept] != "" {
    mutate {
      replace => {
        "accept_label.key" => "Accept"
        "accept_label.value" => "%{requestHeader.Accept}"
      }
      merge => {
        "security_result.about.labels" => "accept_label"
      }
    }
  }

  if [requestHeader][Accept-Encoding] != ""{
    mutate {
      replace => {
        "accept_encoding_label.key" => "Accept-Encoding"
        "accept_encoding_label.value" => "%{requestHeader.Accept-Encoding}"
      }
      merge => {
        "security_result.about.labels" => "accept_encoding_label"
      }
    }
  }

  if [browserType] != "" {
    mutate {
      replace => {
        "browser_type_label.key" => "Browser-Type"
        "browser_type_label.value" => "%{browserType}"
      }
      merge => {
        "security_result.about.labels" => "browser_type_label"
      }
    }
  }

  if [accountInfo] != "" {
    mutate {
      replace => {
        "account_info_label.key" => "Account Info"
        "account_info_label.value" => "%{accountInfo}"
      }
      merge => {
        "security_result.about.labels" => "account_info_label"
      }
    }
  }

  if [requestHeader][Via] != "" {
    mutate {
      replace => {
        "via_label.key" => "Via"
        "via_label.value" => "%{requestHeader.Via}"
      }
      merge => {
        "security_result.about.labels" => "via_label"
      }
    }
  }

  if [asn] != "" {
    mutate {
      replace => {
        "asn_label.key" => "ASN"
        "asn_label.value" => "%{asn}"
      }
      merge => {
        "security_result.about.labels" => "asn_label"
      }
    }
  }

  if [tid] != "" {
    mutate {
      replace => {
        "tid_label.key" => "tid"
        "tid_label.value" => "%{tid}"
      }
      merge => {
        "security_result.about.labels" => "tid_label"
      }
    }
  }

  if [ctag] != "" {
    mutate {
      replace => {
        "ctag_label.key" => "ctag"
        "ctag_label.value" => "%{ctag}"
      }
      merge => {
        "security_result.about.labels" => "ctag_label"
      }
    }
  }

  if [requestHeader][Cache-Control] != "" {
    mutate {
      replace => {
        "cache_label.key" => "Cache-Control"
        "cache_label.value" => "%{requestHeader.Cache-Control}"
      }
      merge => {
        "security_result.about.labels" => "cache_label"
      }
    }
  }

  mutate {
    replace => {
      "transaction_result_label.value" => "%{transactionResult}"
    }
    on_error => "transactionResult_empty"
  }
  if ![transactionResult_empty] {
    mutate {
      replace => {
        "transaction_result_label.key" => "Transaction Result"
      }
    }
    mutate {
      merge => {
        "security_result.about.labels" => "transaction_result_label"
      }
      on_error => "transaction_result_label_empty"
    }
  }

  if [isAttack] {
    if [act] =~ "(?i)PASS" {
      mutate {
        replace => {
          "action" => "ALLOW"
        }
      }
    }
    else {
      mutate {
        replace => {
          "action" => "UNKNOWN_ACTION"
        }
      }
    }
    mutate {
      merge => {
        "security_result.action" => "action"
      }
    }

    if [act] != "" {
      mutate {
        replace => {
          "security_result.action_details" => "%{act}"
        }
      }
    }

    if [attackCause] != "" {
      mutate {
        replace => {
          "security_result.threat_name" => "%{attackCause}"
        }
      }
    }
  }

  if [rdt] != "" {
    grok {
      match => {
        "rdt" => [
          "%{GREEDYDATA:date}%{SPACE}\\(%{DATA:zone}\\)"
        ]
      }
      on_error => "invalid_date_pattern"
    }
    if ![invalid_date_pattern] {
      mutate {
        replace => {
          "rdt" => "%{date} %{zone}"
        }
      }
    }
    date {
      match => ["rdt", "MMM dd yyyy HH:mm:ss Z", "MMM dd yyyy HH:mm:ss"]
    }
  }

  if [msg][requestHeaders] != "" {
    mutate {
      replace => {
        "requestHeaders_id" => "{\"requestHeaders_id_array\":%{msg.requestHeaders}}"
      }
      on_error => "id_empty"
    }
    json {
      source => "requestHeaders_id"
      array_function => "split_columns"
      on_error => "json_parse_failure"
    }

    for requestHeadersId in requestHeaders_id_array {
      mutate {
        replace => {
          "add_label" => ""
        }
      }
      mutate {
        replace => {
          "keydata" => "%{requestHeadersId.key}"
        }
        on_error => "no_key"
      }
      mutate {
        replace => {
          "valuedata" => "%{requestHeadersId.value}"
        }
        on_error => "no_value"
      }
      if ![no_key] and ![no_value] {
        mutate {
          replace => {
            "add_label.value" => "%{valuedata}"
            "add_label.key" => "%{keydata}"
          }
        }
        mutate {
          merge => {
            "principal.resource.attribute.labels" => "add_label"
          }
          on_error => "merge_error"
        }
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" =>
        "%{requestHeaders_id_array.User-Agent}"
      }
      on_error => "no_useragent"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.parsed_user_agent" =>
        "%{requestHeaders_id_array.User-Agent}"
      }
      on_error => "no_useragent"
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.network.http.parsed_user_agent" =>
        "parseduseragent"
      }
      on_error => "no_useragent"
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.referral_url" =>
        "%{requestHeaders_id_array.Referer}"
      }
      on_error => "no_referer"
    }

    mutate {
      replace => {
        "Proxy_Client_IP_label.value.string_value" => "%{requestHeaders_id_array.Proxy-Client-IP}"
      }
      on_error => "no_Proxy_Client_IP"
    }

    if ![no_Proxy_Client_IP] {
      mutate {
        replace => {
          "Proxy_Client_IP_label.key" => "Proxy-Client-IP"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "Proxy_Client_IP_label"
        }
        on_error => "Proxy_Client_IP_label_empty"
      }
    }

    mutate {
      replace => {
        "WF_Forwarded_For_label.value.string_value" =>
        "%{requestHeaders_id_array.WF-Forwarded-For}"
      }
      on_error => "no_WF_Forwarded_For"
    }

    if ![no_WF_Forwarded_For] {
      mutate {
        replace => {
          "WF_Forwarded_For_label.key" => "WF-Forwarded-For"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" =>
          "WF_Forwarded_For_label"
        }
        on_error => "WF_Forwarded_For_label_empty"
      }
    }

    mutate {
      replace => {
        "X_Forwarded_For_label.value.string_value" =>
        "%{requestHeaders_id_array.X-Forwarded-For}"
      }
      on_error => "no_X_Forwarded_For"
    }

    if ![no_X_Forwarded_For] {
      mutate {
        replace => {
          "X_Forwarded_For_label.key" => "X-Forwarded-For"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "X_Forwarded_For_label"
        }
        on_error => "X_Forwarded_For_label_empty"
      }
    }

    mutate {
      replace => {
        "wl_proxy_client_ip_label.value.string_value" =>
        "%{requestHeaders_id_array.wl-proxy-client-ip}"
      }
      on_error => "no_wl_proxy_client_ip"
    }

    if ![no_wl_proxy_client_ip] {
      mutate {
        replace => {
          "wl_proxy_client_ip_label.key" => "wl-proxy-client-ip"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" =>
          "wl_proxy_client_ip_label"
        }
        on_error => "wl_proxy_client_ip_label_empty"
      }
    }
  }

  if [msg][hashedUserAgent] != "" {
    mutate {
      replace => {
        "hashedUserAgent_label.value.string_value" => "%{msg.hashedUserAgent}"
      }
      on_error => "hashedUserAgent_empty"
    }
    if ![hashedUserAgent_empty] {
      mutate {
        replace => {
          "hashedUserAgent_label.key" => "hashedUserAgent"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "hashedUserAgent_label"
        }
        on_error => "hashedUserAgent_label_empty"
      }
    }
  }

  if [msg][responseHeaders] != "" {
    mutate {
      replace => {
        "responseHeaders_id" => "{\"responseHeaders_id_array\":%{msg.responseHeaders}}"
      }
      on_error => "id_empty"
    }
    json {
      source => "responseHeaders_id"
      array_function => "split_columns"
      on_error => "json_parse_failure"
    }

    for responseHeadersId in responseHeaders_id_array {
      mutate {
        replace => {
          "responseHeaders_label" => ""
        }
      }
      mutate {
        replace => {
          "key" => "%{responseHeadersId.key}"
        }
        on_error => "no_key"
      }
      mutate {
        replace => {
          "value" => "%{responseHeadersId.value}"
        }
        on_error => "no_value"
      }
      if ![no_key] and ![no_value] {
        mutate {
          replace => {
            "responseHeaders_label.value" => "%{value}"
            "responseHeaders_label.key" => "%{key}"
          }
          on_error => "no_value"
        }
        mutate {
          merge => {
            "target.resource.attribute.labels" => "responseHeaders_label"
          }
          on_error => "responseHeaders_label_empty"
        }
      }
    }
  }

  if [msg][transactionId] != "" {
    mutate {
      gsub => ["msg.transactionId", '\"', '']
    }
    mutate {
      replace => {
        "transactionId_label.value.string_value" => "%{msg.transactionId}"
      }
      on_error => "transactionId_empty"
    }
    if ![transactionId_empty] {
      mutate {
        replace => {
          "transactionId_label.key" => "transactionId"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "transactionId_label"
        }
        on_error => "transactionId_label_empty"
      }
    }
  }

  if [msg][hashedUsername] != "" {
    mutate {
      replace => {
        "hashedUsername_label.value.string_value" => "%{msg.hashedUsername}"
      }
      on_error => "hashedUsername_empty"
    }
    if ![hashedUsername_empty] {
      mutate {
        replace => {
          "hashedUsername_label.key" => "hashedUsername"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "hashedUsername_label"
        }
        on_error => "hashedUsername_label_empty"
      }
    }
  }

  if [msg][dcgShapeFailedOn] != "" {
    mutate {
      replace => {
        "dcgShapeFailedOn_label.value.string_value" => "%{msg.dcgShapeFailedOn}"
      }
      on_error => "dcgShapeFailedOn_empty"
    }
    if ![dcgShapeFailedOn_empty] {
      mutate {
        replace => {
          "dcgShapeFailedOn_label.key" => "dcgShapeFailedOn"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "dcgShapeFailedOn_label"
        }
        on_error => "dcgShapeFailedOn_label_empty"
      }
    }
  }

  if [ShapeShifterId] != "" {
    mutate {
      replace => {
        "ShapeShifterId_label.value.string_value" => "%{ShapeShifterId}"
      }
      on_error => "ShapeShifterId_empty"
    }
    if ![ShapeShifterId_empty] {
      mutate {
        replace => {
          "ShapeShifterId_label.key" => "ShapeShifterId"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "ShapeShifterId_label"
        }
        on_error => "ShapeShifterId_label_empty"
      }
    }
  }

  if [eventType] != "" {
    mutate {
      replace => {
        "eventType_label.value.string_value" => "%{eventType}"
      }
      on_error => "eventType_empty"
    }
    if ![eventType_empty] {
      mutate {
        replace => {
          "eventType_label.key" => "eventType"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "eventType_label"
        }
        on_error => "eventType_label_empty"
      }
    }
  }

  if [eventId] != "" {
    mutate {
      replace => {
        "eventId_label.value.string_value" => "%{eventId}"
      }
      on_error => "eventId_empty"
    }
    if ![eventId_empty] {
      mutate {
        replace => {
          "eventId_label.key" => "eventId"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "eventId_label"
        }
        on_error => "eventId_label_empty"
      }
    }
  }

  mutate {
    convert => {
      "latRequest" => "string"
    }
    on_error => "latRequest_convesion_failure"
  }
  if [latRequest] != "" {
    mutate {
      replace => {
        "latRequest_label.value.string_value" => "%{latRequest}"
      }
      on_error => "latRequest_empty"
    }
    if ![latRequest_empty] {
      mutate {
        replace => {
          "latRequest_label.key" => "latRequest"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "latRequest_label"
        }
        on_error => "latRequest_label_empty"
      }
    }
  }

  mutate {
    convert => {
      "latResponse" => "string"
    }
    on_error => "latResponse_convesion_failure"
  }
  if [latResponse] != "" {
    mutate {
      replace => {
        "latResponse_label.value.string_value" => "%{latResponse}"
      }
      on_error => "latResponse_empty"
    }
    if ![latResponse_empty] {
      mutate {
        replace => {
          "latResponse_label.key" => "latResponse"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "latResponse_label"
        }
        on_error => "latResponse_label_empty"
      }
    }
  }

  mutate {
    convert => {
      "latTotal" => "string"
    }
    on_error => "latTotal_convesion_failure"
  }
  if [latTotal] != "" {
    mutate {
      replace => {
        "latTotal_label.value.string_value" => "%{latTotal}"
      }
      on_error => "latTotal_empty"
    }
    if ![latTotal_empty] {
      mutate {
        replace => {
          "latTotal_label.key" => "latTotal"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "latTotal_label"
        }
        on_error => "latTotal_label_empty"
      }
    }
  }

  mutate {
    convert => {
      "latRspWait" => "string"
    }
    on_error => "latRspWait_convesion_failure"
  }
  if [latRspWait] != "" {
    mutate {
      replace => {
        "latRspWait_label.value.string_value" => "%{latRspWait}"
      }
      on_error => "latRspWait_empty"
    }
    if ![latRspWait_empty] {
      mutate {
        replace => {
          "latRspWait_label.key" => "latRspWait"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "latRspWait_label"
        }
        on_error => "latRspWait_label_empty"
      }
    }
  }

  mutate {
    convert => {
      "count" => "string"
    }
    on_error => "count_convesion_failure"
  }
  if [count] != "" {
    mutate {
      replace => {
        "count_label.value.string_value" => "%{count}"
      }
      on_error => "count_empty"
    }
    if ![count_empty] {
      mutate {
        replace => {
          "count_label.key" => "count"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "count_label"
        }
        on_error => "count_label_empty"
      }
    }
  }

  mutate {
    convert => {
      "latEccWait" => "string"
    }
    on_error => "latEccWait_convesion_failure"
  }
  if [latEccWait] != "" {
    mutate {
      replace => {
        "latEccWait_label.value.string_value" => "%{latEccWait}"
      }
      on_error => "latEccWait_empty"
    }
    if ![latEccWait_empty] {
      mutate {
        replace => {
          "latEccWait_label.key" => "latEccWait"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "latEccWait_label"
        }
        on_error => "latEccWait_label_empty"
      }
    }
  }

  if [severity] in [ "Error", "error", "warning" ] {
    mutate {
      replace => {
        "security_result.severity" => "HIGH"
      }
    }
  }
  else if [severity] =~ "(?i)critical" {
    mutate {
      replace => {
        "security_result.severity" => "CRITICAL"
      }
    }
  }
  else if [severity] =~ "(?i)notice" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
    }
  }
  else if [severity] in [ "information", "info", "INFO"] {
    mutate {
      replace => {
        "security_result.severity" => "LOW"
      }
    }
  }
  if [severity] != "" {
    mutate {
      replace => {
        "security_result.severity_details" => "%{severity}"
      }
      on_error => "severity_empty"
    }
  }

  if [msg][method] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{msg.method}"
      }
      on_error => "method_empty"
    }
  }

  if [msg][transactionResult] == "Success" {
    mutate {
      replace => {
        "sec_action" => "ALLOW"
      }
    }
  }
  else if [msg][transactionResult] == "Failure" {
    mutate {
      replace => {
        "sec_action" => "BLOCK"
      }
    }
  }

  if [msg][transactionResult] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{msg.transactionResult}"
      }
      on_error => "transaction_result_empty"
    }
  }

  if [sec_action] != "" {
    mutate {
      merge => {
        "security_result.action" => "sec_action"
      }
      on_error => "sec_action_empty"
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{description}"
      }
      on_error => "description_empty"
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "F5"
      "event.idm.read_only_udm.metadata.product_name" => "Shape"
      "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  else if [has_principal_machine] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
      on_error => "intermediary_empty"
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_empty"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
