# Product: Tanium Integrity Monitor
# Category: Tanium Specific
# Supported Format: JSON
# Reference: https://www.tanium.com/products/tanium-integrity-monitor/
# Last Updated: 2025-10-28
# Copyright 2025 Google SecOps


filter {
  mutate {
    replace => {
      "Computer_Name" => ""
      "ID" => ""
      "Process_Path" => ""
      "File_Path" => ""
      "Change_Type" => ""
      "User" => ""
      "Detail" => ""
      "Hash" => ""
      "Count" => ""
      "Hashed_At" => ""
      "security_result" => ""
      "has_principal" => ""
      "is_json_array" => "false"
      "is_hash_json" => "false"
      "is_id_json" => "false"
      "Watchlists" => ""
      "Event_Time" => ""
      "has_file" => ""
    }
  }

  mutate {
    gsub => [
      "message","Computer Name","Computer_Name"
    ]
  }
  mutate {
    gsub => [
      "message","Process Path","Process_Path"
    ]
  }
  mutate {
    gsub => [
      "message","File Path","File_Path"
    ]
  }

  mutate {
    gsub => [
      "message","Change Type","Change_Type"
    ]
  }
  mutate {
    gsub => [
      "message","Hashed At","Hashed_At"
    ]
  }
  mutate {
    gsub => ["message","\\r\\n",""]
  }
  mutate {
    gsub => ["message","\\n",""]
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [not_json] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [Computer_Name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{Computer_Name}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{Computer_Name}"
        "has_principal" => "true"
      }
      on_error => "principal_hostname_not_set"
    }
  }
  if [File_Path] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{File_Path}"
        "has_file" => "true"
      }
      on_error => "File_Path_not_set"
    }
  }
  if [Process_Path] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.file.full_path" => "%{Process_Path}"
      }
      on_error => "Process_Path_not_set"
    }
  }

  if [Hash] != "" {
    for indexhash in Hash {
      mutate {
        replace => {
          "hash_label" => ""
          "is_hash_json" => "true"
        }
      }

      mutate {
        replace => {
          "hash_label.key" => "Sha256"
          "hash_label.value" => "%{indexhash}"
        }
        on_error => "hash_label_error"
      }
      if ![hash_label_error] {
        mutate {
          merge => {
            "event.idm.read_only_udm.target.resource.attribute.labels" => "hash_label"
          }
          on_error => "hash_label_merge_error"
        }
      }
    }
    if [is_hash_json] == "false" and [Hash] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.file.sha256" => "%{Hash}"
        }
        on_error => "hash_not_set_error"
      }
    }
  }

  if [Change_Type] != "" {
    for change in Change_Type {
      mutate {
        replace => {
          "is_json_array" => "true"
        }
        merge => {
          "security_result.category_details" => "change"
        }
        on_error => "change_type_error"
      }
    }
    if [is_json_array] == "false" and [Change_Type] != "" {
      mutate {
        merge => {
          "security_result.category_details" => "Change_Type"
        }
        on_error => "change_type_not_set"
      }
    }
  }

  if [Count] != "" {
    mutate {
      replace => {
        "additional_count.key" => "Count"
        "additional_count.value.string_value" => "%{Count}"
      }
      on_error => "Count_not_set"
    }
    if ![Count_not_set] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_count"
        }
        on_error => "additional_count_not_set"
      }
    }
  }
  if [Hashed_At] != [Event_Time] and [Hashed_At] != "" {
    date {
      match => ["Hashed_At","yyyy-MM-dd HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "Hashed_At_not_set"
    }
    if [Hashed_At_not_set] {
      mutate {
        replace => {
          "additional_Hashed_At.key" => "Hashed_At"
          "additional_Hashed_At.value.string_value" => "%{Hashed_At}"
        }
        on_error => "additional_Hashed_At_not_set"
      }
      if ![additional_Hashed_At_not_set] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "additional_Hashed_At"
          }
          on_error => "additional_Hashed_At_merge_error"
        }
      }
    }
  }
  if [Event_Time] != "" {
    date {
      match => ["Event_Time","yyyy-MM-dd HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "Event_Time_not_set"
    }
    if [Event_Time_not_set] {
      mutate {
        replace => {
          "additional_event_time.key" => "Event_Time"
          "additional_event_time.value.string_value" => "%{Event_Time}"
        }
        on_error => "additional_Event_Time_not_set"
      }
      if ![additional_Event_Time_not_set] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "additional_event_time"
          }
          on_error => "additional_event_time_merge_error"
        }
      }
    }
  }
  if [Watchlists] != "" {
    mutate {
      replace => {
        "additional_watchlists.key" => "Watchlists"
        "additional_watchlists.value.string_value" => "%{Watchlists}"
      }
      on_error => "Watchlists_not_set"
    }
    if ![Watchlists_not_set] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_watchlists"
        }
        on_error => "additional_watchlists_not_set"
      }
    }
  }

  if [ID] != "" {
    for idindex in ID {
      mutate {
        replace => {
          "id_label" => ""
        }
      }
      mutate {
        replace => {
          "is_id_json" => "true"
          "id_label.key" => "ID"
          "id_label.value" => "%{idindex}"
        }
        merge => {
          "security_result.about.labels" => "id_label"
        }
      }
    }
    if [is_id_json] == "false" and [ID] != "" {
      mutate {
        replace => {
          "id_label.key" => "ID"
          "id_label.value" => "%{ID}"
        }
        merge => {
          "security_result.about.labels" => "id_label"
        }
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [has_principal] == "true" and [has_file] == "true" and [message] =~ "(?i)write" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "FILE_MODIFICATION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  } else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "Tanium Integrity Monitor"
      "event.idm.read_only_udm.metadata.product_name" => "Tanium Integrity Monitor"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
