# Product: Deep Instinct EDR
# Category: EDR
# Supported Format: LEEF
# Reference: NA
# Last Updated: 2023-12-27
# Copyright 2023 Chronicle LLC

filter {

  mutate {
    replace => {
      "srcMAC" => ""
      "eventType" => ""
      "usrName" => ""
      "LoggedInUsers" => ""
      "OSName" => ""
      "OSVersion" => ""
      "filePath" => ""
      "fileType" => ""
      "host" => ""
      "deviceGroup" => ""
      "identSrc" => ""
      "identHostName" => ""
      "act" => ""
      "eventExternalId" => ""
    }
  }

  grok {
    match => {
      "message" => "%{TIMESTAMP_ISO8601:ts} .*? LEEF:%{BASE10NUM:log_ver}\\|%{DATA:vendor_name}\\|%{DATA:app}\\|%{DATA}\\|%{DATA}\\|%{GREEDYDATA:kv_data}"
    }
    on_error => "grok_not_match"
  }

  if [grok_not_match] {
    drop {
      tag => "TAG_NO_SECURITY_VALUE"
    }
  }

  mutate {
    gsub => ["kv_data","\\t","#"]
  }

  kv {
    source => "kv_data"
    field_split => "#"
    value_split => "="
  }

  date {
    match => ["ts","ISO8601"]
  }

  # Metadata
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      "event.idm.read_only_udm.metadata.product_name" => "Deep Instinct EDR"
      "event.idm.read_only_udm.metadata.vendor_name" => "%{vendor_name}"
    }
  }

  if [eventType] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{eventType}"
      }
    }
  }

  if [eventExternalId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{eventExternalId}"
      }
    }
  }

  # Principal
  if [srcMAC] not in ["","00-00-00-00-00-00"] {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.mac" => "srcMAC"
      }
    }
  }

  if [host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{host}"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.principal.application" => "%{app}"
    }
  }

  if [usrName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.user_display_name" => "%{usrName}"
      }
    }
  }

  if [LoggedInUsers] != "" {
    mutate {
      gsub => ["LoggedInUsers","REGISGROUP(\\\\\)+",""]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{LoggedInUsers}"
      }
    }
  }

  if [OSName] != "" {
    mutate {
      uppercase => ["OSName"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.platform_software.platform" => "%{OSName}"
      }
    }
  }

  if [OSVersion] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.platform_software.platform_version" => "%{OSVersion}"
      }
    }
  }

  if [filePath] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.file.full_path" => "%{filePath}"
      }
    }
  }

  if [fileType] == "POWERSHELL_INTERACTIVE" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.file.file_type" => "FILE_TYPE_POWERSHELL"
      }
    }
  }

  if [deviceGroup] == "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.group.group_display_name" => "%{deviceGroup}"
      }
    }
  }

  # Target
  if [identSrc] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "identSrc"
      }
    }
  }

  if [identHostName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{identHostName}"
      }
    }
  }

  # SecurityResult
  if [act] != "" {
    mutate {
      replace => {
        "sr.action_details" => "%{act}"
      }
    }
  }

  if [sev] != "" {
    mutate {
      replace => {
        "sr.severity" => "MEDIUM"
        "sr.severity_details" => "%{sev}"
      }
    }
  }

  if [sr] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "sr"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
