# Product: Kea DHCP
# Category: DHCP
# Supported Format: SYSLOG
# Reference: https://kea.readthedocs.io/en/kea-1.6.2/arm/dhcp4-srv.html
# Last Updated: 2022-04-05
# Copyright 2022 Chronicle LLC


filter {
  mutate {
    replace => {
    "data1" => ""
    "src_port" => ""
    "dest_port" => ""
    "src_ip" => ""
    "desc" => ""
    "hwtype" => ""
    "mac" => ""
    "client_ip" => ""
    "domain_name" => ""
    "product_event" => ""
    "when" => ""
    "host" => ""
    "severity_level" => ""
    "security_result" => ""
    "src" => ""
    "udm_principal" => ""
    "network_dhcp" => ""
    }
  }
  grok {
    match => { "message" => [ "<%{INT}>%{GREEDYDATA:data1} kea-dhcp4: %{GREEDYDATA:severity_level} \\[%{GREEDYDATA}\\] %{GREEDYDATA:src}" ] }
    overwrite => ["data1","severity_level","src"]
    on_error => "format_error"
  }
  grok {
    match => {"data1" => ["%{SYSLOGTIMESTAMP:when} %{HOSTNAME:host}"]}
    overwrite => ["when","host"]
    on_error => "format_error"
  }
  grok {
    match => {"src" => ["%{DATA:product_event} %{DATA:desc} received from %{IP:src_ip} to %{IP:client_ip} over interface %{GREEDYDATA:interface}",
                        "%{DATA:product_event} %{DATA:desc} from %{IP:src_ip}:%{INT:src_port} to %{IP:client_ip}:%{INT:dest_port} over interface %{GREEDYDATA:interface}",
                        "%{DATA:product_event} client \\[hwtype=%{INT:hwtype} %{MAC:mac}], cid=\\[%{DATA:cid}\\], tid=%{DATA:tid} %{GREEDYDATA:desc}",
                        "%{DATA:product_event} \\[hwtype=%{INT:hwtype} %{MAC:mac}], cid=\\[%{DATA:cid}\\], tid=%{DATA:tid}\\: %{GREEDYDATA:desc}",
                        "%{DATA:product_event} \\[hwtype=%{INT:hwtype} %{MAC:mac}], cid=\\[%{DATA:cid}\\]\\: %{GREEDYDATA:desc}",
                        "%{DATA:product_event} %{DATA}%{IP:client_ip} %{DATA}\\[hwtype=%{INT:hwtype} %{MAC:mac}], cid=\\[%{DATA:cid}\\], tid=%{GREEDYDATA:tid}",
                        "%{DATA:product_event} %{GREEDYDATA:desc} \\[hwtype=%{INT:hwtype} %{MAC:mac}\\], cid=\\[%{DATA:cid}\\], tid=%{GREEDYDATA:tid}",
                        "%{DATA:product_event} %{GREEDYDATA:desc}"
                       ]
    }
    overwrite => ["product_event","desc","client_ip","src_port","src_ip","dest_port","interface", "hwtype", "mac"]
    on_error => "format_error"
  }
  if [format_error] {
    json {
      source => "message"
      on_error => "not_json"
      array_function => "split_columns"
    }
    if [not_json] {
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }
  }
  if [when] != "" {
    date {
      match => ["when", "MMM  dd HH:mm:ss", "MMM  d HH:mm:ss"]
      rebase => true
    }
  }
  if [host] != "" {
    mutate {
      replace => {
        "udm_principal.hostname" => "%{host}"
      }
    }
  }
  if [product_event] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{product_event}"
      }
    }
  }
  if [product_event] =~ ("DHCP4_CLIENT_FQDN_DATA|DHCP4_RESPONSE_FQDN_DATA") {
    grok {
      match => {"desc" => ["%{GREEDYDATA} type=%{INT:type} %{GREEDYDATA:b} flags: \\(%{GREEDYDATA:flag}\\), domain-name='%{HOSTNAME:domain_name}"]
      }
      overwrite => ["type","flag","domain_name"]
      on_error => "format_error"
    }
  }
  if [product_event] =~ "(DHCP4_INIT_REBOOT|DHCP4_LEASE_ADVERT|DHCP4_PACKET_NAK_0003|DHCP4_RELEASE|DHCP4_RESERVED_HOSTNAME_ASSIGNED|DHCPSRV_MYSQL_ADD_ADDR4|DHCPSRV_MYSQL_GET_ADDR4|DHCPSRV_MYSQL_DELETE_ADDR|DHCPSRV_MYSQL_UPDATE_ADDR4|ALLOC_ENGINE_V4_DISCOVER_HR|ALLOC_ENGINE_V4_LEASE_RECLAIM|ALLOC_ENGINE_V4_REQUEST_EXTEND_LEASE|ALLOC_ENGINE_V4_REQUEST_ALLOC_REQUESTED)"{
    grok {
      match => {"desc" => ["%{IP:client_ip}"]
      }
      overwrite => ["client_ip"]
      on_error => "format_error"
    }
  }
  if [product_event] in ["DHCP4_LEASE_ALLOC","ALLOC_ENGINE_V4_LEASES_RECLAMATION_COMPLETE"] {
    grok {
      match => {"desc" => ["%{IP:ip} %{DATA} %{INT:lease_time} "
                           "%{DATA} in %{INT:lease_time}."
                          ]
      }
      on_error => "format_error"
    }
    mutate {
      replace => {
        "network_dhcp.lease_time_seconds" => "%{lease_time}"
      }
      convert => {
        "network_dhcp.lease_time_seconds" => "uinteger"
      }
    }
  }
  if [product_event] == "DHCP4_PACKET_SEND" {
    grok {
      match => {"desc" => ["%{GREEDYDATA}type %{INT:ack_type}\\) from %{IP:src_ip}:%{INT:src_port} to %{IP:client_ip}:%{INT:dest_port} on interface %{GREEDYDATA:interface}"]
      }
      overwrite => ["ack_type","src_ip","src_port","client_ip","dest_port"]
      on_error => "format_error"
    }
  }
  if [product_event] == "DHCP4_PACKET_RECEIVED" {
    grok {
      match => {"desc" => ["%{GREEDYDATA}type %{INT:ack_type}\\) received from %{IP:src_ip} to %{IP:client_ip} on interface %{GREEDYDATA:interface}"]
      }
      overwrite => ["ack_type","src_ip","client_ip"]
      on_error => "format_error"
    }
  }
  if [product_event] == "DHCP4_HOOK_BUFFER_RCVD_SKIP" {
    grok {
      match => {"desc" => ["received buffer from %{IP:src_ip} to %{IP:client_ip} over interface %{GREEDYDATA:desc}"]
      }
      overwrite => ["src_ip","client_ip", "desc"]
      on_error => "format_error_dhcp"
    }
  }
  if [product_event] =~ "(DHCP4_QUERY_DATA|DHCP4_RESPONSE_DATA)" {
    grok {
      match => {"desc" => ["local_address=%{IP:src_ip}:%{INT:src_port}, remote_address=%{IP:client_ip}:%{INT:dest_port}, msg_type=%{DATA:type}, transid=%{GREEDYDATA:tid},"]
      }
      overwrite => ["src_ip","src_port","client_ip","dest_port","tid"]
      on_error => "format_error_dhcp_query"
    }
  }
  if [product_event] == "DHCP4_RESPONSE_HOSTNAME_DATA" {
    grok {
      match => {"desc" => [": %{HOSTNAME:domain_name}"]
      }
      overwrite => ["domain_name"]
      on_error => "format_error"
    }
  }
  if [product_event] =~ "(DHCP4_RESPONSE_HOSTNAME_GENERATE)" {
    grok {
      match => {"desc" => ["hostname %{HOSTNAME:domain_name} "]
      }
      overwrite => ["domain_name"]
      on_error => "format_error"
    }
  }
  if [product_event] =~ "(DHCP4_SUBNET_DATA)" {
    grok {
      match => {"desc" => ["%{IP:client_ip}\\/%{INT:dest_port}"]
      }
      overwrite => ["client_ip","dest_port"]
      on_error => "format_error"
    }
  }
  if [product_event] in ["HOSTS_CFG_GET_ONE_SUBNET_ID_IDENTIFIER","HOSTS_CFG_GET_ALL_IDENTIFIER","HOSTS_CFG_GET_ALL_IDENTIFIER_COUNT","HOSTS_CFG_GET_ONE_SUBNET_ID_IDENTIFIER_HOST","HOSTS_CFG_GET_ALL_IDENTIFIER_HOST","HOSTS_CFG_GET_ONE_SUBNET_ID_IDENTIFIER_NULL"] {
    grok {
      match => {"desc" => ["hwaddr=%{GREEDYDATA:mac}\, %{GREEDYDATA} hostname=%{IP:src_ip}",
                           "hwaddr=%{GREEDYDATA:mac}, %{GREEDYDATA}",
                           "hwaddr=%{GREEDYDATA:mac}"]
      }
      overwrite => ["mac","src_ip"]
      on_error => "format_error"
    }
    mutate {
      gsub => ["mac", "(\\S\\S)(\\S\\S)(\\S\\S)(\\S\\S)(\\S\\S)(\\S\\S)", "$1:$2:$3:$4:$5:$6"]
      lowercase => ["mac"]
    }
  }
  if [product_event] == "DHCPSRV_CFGMGR_SUBNET4_ADDR" {
    grok {
      match => {"desc" => ["%{IP:client_ip}\\/%{INT:dest_port} %{GREEDYDATA} address %{IP:src_ip}"]
      }
      overwrite => ["client_ip","dest_port","src_ip"]
      on_error => "format_error"
    }
  }
  if [product_event] == "DHCPSRV_MYSQL_GET_CLIENTID" {
    grok {
      match => {"desc" => ["client ID %{INT}:%{GREEDYDATA:mac}"]
      }
      overwrite => ["mac"]
      on_error => "format_error"
    }
  }
  if [product_event] == "DHCPSRV_MYSQL_GET_HWADDR" {
    grok {
      match => {"desc" => ["hwtype=%{INT:hwtype} %{MAC:mac}"]
      }
      overwrite => ["hwtype","mac"]
      on_error => "format_error"
    }
  }
  if [src_port] != "" {
    mutate {
      replace => {
        "udm_principal.port" => "%{src_port}"
      }
      convert => {
        "udm_principal.port" => "integer"
      }
    }
  }
  if [dest_port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.port" => "%{dest_port}"
      }
      convert => {
        "event.idm.read_only_udm.target.port" => "integer"
      }
    }
  }
  if [src_ip] != "" {
    mutate {
      replace => {
        "network_dhcp.yiaddr" => "%{src_ip}"
      }
    }
  }
  if [client_ip] != "" {
    mutate {
      replace => {
        "network_dhcp.ciaddr" => "%{client_ip}"
      }
    }
  }
  if [mac] != "" {
    mutate {
      replace => {
        "network_dhcp.chaddr" => "%{mac}"
      }
    }
  }
  if [domain_name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{domain_name}"
      }
    }
  }
  if [severity_level] in ["INFO","DEBUG"] {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  }
  if [desc] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{desc}"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  # INFORM seems relevant dhcp type because these events have no other required DHCP mappings.
  if [product_event] =~ "(DHCP|ALLOC|HOOKS|HA|COMMAND|HTTP|HOSTS)" {
    mutate {
      replace => {
        "network_dhcp.type" => "INFORM"
        "network_dhcp.opcode" => "BOOTREQUEST"
      }
    }
  }
  else if [desc] =~ "DISCOVER" {
    mutate {
      replace => {
        "network_dhcp.type" => "DISCOVER"
        "network_dhcp.opcode" => "BOOTREQUEST"
        "network_dhcp.chaddr" => "%{mac}"
      }
    }
    mutate {
      merge => {
        "udm_principal.mac" => "mac"
      }
    }
  }
  else if [product_event] =~ "RELEASE" {
    mutate {
      replace => {
        "network_dhcp.type" => "RELEASE"
        "network_dhcp.opcode" => "BOOTREQUEST"
         "network_dhcp.ciaddr" => "%{client_ip}"
      }
    }
    mutate {
      merge => {
        "udm_principal.ip" => "client_ip"
        "event.idm.read_only_udm.observer.ip" => "client_ip"
      }
    }
  }
  else if [desc] =~ "DHCPOFFER" {
    mutate {
      replace => {
        "network_dhcp.type" => "OFFER"
        "network_dhcp.opcode" => "BOOTREPLY"
      }
    }
  }
  else if [desc] =~ "REQUEST" {
    mutate {
      replace => {
        "network_dhcp.type" => "REQUEST"
         "network_dhcp.opcode" => "BOOTREQUEST"
      }
    }
  }
  else if [desc] =~ "DECLINE" {
    mutate {
      replace => {
        "network_dhcp.type" => "DECLINE"
        "network_dhcp.opcode" => "BOOTREQUEST"
        "network_dhcp.requested_address" => "%{src_ip}"
      }
    }
  }
  else if [desc] =~ "ACK" {
    mutate {
      replace => {
        "network_dhcp.type" => "ACK"
        "network_dhcp.opcode" => "BOOTREPLY"
      }
    }
  }
  else if [desc] =~ "NCK" {
    mutate {
      replace => {
        "network_dhcp.type" => "NCK"
        "network_dhcp.opcode" => "BOOTREPLY"
      }
    }
  }
  else if [desc] =~ "DELETED" {
    mutate {
      replace => {
        "network_dhcp.type" => "WIN_DELETED"
      }
    }
  }
  else if [desc] =~ "EXPIRED" {
    mutate {
      replace => {
        "network_dhcp.type" => "WIN_EXPIRED"
      }
    }
  }
  else {
    mutate {
      replace => {
        "network_dhcp.type" => "UNKNOWN_MESSAGE_TYPE"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "KEA"
      "event.idm.read_only_udm.metadata.product_name" => "KEA_DHCP"

    }
  }
  if [network_dhcp] != "" and [udm_principal] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "DHCP"
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DHCP"
      }
    }
  }
  else if [domain_name] != "" or [client_ip] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
      }
    }
  }
  else if [network_dhcp][type] == "UNKNOWN_MESSAGE_TYPE" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [udm_principal] != "" {
    mutate {
      rename => {
        "udm_principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [network_dhcp] != "" {
    mutate {
      rename => {
        "network_dhcp" => "event.idm.read_only_udm.network.dhcp"
      }
    }
  }
  if [format_error] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  mutate {
     merge => { "@output" => "event" }
  }
}
