# Product: ALVEO_RDM
# Category: SaaS Applications
# Supported Format: JSON
# Reference: N/A
# Last Updated:2025-03-06
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "security_result" => ""
      "has_user" => "false"
      "has_principal" => "false"
      "has_target" => "false"
      "column11" => ""
      "host_name" => ""
      "function" => ""
      "process_id" => ""
      "log_level" => ""
      "msg" => ""
      "user_id" => ""
      "src_ip" => ""
      "country" => ""
      "register_type" => ""
      "status_process" => ""
      "date" => ""
      "hours" => ""
      "operation_type" => ""
      "interface_datafile" => ""
      "interface_attribute" => ""
      "old_value" => ""
      "new_value" => ""
      "modified_user" => ""
      "affected_user" => ""
      "object_type" => ""
      "object" => ""
      "date_hours" => ""
    }
  }
  mutate {
    gsub => ["message","\\\r\\\n",""]
  }
  mutate {
    gsub => ["message",'\\\"',""]
  }
  mutate {
    gsub => ["message",";",","]
  }
  csv {
    source => "message"
    seperator => ","
    on_error => "csv_failed"
  }
  grok {
    match => {
      "column8" => "%{IP:src_ip}"
    }
    overwrite => ["src_ip"]
    on_error => "column8_grok_failed"
  }
  if ![column8_grok_failed] {
    mutate {
      replace => {
        "date" => "%{column1}"
        "host_name" => "%{column2}"
        "function" => "%{column3}"
        "process_id" => "%{column4}"
        "log_level" => "%{column5}"
        "msg" => "%{column6}"
        "user_id" => "%{column7}"
        "src_ip" => "%{column8}"
      }
    }
  }
  else if [column11]!= "" {
    mutate {
      replace => {
        "country" => "%{column1}"
        "user_id" => "%{column2}"
        "register_type" => "%{column3}"
        "status_process" => "%{column4}"
        "date" => "%{column5}"
        "hours" => "%{column6}"
        "operation_type" => "%{column7}"
        "interface_datafile" => "%{column8}"
        "interface_attribute" => "%{column9}"
        "old_value" => "%{column10}"
        "new_value" => "%{column11}"
      }
    }
  }
  else {
    mutate {
      replace => {
        "date" => "%{column1}"
        "hours" => "%{column2}"
        "modified_user" => "%{column3}"
        "affected_user" => "%{column4}"
        "object_type" => "%{column5}"
        "object" => "%{column6}"
        "operation_type" => "%{column7}"
      }
    }
  }
  if [host_name] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host_name}"
        "principal.asset.hostname" => "%{host_name}"
        "has_principal" => "true"
      }
      on_error => "no_host_name"
    }
  }
  if [function] != "" {
    mutate {
      replace => {
        "function_label.key" => "function"
        "function_label.value.string_value" => "%{function}"
      }
      on_error => "no_function"
    }
    if ![no_function] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "function_label"
        }
        on_error => "no_function_label"
      }
    }
  }
  if [old_value] != "" {
    grok {
      match => {
        "old_value" => "%{GREEDYDATA} %{INT:process_id}"
      }
      overwrite => ["process_id"]
      on_error => "old_value_grok_failed"
    }
    mutate {
      replace => {
        "old_value_label.key" => "old_value"
        "old_value_label.value.string_value" => "%{old_value}"
      }
      on_error => "no_old_value"
    }
    if ![no_old_value] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "old_value_label"
        }
        on_error => "no_old_value_label"
      }
    }
  }
  if [process_id] != "" {
    mutate {
      replace => {
        "target.process.pid" => "%{process_id}"
      }
      on_error => "no_process_id"
    }
  }
  if [log_level] != "" {
    mutate {
      replace => {
        "log_level_label.key" => "log_level"
        "log_level_label.value.string_value" => "%{log_level}"
      }
      on_error => "no_log_level"
    }
    if ![no_log_level] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "log_level_label"
        }
        on_error => "no_log_level_label"
      }
    }
  }
  if [msg] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{msg}"
      }
      on_error => "no_msg"
    }
  }
  if [user_id] =~ "^(.){1,253}$" {
    mutate {
      replace => {
        "target.user.userid" => "%{user_id}"
        "has_user" => "true"
      }
      on_error => "no_user_id"
    }
  }
  if [src_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "src_ip"
        "principal.asset.ip" => "src_ip"
      }
      on_error => "no_src_ip"
    }
    if ![no_src_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [country] != "" {
    mutate {
      replace => {
        "principal.location.country_or_region" => "%{country}"
      }
      on_error => "no_country"
    }
  }
  if [register_type] != "" {
    mutate {
      replace => {
        "register_type_label.key" => "register_type"
        "register_type_label.value.string_value" => "%{register_type}"
      }
      on_error => "no_register_type"
    }
    if ![no_register_type] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "register_type_label"
        }
        on_error => "no_register_type_label"
      }
    }
  }
  if [status_process] != "" {
    mutate {
      replace => {
        "status_process_label.key" => "status_process"
        "status_process_label.value.string_value" => "%{status_process}"
      }
      on_error => "no_status_process"
    }
    if ![no_status_process] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "status_process_label"
        }
        on_error => "no_status_process_label"
      }
    }
  }
  if [operation_type] != "" {
    mutate {
      replace => {
        "operation_type_label.key" => "operation_type"
        "operation_type_label.value.string_value" => "%{operation_type}"
      }
      on_error => "no_operation_type"
    }
    if ![no_operation_type] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "operation_type_label"
        }
        on_error => "no_operation_type_label"
      }
    }
  }
  if [interface_datafile] != "" {
    mutate {
      replace => {
        "interface_datafile_label.key" => "interface_datafile"
        "interface_datafile_label.value.string_value" => "%{interface_datafile}"
      }
      on_error => "no_interface_datafile"
    }
    if ![no_interface_datafile] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "interface_datafile_label"
        }
        on_error => "no_interface_datafile_label"
      }
    }
  }
  if [interface_attribute] != "" {
    mutate {
      replace => {
        "interface_attribute_label.key" => "interface_attribute"
        "interface_attribute_label.value.string_value" => "%{interface_attribute}"
      }
      on_error => "no_interface_attribute"
    }
    if ![no_interface_attribute] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "interface_attribute_label"
        }
        on_error => "no_interface_attribute_label"
      }
    }
  }
  if [new_value] != "" {
    mutate {
      replace => {
        "new_value_label.key" => "new_value"
        "new_value_label.value.string_value" => "%{new_value}"
      }
      on_error => "no_new_value"
    }
    if ![no_new_value] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "new_value_label"
        }
        on_error => "no_new_value_label"
      }
    }
  }
  if [modified_user] =~ "^(.){1,253}$" {
    mutate {
      replace => {
        "principal.user.userid" => "%{modified_user}"
        "has_user" => "true"
      }
      on_error => "no_modified_user"
    }
  }
  if [affected_user] =~ "^(.){1,253}$" {
    mutate {
      replace => {
        "target.user.userid" => "%{affected_user}"
        "has_user" => "true"
      }
      on_error => "no_affected_user"
    }
  }
  if [object_type] != "" {
    mutate {
      replace => {
        "principal.user.role_name" => "%{object_type}"
        "has_user" => "true"
      }
      on_error => "no_object_type"
    }
  }
  if [object] != "" {
    mutate {
      replace => {
        "object_label.key" => "object"
        "object_label.value.string_value" => "%{object}"
      }
      on_error => "no_object"
    }
    if ![no_object] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "object_label"
        }
        on_error => "no_object_label"
      }
    }
  }
  mutate {
    replace => {
      "date_hours" => "%{date} %{hours}"
    }
    on_error => "no_date_hours"
  }
  if [date_hours] != "" {
    date {
      match => ["date_hours","yyyyMMdd HHmmss"]
      target => "metadata.event_timestamp"
      on_error => "invalid_format"
    }
  }
  if [date] != "" {
    date {
      match => ["date", "MMM dd yyyy HH:mm:ss", "MMM d yyyy HH:mm:ss"]
      target => "metadata.event_timestamp"
      on_error => "invalid_format"
    }
  }
  if [msg] =~ "failed" {
    mutate {
      replace => {
        "act" => "BLOCK"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "act"
      }
      on_error => "no_act"
    }
  }
  if [msg] =~ "logon" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type" => "MACHINE"
      }
      on_error => "no_desc"
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "ALVEO RDM"
      "metadata.vendor_name" => "ALVEO RDM"
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

