# Product: OKTA_ACCESS_GATEWAY
# Category: OKTA specific
# Supported Format: SYSLOG + KV
# Reference: https://help.okta.com/oag/en-us/Content/Topics/Access-Gateway/about-logging.htm
# Last Updated: 2023-02-20
# Copyright 2023 Chronicle LLC


filter {
  mutate {
    replace => {
      "msg" => ""
      "provider" => ""
      "security_res" => ""
      "desc" => ""
      "source_ip" => ""
      "resp_code" => ""
      "user_name" => ""
      "http_protocol" => ""
      "port" => ""
      "full_url" => ""
      "type" => ""
      "pid" => ""
      "user" => ""
      "agent" => ""
      "remote_ip" => ""
      "dest_ip" => ""
      "date_time" => ""
     }
   }

  grok {
    match => {
      "message" => ["%{GREEDYDATA:msg}"]
     }
      overwrite => ["msg"]
   }

  if [msg] !=""{
    grok {
      match => {
        "msg" => ["%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name} ACCESS_GATEWAY WEB_CONSOLE %{GREEDYDATA:desc} %{INT:pid} %{GREEDYDATA:full_path} started by %{GREEDYDATA:user} %{DATA} %{GREEDYDATA:path}","%{GREEDYDATA:date_time} %{HOSTNAME:user_name} ACCESS_GATEWAY WEB_CONSOLE %{GREEDYDATA:desc}",
                "%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name} %{WORD:provider} %{WORD:data_type} %{WORD:metrics_type} %{WORD:leve} %{WORD:level} %{WORD:type} \\[%{GREEDYDATA:kv_msg}]%{GREEDYDATA:desc}","%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name} %{WORD:provider} %{WORD:data_type} %{WORD:metrics_type} %{WORD:level} %{GREEDYDATA:type} \\[%{GREEDYDATA:kv_msg}]%{GREEDYDATA:desc}",
                "%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name}  %{GREEDYDATA:desc}",
               "%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name} su %{GREEDYDATA:desc} user %{GREEDYDATA:user}","%{GREEDYDATA:date_time} %{GREEDYDATA:user_name} su %{GREEDYDATA:desc}",
                "%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name} \\t%{GREEDYDATA:desc}",
                "%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name} %{DATA:name} %{IP:ip}(:%{INT:port})? %{GREEDYDATA:hosname} \\\"%{WORD:http_protocol} %{GREEDYDATA:url} HTTP\/1.[0-9]\\\" %{INT:resp_code} %{GREEDYDATA:desc}","%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name} %{DATA:name} %{GREEDYDATA:ip} %{IP:dest_ip} %{GREEDYDATA:hosname} \\\"%{WORD:http_protocol} %{GREEDYDATA:url} HTTP\/1.[0-9]\\\" %{INT:resp_code} %{GREEDYDATA:desc}",
                "%{TIMESTAMP_ISO8601:date_time} %{HOSTNAME:user_name} %{DATA:unique_name} %{GREEDYDATA:name} %{IP:ip} %{DATA} \\\"%{WORD:http_protocol} %{GREEDYDATA:desc} HTTP\/2.[0-9]\\\" %{INT:resp_code} %{INT} \\\"%{GREEDYDATA:full_url} \\\"%{GREEDYDATA:agent} \\\"%{GREEDYDATA}\\\"%{GREEDYDATA}","%{GREEDYDATA:date_time} %{HOSTNAME:user_name} %{DATA:unique_name} %{GREEDYDATA:name} %{IP:ip} %{GREEDYDATA:hosname} \\\"%{WORD:http_protocol} %{GREEDYDATA:desc}",
                "%{GREEDYDATA:desc}"]
       }
        overwrite => ["date_time","user_name","kv_msg","desc","provider","metrics_type","level","data_types","types","source_ip","resp_code","type", "http_protocol","port", "full_url", "pid","user", "agent", "dest_ip"]
    }
  }

  if [provider] == "OAG_MONITOR" or [provider] =="ACCESS_GATEWAY" {
    if [kv_msg] != "" {
      mutate {
        gsub => ["kv_msg", "\\\"", ""]
      }
      mutate {
        gsub => ["kv_msg", "(\\w+)=", "#$1="]
      }
    }
    kv {
      source => "kv_msg"
      field_split => "#"
      value_split => "="
    }
  if [metrics_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.application" => "%{metrics_type}"
      }
    }
  }
  if [type] == "SESSION_CACHE_USAGE" {
    mutate {
      replace => {
        "additional_cache_size.key" => "CACHE_SIZE"
        "additional_cache_size.value.string_value" => "%{CACHE_SIZE}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_cache_size"
      }
    }
    if [CURRENT_USAGE] != ""{
      mutate {
        replace => {
         "additional_cache.key" => "CURRENT_USAGE"
         "additional_cache.value.string_value" => "%{CURRENT_USAGE}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_cache"
        }
      }
    }
    if [USAGE_PERCENT] != ""{
      mutate {
        replace => {
          "additional_cache_pct.key" => "USAGE_PERCENT"
          "additional_cache_pct.value.string_value" => "%{USAGE_PERCENT}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_cache_pct"
        }
      }
    }
  }

  if [type] == "DISK_USAGE" {
    mutate {
      replace => {
        "additional_disk_size.key" => "FILESYSTEM"
        "additional_disk_size.value.string_value" => "%{FILESYSTEM}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_disk_size"
      }
    }
    if [MOUNT] != ""{
      mutate {
        replace => {
          "additional_mount.key" => "MOUNT"
          "additional_mount.value.string_value" => "%{MOUNT}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_mount"
        }
      }
    }
    if [USAGE] != ""{
      mutate {
        replace => {
          "additional_use_pct.key" => "USAGE"
          "additional_use_pct.value.string_value" => "%{USAGE}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_use_pct"
        }
      }
    }
  }

  if [type] == "MONITOR" or [type] == "CONFIG_TEST" or [type] == "VALIDATE" {
      mutate {
      replace => {
        "additional_status.key" => "STATUS"
        "additional_status.value.string_value" => "%{STATUS}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_status"
      }
    }
  }
  if [type] == "VALIDATE" {
      mutate {
      replace => {
        "additional_name.key" => "NAME"
        "additional_name.value.string_value" => "%{NAME}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_name"
      }
    }
  }

  if [type] == "START" and [SERVICE] != "" {
    mutate {
      replace => {
        "additional_name.key" => "SERVICE"
        "additional_name.value.string_value" => "%{SERVICE}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_name"
      }
    }
  }

  if [type] == "USER_SESSION" and [SESSION_ID] != "" {

      mutate {
          replace => {
            "event.idm.read_only_udm.network.session_id" => "%{SESSION_ID}"
            "event.idm.read_only_udm.network.http.user_agent" => "%{USER_AGENT}"
          }
        }
        if [REMOTE_IP] != "" {
          mutate {
            merge => {
              "event.idm.read_only_udm.target.ip" => "REMOTE_IP"
           }
         }
       }
   if [APP_TYPE] != "" {
     mutate {
       replace => {
         "additional_app_name.key" => "APP_TYPE"
         "additional_app_name.value.string_value" => "%{APP_TYPE}"
       }
     }
     mutate {
       merge => {
         "event.idm.read_only_udm.additional.fields" => "additional_app_name"
       }
     }
    }
  }

  if [level] == "INFO" or [level] == "Informational" or [level] == "DEBUG"{
    mutate {
      replace => {
        "security_res.severity" => "INFORMATIONAL"
      }
    }
  } else if [level] == "ERROR" {
    mutate {
      replace => {
        "security_res.severity" => "ERROR"
      }
    }
  } else if [level] == "WARNING" {
    mutate {
      replace => {
        "security_res.severity" => "LOW"
      }
    }
  }
  if [security_res] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_res"
       }
     }
   }
 }

  if [http_protocol]  in ["GET","POST"] {
    if [resp_code] != "" {
      mutate {
        convert => {
          "resp_code" => "integer"
        }
     }
    mutate {
      rename => {
        "resp_code" => "event.idm.read_only_udm.network.http.response_code"
        }
      }
    }
    if [port] != "" {
      mutate {
        convert => {
          "port" => "integer"
        }
     }
    mutate {
      rename => {
        "port" => "event.idm.read_only_udm.target.port"
       }
     }
   }
    if [http_protocol] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.http.method" => "%{http_protocol}"
        }
      }
    }
    if [http_protocol] == "POST" and [http_protocol] != "" {
      mutate {
        gsub => [ "full_url", "\"", "" ]
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.target.url" => "%{full_url}"
        }
      }
    }
    if [agent] != "" {
      mutate {
        gsub => [ "agent", "\"", "" ]
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.network.http.user_agent" => "%{agent}"
        }
      }
    }
    if [ip] != "" {
      mutate {
        merge => {
            "event.idm.read_only_udm.target.ip" => "ip"
         }
       }
     }
    if [dest_ip] != "" {
      mutate {
        merge => {
            "event.idm.read_only_udm.principal.ip" => "dest_ip"
         }
       }
     }
   }

  if [user_name] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{user_name}"
        }
      }
    }

  if [type] == "VALIDATE" and [desc] != "" {
     mutate {
       replace => {
         "event.idm.read_only_udm.metadata.description" => "%{kv_msg}"
       }
     }
   }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{desc}"
      }
    }
  }
  if [pid]!="" {
     mutate {
        gsub => [ "full_path", "\\(", "" ]
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.target.process.pid" => "%{pid}"
          "event.idm.read_only_udm.target.process.file.full_path" => "%{full_path}"
          "event.idm.read_only_udm.target.user.userid" = "%{user}"
        }
      }
    }

  if [user]!="" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" = "%{user}"
      }
    }
  }

  if [http_protocol]  in ["GET","POST"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "OKTA_ACCESS_GATEWAY"
      "event.idm.read_only_udm.metadata.vendor_name" => "CLF"
    }
  }
  if [date_time] != "" {
    date {
      match => ["date_time", "RFC3339", "TIMESTAMP_ISO8601"]
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
