# Product: SOTI_MOBICONTROL
# Category: Mobile Device Management
# Supported Format: SYSLOG
# Reference: See below
# Last Updated: 2023-09-08
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "additional" => ""
      "device_id" => ""
      "description" => ""
      "hostname" => ""
      "intermediary" => ""
      "severity" => ""
      "principal" => ""
      "principalFile" => ""
      "security_result" => ""
      "server" => ""
      "source" => ""
      "timestamp" => ""
      "category" => ""
      "user_name" => ""
      "metadata.event_type" => ""
      "target_url" => ""
      "target" => ""
      "extensions" => ""
      "user_display_name" => ""
      "user_id" => ""
    }
  }
  mutate {
    gsub => ["message","\\n|\\r",""]
  }

  grok {
    match => {
      "message" => "%{TIMESTAMP_ISO8601:timestamp} %{HOSTNAME:hostname} %{WORD} (%{INT}|%{WORD}) %{INT} - .\\[%{WORD:source}, %{WORD:severity}, %{WORD:category}\\] %{GREEDYDATA:description} \\(Server/DeviceID/UserName:%{HOSTNAME:server}/%{GREEDYDATA:device_id}/%{GREEDYDATA:user_name}\\)"
    }
    overwrite => ["hostname","severity","device_id","description","server","source","category","timestamp","user_name"]
    on_error => "pattern_not_matched"
  }

  if [pattern_not_matched] {
    drop {
      tag => "TAG_UNSUPPORTED"
    }
  }

  if [timestamp] != "" {
    mutate {
      gsub => ["timestamp","\\+.*","Z"]
    }
    date {
      match => ["timestamp","ISO8601","yyyy-MM-ddTHH:mm:ss.SSSSSSZ"]
      target => "metadata.event_timestamp"
      on_error => "timestamp_not_matched"
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{hostname}"
      }
    }
  }

  if [source] != "" {
    mutate {
      replace => {
        "sourceLabel.key" => "Source"
        "sourceLabel.value.string_value" => "%{source}"
      }
      merge => {
        "additional.fields" => "sourceLabel"
      }
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{description}"
      }
    }
  }

  if [server] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{server}"
      }
    }
  }

  if [category] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{category}"
      }
    }
  }

  if [device_id] != "" {
    mutate {
      replace => {
        "principal.resource.product_object_id" => "%{device_id}"
      }
    }
  }

  if [user_name] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{user_name}"
      }
    }
  }

  if [severity] != "" {
    mutate {
      uppercase => ["severity"]
    }
    if [severity] == "INFORMATION" {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    } else if [severity] == "WARNING" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    } else if [severity] in ["ERROR","CRITICAL"]{
      mutate {
        replace => {
          "security_result.severity" => "%{severity}"
        }
      }
    } else {
      mutate {
        replace => {
          "security_result.severity_details" => "%{severity}"
        }
      }
    }
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
      on_error => "invalid_intermediary"
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
      on_error => "invalid_additional"
    }
  }

  if [description] != "" {
    if [category] == "LogOff" {
      grok {
        match => {
          "description" => "%{GREEDYDATA} %{URI:target_url}\\)"
        }
        on_error => "pattern_not_matched"
        overwrite => ["target_url"]
      }
    }

    if [category] in ["AppleAppLicenseAccountRetrievedUsersEvent","AppleAppLicenseAccountUserAssignedEvent"] {
      grok {
        match => {
          "description" => ".*(user|Apple ID) '%{GREEDYDATA:user_id}'.*(a|A)ccount '%{GREEDYDATA:user_display_name}'.*"
        }
        overwrite => ["user_display_name","user_id"]
      }
    }

    if [user_id] != "" {
      mutate {
        replace => {
          "principal.user.userid" => "%{user_id}"
        }
      }
    }

    if [user_display_name] != "" and [user_name] == "" {
      mutate {
        replace => {
          "principal.user.user_display_name" => "%{user_display_name}"
        }
      }
    }

    if [target_url] != "" {
      mutate {
        replace => {
          "target.url" => "%{target_url}"
          "metadata.event_type" => "USER_LOGOUT"
        }
      }
    }
    mutate {
      replace => {
        "security_result.description" => "%{description}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "invalid_security_result"
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
      on_error => "invalid_target"
    }
  }

  if [principal] != "" and [metadata][event_type] == "" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  } else if [metadata][event_type] == "" {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
      on_error => "invalid_principal"
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "SOTI_MOBICONTROL"
      "metadata.product_name" => "SOTI_MOBICONTROL"
    }
  }

  if [metadata][event_type] == "USER_LOGOUT" {
    mutate {
      replace => {
        "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }

  mutate {
    rename => {
      "metadata" => "event.idm.read_only_udm.metadata"
    }
    on_error => "invalid_metadata"
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
