# Product: NEO4J
# Category: Database management system
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2023-12-07
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "event_type" => ""
      "properties.host_group" => ""
      "properties.cluster_node" => ""
      "properties.source" => ""
      "recordDate" => ""
      "namespace" => ""
      "timestamp_msg" => ""
      "levelx" => ""
      "msg" => ""
      "user_id" => ""
      "msg_db" => ""
      "database" => ""
      "msg_drop" => ""
      "action" => ""
      "user_dest" => ""
      "user_pass" => ""
      "role" => ""
      "msg_x" => ""
    }
  }

  json {
    source => "message"
    on_error => "not_json"
    array_function => "split_columns"
  }

  if [not_json] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [properties][cluster_node] !=  "" {
    mutate {
      replace => {
        "target.hostname" => "%{properties.cluster_node}"
      }
      on_error => "cluster_node_failed"
    }
  }

  if [properties][host_group] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{properties.host_group}"
      }
      on_error => "host_group_failed"
    }
  }

  if [properties][source] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.src.resource.name" => "%{properties.source}"
      }
      on_error => "source_failed"
    }
  }

  if [recordDate] != "" {
    mutate {
      convert => {
        "recordDate" => "string"
      }
      on_error => "convert_failure"
    }

    mutate {
      gsub => [ "recordDate", ".{6}$", ""]
    }

    date {
      match => ["recordDate", "ISO8601", "UNIX_MS", "UNIX"]
      target => "principal.asset.creation_time"
      on_error => "format_error"
    }
  }

  mutate {
    replace => {
      "id1.value" => "%{mrId}"
      "id1.key" => "mr_id"
    }
    on_error => "no_data_mrid"
  }

  if ![no_data_mrid] {
    mutate {
      merge => {
        "i.labels" => "id1"
      }
      on_error => "_"
    }
  }

  mutate {
    replace => {
      "principal.domain.tech.product_object_id" => "%{namespace}"
    }
    on_error => "no_tech"
  }

  grok {
    match => {
      "message"  => [
        "%{TIMESTAMP_ISO8601:timestamp_msg}\\s+%{DATA:levelx}\\s+\\[%{GREEDYDATA:user_id}\\]:\\s+%{GREEDYDATA:msg}"
      ]
    }
    on_error => "grok_message_failed_1"
    overwrite => ["timestamp_msg", "levelx", "msg", "user_id"]
  }

  if [grok_message_failed_1] {
    grok {
      match => {
        "message"  => [
          '%{TIMESTAMP_ISO8601:timestamp_msg}\\s+%{DATA:levelx}\\s+%{GREEDYDATA:msg}'
        ]
      }
      on_error => "grok_message_failed_2"
      overwrite => ["timestamp_msg", "levelx", "msg"]
    }
  }

  mutate {
    gsub => [ "timestamp_msg", ".{9}$", ""]
  }

  date {
    match => ["timestamp_msg", "ISO8601", "yyyy-MM-dd HH:mm:ss"]
    timezone => "Europe/Madrid"
    target => "metadata.event_timestamp"
    on_error => "timestamp_perf_error"
  }

  if [user_id] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{user_id}"
      }
      on_error => "no_user_id"
    }
  }

  if [levelx] != "" {
    mutate {
      replace => {
        "security_result.severity_details" => "%{levelx}"
      }
      on_error => "no_data_level"
    }
  }

  mutate {
    gsub => ["levelx", "INFO", "INFORMATIONAL"]
  }
  mutate {
    gsub => ["levelx", "DEBUG", "INFORMATIONAL"]
  }
  mutate {
    gsub => ["levelx", "TRACE", "INFORMATIONAL"]
  }
  mutate {
    gsub => ["levelx", "WARNING", "LOW"]
  }
  mutate {
    gsub => ["levelx", "ERROR", "ERROR"]
  }
  mutate {
    gsub => ["levelx", "FATAL", "CRITICAL"]
  }

  if [levelx] != "" {
    mutate {
      replace => {
        "security_result.severity" => "%{levelx}"
      }
      on_error => "no_data_level"
    }
  }

  if [msg] != "" {
    mutate {
      replace => {
        "principal.process.command_line" => "%{msg}"
      }
      on_error => "no_description_msg"
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name"  => "Neo4j"
      "metadata.product_name" => "Neo4j"
      "event_type"   => "GENERIC_EVENT"
    }
  }
  if [msg] =~ "logged in" {
    mutate {
      replace => {
        "event_type"   => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type"  => "MACHINE"
      }
    }
  }
  else if [msg] =~ "failed to log in" {
    mutate {
      replace => {
        "event_type"   => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type"  => "MACHINE"
      }
    }
  }
  else if [msg] =~ "START DATABASE|STOP DATABASE" {
    grok {
      match => {
        "msg"  => [
          '%{GREEDYDATA:msg_db}\\s+`%{GREEDYDATA:database}`'
        ]
      }
      on_error => "grok_message_failed_start_stop_db"
      overwrite => ["msg_db", "database"]
    }
    mutate {
      replace => {
        "target.resource.name" => "%{database}"
      }
      on_error => "database_error"
    }
  }
  else if [msg] =~ "DROP DATABASE" {
    grok {
      match => {
        "msg"  => [
          '%{GREEDYDATA:msg_drop}\\s+`%{GREEDYDATA:database}`\\s+%{GREEDYDATA:action}\\s+%{GREEDYDATA:user_dest}'
        ]
      }
      on_error => "grok_message_drop_db"
      overwrite => ["msg_drop", "database", "action", "user_dest"]
    }

    mutate {
      replace => {
        "target.resource.name" => "%{database}"
      }
      on_error => "database_error"
    }
    mutate {
      replace => {
        "target.user.userid"     => "%{user_dest}"
      }
      on_error => "no_target_user_id"
    }
  }
  else if [msg] =~ "GRANT ROLE" {
    grok {
      match => {
        "msg"  => [
          '%{GREEDYDATA:action}\\s+%{DATA:role}\\s+TO\\s+%{GREEDYDATA:user_dest}'
        ]
      }
      on_error => "grok_message_role_failed"
      overwrite => ["action", "user_dest","role"]
    }

    mutate {
      replace => {
        "target.user.userid"     => "%{user_dest}"
      }
      on_error => "no_target_user_id"
    }
    mutate {
      replace => {
        "roles.name"     => "%{role}"
      }
      on_error => "no_role"
    }
    mutate {
      merge => {
        "target.user.attribute.roles" => "roles"
      }
    }
  }
  else if [msg] =~ "CREATE USE" {
    grok {
      match => {
        "msg"  => [
          '%{GREEDYDATA:action}\\s+%{DATA:user_dest}\\sSET PASSWORD\\s+\'%{GREEDYDATA:user_pass}\'\\s+%{GREEDYDATA:msg_x}'
        ]
      }
      on_error => "grok_message_create_user_failed"
      overwrite => ["action","user_dest","user_pass","msg_x"]
    }

    mutate {
      replace => {
        "target.user.userid"     => "%{user_dest}"
      }
      on_error => "no_target_user_id"
    }
  }
  else if [msg] =~ "CREATE ROLE" {
    grok {
      match => {
        "msg"  => [
          '%{GREEDYDATA:action}\\s+%{GREEDYDATA:role}'
        ]
      }
      on_error => "grok_message_create_role_failed"
      overwrite => ["action","role"]
    }
    mutate {
      replace => {
        "target.resource.name" => "%{database}"
      }
      on_error => "database_error"
    }
    mutate {
      replace => {
        "roles.name"     => "%{role}"
      }
      on_error => "no_role"
    }
    mutate {
      merge => {
        "target.user.attribute.roles" => "roles"
      }
    }
  }
  else if [msg] =~ "DROP USER" {
    grok {
      match => {
        "msg"  => [
          '%{GREEDYDATA:action}\\s+%{GREEDYDATA:user_dest}'
        ]
      }
      on_error => "grok_message_drop_user_failed"
      overwrite => ["action", "user_dest"]
    }
    mutate {
      replace => {
        "target.user.userid"     => "%{user_dest}"
      }
      on_error => "no_target_user_id"
    }
  }

  mutate {
    merge => {
      "event.idm.read_only_udm.about.resource.attribute.labels"  => "id2"
    }
    on_error => "id2_not_found"
  }
  mutate {
    merge => {
      "event.idm.read_only_udm.about.resource.attribute.labels"  => "id3"
    }
    on_error => "id3_not_found"
  }

  mutate {
    merge => {
      "event.idm.read_only_udm.security_result"  => "security_result"
    }
    on_error => "merge_error"
  }

  if [event_type] == "GENERIC_EVENT" and [properties][host_group] != "" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }

  mutate {
    replace => {
      "metadata.event_type" => "%{event_type}"
    }
  }

  mutate {
    rename => {
      "target" => "event.idm.read_only_udm.target"
      "metadata" => "event.idm.read_only_udm.metadata"
      "principal" => "event.idm.read_only_udm.principal"
    }
  }
  mutate {
    merge => {
      "@output"   => "event"
    }
  }
}
