# Product: ORACLE OUD
# Category: ORACLE OUD
# Supported Format: SYSLOG
# Reference: https://www.oracle.com/middleware/technologies/id-mgmt/unified-directory/
# Last Updated: 2023-09-11
# Copyright 2023 Chronicle LLC

filter {

  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "additional" => ""
      "security_result" => ""
      "hostname" => ""
      "name" => ""
      "conn" => ""
      "op" => ""
      "msgID" => ""
      "oid" => ""
      "result" => ""
      "etime" => ""
      "operation" => ""
      "operation1" => ""
      "reason" => ""
      "uid" => ""
      "filter" => ""
      "attrs" => ""
      "srcaddr" => ""
      "srcport" => ""
      "destaddr" => ""
      "destport" => ""
      "ou" => ""
      "protocol" => ""
      "type" => ""
      "authFailureID" => ""
      "authFailureReason" => ""
      "version" => ""
      "vendor_name" => "Oracle OUD"
      "product_name" => "Oracle OUD"
      "event_type" => ""
      "event_time" => ""
      "from" => ""
      "to" => ""
      "msg_data" => ""
      "o" => ""
      "changetype" => ""
      "replace" => ""
    }
  }

  mutate {
    gsub => ["message", "[\\n]","\\\n"]
  }

  grok {
    match => {
      "message" => [
        "<%{INT}> %{DATA:hostname} \\[%{HTTPDATE:event_time}\\] %{DATA:operation} %{DATA:operation1} %{GREEDYDATA:kv_data} filter=\\\"(?P<filter>[^\\\"]+)\\\" attrs=\\\"(?P<attrs>\\w+)\\\""
        "<%{INT}> %{DATA:hostname} \\[%{HTTPDATE:event_time}\\] %{DATA:operation} %{DATA:operation1} %{GREEDYDATA:kv_data} filter=\\\"(?P<filter>[^\\\"]+)"
        "<%{INT}> %{DATA:hostname} \\[%{HTTPDATE:event_time}\\] %{DATA:operation}( %{DATA:operation1})? conn=%{DATA:conn} %{GREEDYDATA:kv_data}"
        "<%{INT}> %{DATA:hostname} # %{HTTPDATE:event_time}; conn=%{DATA:conn} %{GREEDYDATA:kv_data}"
        "<%{INT}> %{DATA:hostname} %{GREEDYDATA}# %{HTTPDATE:event_time}; conn=%{DATA:conn} %{GREEDYDATA:kv_data}"
      ]
    }
    on_error => "grok_fail"
    overwrite => ["hostname","kv_data","operation","operation1", "filter", "attrs", "srcaddr", "srcport", "destport", "destaddr", "event_time", "conn"]
  }

  if [grok_fail] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  mutate {
    gsub => [
      "kv_data", "\\\"",""
    ]
  }

  mutate {
    gsub => ["kv_data", "([\\w-]+)=","#$1="]
  }

  mutate {
    gsub => ["kv_data", "message","msg_data"]
  }

  kv {
    source => "kv_data"
    field_split => "#"
    value_split => "="
    on_error => "not_kv"
  }

  if [event_time] != "" {
    date {
      match => ["event_time", "dd/MMM/yyyy:HH:mm:ss Z"]
      on_error => "timestamp_error"
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
      }
    }
  }

  if [operation] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{operation}"
      }
    }
  }

  if [reason] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{reason}"
      }
    }
  }

  mutate {
    gsub => ["uid", "[,]$", ""]
  }

  if [uid] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{uid}"
      }
    }
  }

  if [from] != "" {
    grok {
      match => {
        "from" => "%{IP:srcaddr}:%{INT:srcport}"
      }
      overwrite => ["srcaddr", "srcport"]
      on_error => "grok_fail"
    }
    if [srcaddr] != "" {
      mutate {
        merge => {
          "principal.ip" => "srcaddr"
        }
      }
    }
    if [srcport] != "" {
      mutate {
        replace => {
          "principal.port" => "%{srcport}"
        }
      }
      mutate {
        convert => {
          "principal.port" => "integer"
        }
      }
    }
  }

  if [to] != "" {
    grok {
      match => {
        "to" => "%{IP:destaddr}:%{INT:destport}"
      }
      overwrite => ["destaddr", "destport"]
      on_error => "grok_fail"
    }
    if [destaddr] != "" {
      mutate {
        merge => {
          "target.ip" => "destaddr"
        }
      }
    }
    if [destport] != "" {
      mutate {
        replace => {
          "target.port" => "%{destport}"
        }
      }
      mutate {
        convert => {
          "target.port" => "integer"
        }
      }
    }
  }

  if [protocol] =~ "(?i)LDAPS" {
    mutate {
      replace => {
        "network.application_protocol" => "LDAP"
      }
    }
  }
  else if [protocol] != "" {
    mutate {
      replace => {
        "network.application_protocol" => "%{protocol}"
      }
    }
  }

  if [conn] != "" {
    mutate {
      replace => {
        "additional_conn.key" => "conn"
        "additional_conn.value.string_value" => "%{conn}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_conn"
      }
    }
  }

  if [op] != "" {
    mutate {
      gsub => ["op", "[\\\\ndn:]", ""]
    }
    mutate {
      replace => {
        "additional_op.key" => "op"
        "additional_op.value.string_value" => "%{op}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_op"
      }
    }
  }

  if [msgID] != "" {
    mutate {
      replace => {
        "additional_msgID.key" => "msgID"
        "additional_msgID.value.string_value" => "%{msgID}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_msgID"
      }
    }
  }

  if [oid] != "" {
    mutate {
      replace => {
        "additional_oid.key" => "oid"
        "additional_oid.value.string_value" => "%{oid}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_oid"
      }
    }
  }

  if [result] != "" {
    mutate {
      replace => {
        "additional_result.key" => "result"
        "additional_result.value.string_value" => "%{result}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_result"
      }
    }
  }

  if [etime] != "" {
    mutate {
      replace => {
        "additional_etime.key" => "etime"
        "additional_etime.value.string_value" => "%{etime}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_etime"
      }
    }
  }

  if [filter] != "" {
    mutate {
      replace => {
        "additional_filter.key" => "filter"
        "additional_filter.value.string_value" => "%{filter}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_filter"
      }
    }
  }

  if [attrs] != "" {
    mutate {
      replace => {
        "additional_attrs.key" => "attrs"
        "additional_attrs.value.string_value" => "%{attrs}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_attrs"
      }
    }
  }

  mutate {
    gsub => ["ou", "[,]$", ""]
  }

  if [ou] != "" {
    mutate {
      replace => {
        "additional_ou.key" => "ou"
        "additional_ou.value.string_value" => "%{ou}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_ou"
      }
    }
  }

  if [version] != "" {
    mutate {
      replace => {
        "additional_version.key" => "version"
        "additional_version.value.string_value" => "%{version}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_version"
      }
    }
  }

  if [type] != "" {
    mutate {
      replace => {
        "additional_type.key" => "type"
        "additional_type.value.string_value" => "%{type}"
      }
    }
    mutate {
      merge => {
        "additional.fields" => "additional_type"
      }
    }
  }

  if [authFailureID] != "" {
    mutate {
      replace => {
        "additional_authFailureID.key" => "authFailureID"
        "additional_authFailureID.value.string_value" => "%{authFailureID}"
      }
      on_error => "no_authFailureID"
    }
    mutate {
      merge => {
        "additional.fields" => "additional_authFailureID"
      }
      on_error => "no_authFailureID"
    }
  }

  if [authFailureReason] != "" {
    mutate {
      replace => {
        "additional_authFailureReason.key" => "authFailureReason"
        "additional_authFailureReason.value.string_value" => "%{authFailureReason}"
      }
      on_error => "no_authFailureReason"
    }
    mutate {
      merge => {
        "additional.fields" => "additional_authFailureReason"
      }
      on_error => "no_authFailureReason"
    }
  }

  if [name] != "" {
    mutate {
      replace => {
        "additional_name.key" => "name"
        "additional_name.value.string_value" => "%{name}"
      }
      on_error => "no_name"
    }
    mutate {
      merge => {
        "additional.fields" => "additional_name"
      }
      on_error => "no_name"
    }
  }

  if [o] != "" {
    grok {
      match => {
        "o" => "%{GREEDYDATA}changetype: %{WORD:changetype}.*replace: %{GREEDYDATA:replace}"
      }
      overwrite => ["changetype", "replace"]
      on_error => "grok_fail_1"
    }
    if [changetype] != "" {
      mutate {
        replace => {
          "additional_changetype.key" => "changetype"
          "additional_changetype.value.string_value" => "%{changetype}"
        }
        on_error => "no_changetype"
      }
      mutate {
        merge => {
          "additional.fields" => "additional_changetype"
        }
        on_error => "no_changetype"
      }
    }
    if [replace] != "" {
      mutate {
        replace => {
          "additional_replace.key" => "replace"
          "additional_replace.value.string_value" => "%{replace}"
        }
        on_error => "no_replace"
      }
      mutate {
        merge => {
          "additional.fields" => "additional_replace"
        }
        on_error => "no_replace"
      }
    }
  }

  if [operation] != "" and [operation1] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{operation} %{operation1}"
      }
      on_error => "no_operation"
    }
  }
  else if [operation] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{operation}"
      }
      on_error => "no_operation"
    }
  }

  if [msg_data] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{msg_data}"
      }
      on_error => "no_msg_data"
    }
  }

  if [vendor_name] != "" {
    mutate {
      replace => {
        "metadata.vendor_name" => "%{vendor_name}"
      }
    }
  }

  if [product_name] != "" {
    mutate {
      replace => {
        "metadata.product_name" => "%{product_name}"
      }
    }
  }

  if [srcaddr] != "" and [destaddr] != "" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [uid] != "" {
    mutate {
      replace => {
        "event_type" => "USER_RESOURCE_ACCESS"
      }
    }
  }
  else if [hostname] != "" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
    }
  }

  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
