# Product: FIVETRAN
# Category: SIEM Systems
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2024-06-24
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "event_type" => "GENERIC_EVENT"
      "principal" => ""
      "security_result" => ""
      "target" => ""
      "metadata" => ""
      "additional" => ""
      "insertId" => ""
      "jsonPayload" => ""
      "labels" => ""
      "logName" => ""
      "receiveTimestamp" => ""
      "resource" => ""
      "severity" => ""
      "has_principal_user" => "false"
      "has_principal" => "false"
      "has_target" => "false"
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "json_error"
  }

  mutate {
    gsub => ["message" , "\r\n" , ""]
  }

  mutate {
    gsub => ["message" , "\\s+" , " "]
  }

  if [json_error]{
    drop {
      tag => "TAG_UNSUPPORTED"
    }
  }

  if [severity] =~ "INFO" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
      on_error => "severity_invalid"
    }
  }

  if [insertId] != "" {
    mutate {
      replace => {
        "insertId_label.key" => "insertId"
        "insertId_label.value.string_value" => "%{insertId}"
      }
      on_error => "insertId_invalid"
    }
    if ![insertId_invalid] {
      mutate {
        merge => {
          "additional.fields" => "insertId_label"
        }
        on_error => "insertId_merge_invalid"
      }
    }
  }

  if [timestamp] != "" {
    date {
      match => ["timestamp", "ISO8601"]
      on_error => "timestamp_failure"
    }
  }

  mutate {
    replace => {
      "principal.hostname" => "%{jsonPayload.connector_name}"
      "principal.asset.hostname" => "%{jsonPayload.connector_name}"
      "has_principal" => "true"
    }
    on_error => "connector_name_invalid"
  }

  mutate {
    replace => {
      "connector_type_label.key" => "connector_type"
      "connector_type_label.value.string_value" => "%{jsonPayload.connector_type}"
    }
    on_error => "connector_type_invalid"
  }
  if ![connector_type_invalid] {
    mutate {
      merge => {
        "additional.fields" => "connector_type_label"
      }
      on_error => "connector_type_merge_invalid"
    }
  }

  mutate {
    replace => {
      "connector_id_label.key" => "connector_id"
      "connector_id_label.value.string_value" => "%{jsonPayload.connector_id}"
    }
    on_error => "connector_id_invalid"
  }
  if ![connector_id_invalid] {
    mutate {
      merge => {
        "additional.fields" => "connector_id_label"
      }
      on_error => "connector_id_merge_invalid"
    }
  }

  mutate {
    replace => {
      "metadata.product_event_type" => "%{jsonPayload.event}"
    }
    on_error => "event_invalid"
  }

  mutate {
    replace => {
      "target.resource.type" => "DATABASE"
      # "has_target" => "true"
    }
    on_error => "resource_type_invalid"
  }

  mutate {
    replace => {
      "metadata.product_log_id" => "%{jsonPayload.sync_id}"
    }
    on_error => "sync_id_invalid"
  }

  mutate {
    convert => {
      "jsonPayload.data.executionTime" => "string"
    }
    on_error => "executionTime_not_string"
  }

  mutate {
    replace => {
      "executionTime_label.key" => "executionTime"
      "executionTime_label.value.string_value" => "%{jsonPayload.data.executionTime}"
    }
    on_error => "executionTime_invalid"
  }
  if ![executionTime_invalid] {
    mutate {
      merge => {
        "additional.fields" => "executionTime_label"
      }
      on_error => "executionTime_merge_invalid"
    }
  }

  mutate {
    convert => {
      "jsonPayload.data.number" => "string"
    }
    on_error => "number_not_string"
  }
  mutate {
    replace => {
      "number_label.key" => "number"
      "number_label.value.string_value" => "%{jsonPayload.data.number}"
    }
    on_error => "number_invalid"
  }
  if ![number_invalid] {
    mutate {
      merge => {
        "additional.fields" => "number_label"
      }
      on_error => "number_merge_invalid"
    }
  }

  mutate {
    replace => {
      "query_label.key" => "query"
      "query_label.value.string_value" => "%{jsonPayload.data.query}"
    }
    on_error => "query_invalid"
  }
  if ![query_invalid] {
    mutate {
      merge => {
        "additional.fields" => "query_label"
      }
      on_error => "query_merge_invalid"
    }
  }

  if [labels][levelName] != "" {
    mutate {
      replace => {
        "levelName_label.key" => "levelName"
        "levelName_label.value.string_value" => "%{labels.levelName}"
      }
      on_error => "levelName_invalid"
    }
    if ![levelName_invalid] {
      mutate {
        merge => {
          "additional.fields" => "levelName_label"
        }
        on_error => "levelName_merge_invalid"
      }
    }
  }

  if [labels][levelValue] != "" {
    mutate {
      replace => {
        "levelValue_label.key" => "levelValue"
        "levelValue_label.value.string_value" => "%{labels.levelValue}"
      }
      on_error => "levelValue_invalid"
    }
    if ![levelValue_invalid] {
      mutate {
        merge => {
          "additional.fields" => "levelValue_label"
        }
        on_error => "levelValue_merge_invalid"
      }
    }
  }

  if [logName] != "" {
    mutate {
      replace => {
        "target.resource.name" => "%{logName}"
        "has_target" => "true"
      }
      on_error => "logName_invalid"
    }
  }

  if [resource][labels][email_id] =~ "^.+@.+$" {
    mutate {
      merge => {
        "principal.user.email_addresses" => "resource.labels.email_id"
      }
      on_error => "email_merge_invalid"
    }
    if ![email_merge_invalid] {
      mutate {
        replace => {
          "has_principal_user" => "true"
        }
      }
    }
  }

  if [resource][labels][project_id] != "" {
    mutate {
      replace => {
        "principal.user.product_object_id" => "%{resource.labels.project_id}"
      }
      on_error => "project_id_invalid"
    }
  }

  if [resource][labels][unique_id] not in ["" , "null" , " "] {
    mutate {
      replace => {
        "principal.user.userid" => "%{resource.labels.unique_id}"
        "has_principal_user" => "true"
      }
      on_error => "unique_id_invalid"
    }
  }

  if [resource][type] != "" {
    mutate {
      replace => {
        "type_label.key" => "type"
        "type_label.value.string_value" => "%{resource.type}"
      }
      on_error => "resource_type_invalid"
    }
    if ![resource_type_invalid] {
      mutate {
        merge => {
          "additional.fields" => "type_label"
        }
        on_error => "resource_type_merge_invalid"
      }
    }
  }

  if [has_principal_user] == "true" && [has_target] == "true" {
    mutate {
      replace => {
        "event_type" => "RESOURCE_READ"
      }
      on_error => "event_type_status_invalid"
    }
  }
  else if [has_principal_user] == "true" {
    mutate {
      replace => {
        "event_type" => "USER_COMMUNICATION"
      }
      on_error => "event_type_resource_invalid"
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
      on_error => "event_type_status_invalid"
    }
  }
  else {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
      on_error => "event_type_generic_invalid"
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_invalid"
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
      on_error => "additional_invalid"
    }
  }

  mutate {
    replace => {
      "metadata.vendor_name" => "FIVETRAN"
      "metadata.product_name" => "FIVETRAN"
    }
    on_error => "metadata_vp_invalid"
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
      on_error => "event_type_invalid"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
      on_error => "metadata_invalid"
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
      on_error => "principal_invalid"
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
      on_error => "target_invalid"
    }
  }

  # output the built event
  mutate {
    merge=> {
      "@output" => "event"
    }
  }
}
