# Product: DIGI_MODEMS
# Category: Switches and Routers
# Supported Format: SYSLOG
# Reference : NA
# Last Updated: 2023-06-26
# Copyright 2023 Chronicle LLC


filter {
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "security_result" => ""
      "target" => ""
      "extensions" => ""
      "network" => ""
      "sec_action" => ""
      "ts" => ""
      "hostname" => ""
      "product_type" => ""
      "content" => ""
      "user" => ""
      "type" => ""
      "event_type" => ""
      "ip" => ""
      "port" => ""
      "http_method" => ""
      "http_version" => ""
      "proto" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{DATA:hostname} %{DATA:product_type} - %{TIME}, %{MONTHDAY} %{MONTH} %{YEAR},%{GREEDYDATA:content}"
      ]
    }
    on_error => "grok_failed"
    overwrite => ["ts", "hostname", "product_type", "content"]
  }

  if [grok_failed] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [ts] != "" {
    date {
      match => ["ts", "MMM d HH:mm:ss", "MMM  d HH:mm:ss" ]
      rebase => true
      on_error => "diff_format"
      target => "event1.idm.read_only_udm.metadata.event_timestamp"
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
      }
    }
  }

  if [product_type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{product_type}"
      }
    }
  }

  if [content] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{content}"
      }
    }
    grok {
      match => {
        "content" => [
          "%{WORD:type} Login OK by %{DATA:user} %{GREEDYDATA}"
          "Login failure by %{DATA:http_method} \\/%{DATA:user} %{DATA:proto}\\/%{DATA:http_version}: CMD,%{GREEDYDATA:type}"
          "Login failure by Host: %{IP:ip}:%{INT:port}: CMD,%{GREEDYDATA:type}"
          "Login failure by %{DATA:user}: CMD,%{GREEDYDATA:type}"
          "Login failure by %{DATA:user}: %{DATA:type}"
        ]
      }
      on_error => "grok_failed"
      overwrite => ["type", "user", "command", "ip", "port", "http_method", "proto", "http_version"]
    }
  }

  if [message] =~ "Login OK" {
    mutate {
      replace => {
        "sec_action" => "ALLOW"
      }
    }
  }
  else if [message] =~ "Login failure" {
    mutate {
      replace => {
        "sec_action" => "BLOCK"
      }
    }
  }

  if [type] != "" {
    mutate {
      replace => {
        "login_type_label.key" => "Login type"
        "login_type_label.value" => "%{type}"
      }
      merge => {
        "security_result.detection_fields" => "login_type_label"
      }
    }
  }

  if [user] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{user}"
        "extensions.auth.type" => "MACHINE"
        "event_type" => "USER_LOGIN"
      }
    }
  }

  if [ip] != "" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
      merge => {
        "target.ip" => "ip"
      }
    }
  }

  if [port] != "" {
    mutate {
      convert => {
        "port" => "integer"
      }
      on_error => "conversion_failed"
    }
    if ![conversion_failed] {
      mutate {
        rename => {
          "port" => "target.port"
        }
      }
    }
  }

  if [http_method] != "" {
    mutate {
      replace => {
        "network.http.method" => "%{http_method}"
      }
    }
  }

  if [proto] != "" {
    mutate {
      replace => {
        "network.application_protocol" => "%{proto}"
      }
    }
  }

  if [http_version] != "" {
    mutate {
      replace => {
        "network.application_protocol_version" => "%{http_version}"
      }
    }
  }

  if [sec_action] != "" {
    mutate {
      merge => {
        "security_result.action" => "sec_action"
      }
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "DIGI_MODEMS"
      "metadata.vendor_name" => "DIGI_MODEMS"
      "metadata.event_type" => "%{event_type}"
    }
  }

  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

