# Product: QUEST_FILE_AUDIT
# Category: Alert
# Supported Format: JSON
# Reference: https://support.quest.com/technical-documents/change-auditor-for-windows-file-servers/7.0.1/event-reference-guide#TOPIC-1009899
# Last Updated: 2024-01-13
# Copyright 2024 Chronicle LLC


filter {
  mutate {
    replace => {
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "observer" => ""
      "additional" => ""
      "security_result" => ""
      "event_type" => ""
      "has_principal_machine" => "false"
      "has_target_machine" => "false"
      "EventTime" => ""
      "Hostname" => ""
      "Keywords" => ""
      "EventType" => ""
      "SeverityValue" => ""
      "Severity" => ""
      "EventID" => ""
      "SourceName" => ""
      "Task" => ""
      "RecordNumber" => ""
      "ProcessID" => ""
      "ThreadID" => ""
      "Channel" => ""
      "Domain" => ""
      "AccountName" => ""
      "UserID" => ""
      "AccountType" => ""
      "Category" => ""
      "Opcode" => ""
      "EventReceivedTime" => ""
      "SourceModuleName" => ""
      "SourceModuleType" => ""
      "logonID" => ""
      "ip_address" => ""
      "file_path" => ""
      "description" => ""
      "temp_data" => ""
    }
  }

  json {
    source     => "message"
    array_function => "split_columns"
    on_error     => "not_json"
  }

  if [not_json] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [EventTime] != "" {
    date {
      match => ["EventTime", "UNIX_MS"]
      target => "metadata.event_timestamp"
      on_error => "invalid_format"
    }
  }

  if [Hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{Hostname}"
        "principal.asset.hostname" => "%{Hostname}"
        "has_principal_machine" => "true"
      }
      on_error => "no_Hostname"
    }
  }

  if [Keywords] != "" {
    mutate {
      replace => {
        "keywords_label.value.string_value" => "%{Keywords}"
      }
      on_error => "keywords_label_not_present"
    }
    if ![keywords_label_not_present] and [Keywords] != "" {
      mutate {
        replace => {
          "keywords_label.key" => "Keywords"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "keywords_label"
        }
        on_error => "keywords_label_not_present"
      }
    }
  }

  if [EventType] != "" {
    mutate {
      replace => {
        "eventtype_label.value.string_value" => "%{EventType}"
      }
      on_error => "eventtype_label_not_present"
    }
    if ![eventtype_label_not_present] and [EventType] != "" {
      mutate {
        replace => {
          "eventtype_label.key" => "EventType"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "eventtype_label"
        }
        on_error => "eventtype_label_not_present"
      }
    }
  }

  if [SeverityValue] not in ["", "-"] {
    if [SeverityValue] in [ 1, 2, 3 ] {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    }
    else if [SeverityValue] == 4 {
      mutate {
        replace => {
          "security_result.severity" => "ERROR"
        }
      }
    }
    else if [SeverityValue] == 5 {
      mutate {
        replace => {
          "security_result.severity" => "CRITICAL"
        }
      }
    }
  }

  if [Severity] != "" {
    mutate {
      replace => {
        "security_result.severity_details" => "%{Severity}"
      }
      on_error => "no_Severity"
    }
  }

  if [EventID] != "" {
    mutate {
      convert => {
        "EventID" => "string"
      }
      on_error => "convert_failed"
    }
    mutate {
      replace => {
        "metadata.product_event_type" => "%{EventID}"
      }
      on_error => "no_EventID"
    }
  }

  if [SourceName] != "" {
    mutate {
      replace => {
        "principal.application" => "%{SourceName}"
      }
      on_error => "no_SourceName"
    }
  }

  if [Task] != "" {
    mutate {
      convert => {
        "Task" => "string"
      }
      on_error => "convert_failed"
    }
    mutate {
      replace => {
        "task_label.value.string_value" => "%{Task}"
      }
      on_error => "task_label_not_present"
    }
    if ![task_label_not_present] and [Task] != "" {
      mutate {
        replace => {
          "task_label.key" => "Task"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "task_label"
        }
        on_error => "task_label_not_present"
      }
    }
  }

  if [RecordNumber] != "" {
    mutate {
      convert => {
        "RecordNumber" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "metadata.product_log_id" => "%{RecordNumber}"
      }
      on_error => "no_RecordNumber"
    }
  }

  if [ProcessID] != "" {
    mutate {
      convert => {
        "ProcessID" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "principal.process.pid" => "%{ProcessID}"
      }
      on_error => "no_ProcessID"
    }
  }

  if [ThreadID] != "" {
    mutate {
      convert => {
        "ThreadID" => "string"
      }
      on_error => "convert_failed"
    }
    mutate {
      replace => {
        "threadid_label.value.string_value" => "%{ThreadID}"
      }
      on_error => "threadid_label_not_present"
    }
    if ![threadid_label_not_present] and [ThreadID] != "" {
      mutate {
        replace => {
          "threadid_label.key" => "ThreadID"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "threadid_label"
        }
        on_error => "threadid_label_not_present"
      }
    }
  }

  if [Channel] != "" {
    mutate {
      replace => {
        "channel_label.value.string_value" => "%{Channel}"
      }
      on_error => "channel_label_not_present"
    }
    if ![channel_label_not_present] and [Channel] != "" {
      mutate {
        replace => {
          "channel_label.key" => "Channel"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "channel_label"
        }
        on_error => "channel_label_not_present"
      }
    }
  }

  if [Domain] != "" {
    mutate {
      replace => {
        "principal.administrative_domain" => "%{Domain}"
      }
      on_error => "no_Domain"
    }
  }

  if [AccountName] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{AccountName}"
      }
      on_error => "no_AccountName"
    }
  }

  if [UserID] != "" {
    mutate {
      replace => {
        "principal.user.windows_sid" => "%{UserID}"
      }
      on_error => "no_UserID"
    }
  }

  if [AccountType] != "" {
    mutate {
      replace => {
        "roles.name" => "%{AccountType}"
      }
      on_error => "no_AccountType"
    }

    if ![no_AccountType] {
      mutate {
        merge => {
          "principal.user.attribute.roles" => "roles"
        }
        on_error => "no_AccountType"
      }
    }
  }

  if [Category] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{Category}"
      }
      on_error => "no_Category"
    }
  }

  if [Opcode] != "" {
    mutate {
      replace => {
        "opcode_label.value.string_value" => "%{Opcode}"
      }
      on_error => "opcode_label_not_present"
    }
    if ![opcode_label_not_present] and [Opcode] != "" {
      mutate {
        replace => {
          "opcode_label.key" => "Opcode"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "opcode_label"
        }
        on_error => "opcode_label_not_present"
      }
    }
  }

  if [EventReceivedTime] != "" {
    date {
      match => ["EventReceivedTime", "UNIX_MS"]
      target => "metadata.ingested_timestamp"
      on_error => "invalid_format"
    }
  }

  if [SourceModuleName] != "" {
    mutate {
      replace => {
        "source_module_name_label.value" => "%{SourceModuleName}"
      }
      on_error => "source_module_name_label_not_present"
    }
    if ![source_module_name_label_not_present] and [SourceModuleName] != "" {
      mutate {
        replace => {
          "source_module_name_label.key" => "SourceModuleName"
        }
      }
      mutate {
        merge => {
          "observer.resource.attribute.labels" => "source_module_name_label"
        }
        on_error => "source_module_name_label_not_present"
      }
    }
  }

  if [SourceModuleType] != "" {
    mutate {
      replace => {
        "observer.application" => "%{SourceModuleType}"
      }
      on_error => "no_SourceModuleType"
    }
  }

  grok {
    match => {
      "Message" => "%{GREEDYDATA:description}:%{GREEDYDATA:temp_data}"
    }
    on_error => "grok_failed_0"
    overwrite => ["description", "temp_data"]
  }
  if ![grok_failed_0] and [description] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{description}"
      }
      on_error => "no_description"
    }
  }
  grok {
    match => {
      "Message" => ".*User Logon ID: %{DATA:logonID} %{GREEDYDATA:temp_data}"
    }
    on_error => "grok_failed"
    overwrite => ["logonID", "temp_data"]
  }
  if ![grok_failed] {
    if [logonID] != "" {
      mutate {
        replace => {
          "logonID_label.value" => "%{logonID}"
        }
        on_error => "logonID_label_not_present"
      }
      if ![logonID_label_not_present] and [SourceModuleName] != "" {
        mutate {
          replace => {
            "logonID_label.key" => "User Logon ID"
          }
        }
        mutate {
          merge => {
            "principal.user.attribute.labels" => "logonID_label"
          }
          on_error => "logonID_label_not_present"
        }
      }
    }
  }
  grok {
    match => {
      "Message" => ".*User IP Address: %{IP:ip_address} %{GREEDYDATA:temp_data}"
    }
    on_error => "grok_failed_1"
    overwrite => ["ip_address", "temp_data"]
  }
  if ![grok_failed_1] {
    if [ip_address] != "" {
      mutate {
        merge => {
          "principal.ip" => "ip_address"
          "principal.asset.ip" => "ip_address"
        }
        on_error => "no_ip_address"
      }
    }
  }

  if [EventID] in ["779","780"] {
    if [EventID] == "779" {
      grok {
        match => {
          "Message" => ".*Folder Path: %{DATA:file_path} %{GREEDYDATA:temp_data}"
        }
        on_error => "grok_failed_2"
        overwrite => ["file_path", "temp_data"]
      }
    }
    else if [EventID] == "780" {
      grok {
        match => {
          "Message" => "Process: %{GREEDYDATA:file_path} %{GREEDYDATA:temp_data}"
        }
        on_error => "grok_failed_2"
        overwrite => ["file_path", "temp_data"]
      }
    }
    if ![grok_failed_2] {
      if [file_path] != "" {
        mutate {
          replace => {
            "target.process.file.full_path" => "%{file_path}"
            "target.file.full_path" => "%{file_path}"
          }
          on_error => "no_file_path"
        }
        mutate {
          replace => {
            "event_type" => "FILE_OPEN"
          }
        }
      }
    }
  }
  else if [EventID] in ["1025", "1026"] {
    grok {
      match => {
        "Message" => ".*Folder Path: %{DATA:file_path} %{GREEDYDATA:temp_data}"
      }
      on_error => "grok_failed_2"
      overwrite => ["file_path", "temp_data"]
    }
    if ![grok_failed_2] {
      if [file_path] != "" {
        mutate {
          replace => {
            "target.process.file.full_path" => "%{file_path}"
            "target.file.full_path" => "%{file_path}"
          }
          on_error => "no_file_path"
        }
        mutate {
          replace => {
            "event_type" => "FILE_MODIFICATION"
          }
        }
      }
    }
  }
  else if [EventID] in ["1281", "1282"] {
    grok {
      match => {
        "Message" => ".*Folder Path: %{DATA:file_path} %{GREEDYDATA:temp_data}"
      }
      on_error => "grok_failed_2"
      overwrite => ["file_path", "temp_data"]
    }
    if ![grok_failed_2] {
      if [file_path] != "" {
        mutate {
          replace => {
            "target.process.file.full_path" => "%{file_path}"
            "target.file.full_path" => "%{file_path}"
          }
          on_error => "no_file_path"
        }
        mutate {
          replace => {
            "event_type" => "FILE_CREATION"
          }
        }
      }
    }
  }
  else if [EventID] in ["1537", "1538"] {
    grok {
      match => {
        "Message" => ".*Object Path: %{GREEDYDATA:file_path} %{GREEDYDATA:temp_data}"
      }
      on_error => "grok_failed_2"
      overwrite => ["file_path", "temp_data"]
    }
    if ![grok_failed_2] {
      if [file_path] != "" {
        mutate {
          replace => {
            "target.process.file.full_path" => "%{file_path}"
            "target.file.full_path" => "%{file_path}"
          }
          on_error => "no_file_path"
        }
        mutate {
          replace => {
            "event_type" => "FILE_DELETION"
          }
        }
      }
    }
  }
  else if [EventID] in ["769", "770"] {
    grok {
      match => {
        "Message" => ".*Folder Path: %{DATA:file_path} %{GREEDYDATA:temp_data}"
      }
      on_error => "grok_failed_2"
      overwrite => ["file_path", "temp_data"]
    }
    if ![grok_failed_2] {
      if [file_path] != "" {
        mutate {
          replace => {
            "target.process.file.full_path" => "%{file_path}"
            "target.file.full_path" => "%{file_path}"
          }
          on_error => "no_file_path"
        }
        mutate {
          replace => {
            "event_type" => "FILE_READ"
          }
        }
      }
    }
  }

  if [event_type] == "" {
    if [has_principal_machine] == "true" {
      mutate {
        replace => {
          "event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event_type" => "GENERIC_EVENT"
        }
      }
    }
  }
  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
      on_error => "no_event_type"
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "Quest File Access Audit"
      "metadata.vendor_name" => "Quest"
    }
  }

  # merge the data into udm nouns.
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [observer] != "" {
    mutate {
      rename => {
        "observer" => "event.idm.read_only_udm.observer"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

