# Product: STEALTHBITS_DEFEND
# Category: Security System for Active Directory and File Systems.
# Supported Format: SYSLOG + KV (LEEF, CEF)
# Reference: https://docs.mcafee.com/bundle/enterprise-security-manager-data-sources-configuration-reference-guide/page/GUID-719A5E99-3DF8-4FA4-93D3-5A9CD19B0EDE.html
# Last Updated: 2022-11-17
# Copyright 2022 Chronicle LLC

filter {
  mutate {
    replace => {
      "Reason" => ""
      "sec_result" => ""
      "intermediary" => ""
      "attacking_host" => ""
      "breached_from_host" => ""
      "SettingName" => ""
      "DistinguishedName" => ""
      "AffectedObject" => ""
      "domain" => ""
      "Severity" => ""
      "UserSID" => ""
      "UserName" => ""
      "AttackedHost" => ""
      "AttackedHostIp" => ""
      "AttackingHost" => ""
      "AttackingHostIp" => ""
      "UsedLoginProtocols" => ""
      "AlertText" => ""
      "Started" => ""
      "Ended" => ""
      "vulns" => ""
      "event_type" => ""
      "category" => ""
      "OrigServer" => ""
      "usrName" => ""
      "src" => ""
      "dst" => ""
      "devTime" => ""
      "sec_result_action" => ""
      "suser" => ""
      "duser" => ""
      "shost" => ""
      "source_domain" => ""
      "Attribute_Name" => ""
      "attacking_host_list" => ""
      "operation" => ""
      "policy_name" => ""
      "att_name" => ""
      "rt_time" => ""
      "success" => ""
      "device_version" => ""
      "product_event" => ""
      "device_product" => "Stealthbits Defend"
      "device_vendor" => "STEALTHBITS_DEFEND"
      "kv_data1" => ""
      "kv_data" => ""
      "is_principal_present" => "false"
      "is_pri_user_present" => "false"
      "is_tar_user_present" => "false"
      "is_target_present" => "false"
    }
  }
  grok{
    match => {
       "message" => [
        "%{SYSLOGTIMESTAMP} %{DATA:intermediary_hostname} %{GREEDYDATA:cef}\\|%{GREEDYDATA:device_vendor}\\|%{DATA:device_product}\\|%{DATA:device_version}\\|%{DATA:product_event}\\|cat=(?P<category>\\w+\\s*.*?)\\t%{GREEDYDATA:kv_data}",
        "%{SYSLOGTIMESTAMP} %{DATA:intermediary_hostname} (?P<cef>CEF):%{INT}\\|%{DATA:device_vendor}\\|%{DATA:device_product}\\|%{DATA:device_version}\\|%{DATA}\\s+%{DATA:product_event}\\s+%{DATA}\\|AD:%{DATA:Severity}\\|%{INT}\\|%{GREEDYDATA:kv_data}",
        "<%{INT}>%{INT}\\s+%{SYSLOGTIMESTAMP:timestamp}\\s+%{DATA:intermediary_hostname}\\s+%{DATA:device_product}\\s+-\\s+%{DATA:product_event}\\s+-\\s+%{GREEDYDATA:kv_data1}"
       ]
    }
    overwrite => ["category","Severity","device_version","product_event","device_product","kv_data1","kv_data","device_vendor"]
    on_error => "parsing_error"
  }

  if [parsing_error] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  if [kv_data] != "" {
    kv {
      source => "kv_data"
      field_split => "\\t"
      value_split => "="
      unescape_field_split => true
    }
  }
  if [kv_data1] != "" {
    kv {
      source => "kv_data1"
      field_split => " "
      value_split => "="
    }
  }

  if [OrigServer] != "" {
    mutate {
      gsub => [
        OrigServer,"\\\w+\\\\",""
      ]
    }
  }
  if [UserName] != "" {
    mutate {
      gsub => [
        UserName,"\\\w+\\\\",""
      ]
    }
  }
  if [usrName] != "" {
    mutate {
      gsub => [
        usrName,"\\\w+\\\\",""
      ]
    }
  }
  mutate {
    gsub => [
      AffectedObject,"\\\w+\\\\","",
      DistinguishedName,"\\\\",""
    ]
  }

  if [intermediary_hostname] != "" {
    mutate {
      replace => {
        "intermediary.hostname" => "%{intermediary_hostname}"
      }
    }
  }

  if [device_version] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{device_version}"
      }
    }
  }

  if [product_event] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{product_event}"
      }
    }
  }

  if [SettingName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{SettingName}"
      }
    }
  }

  if [domain] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.administrative_domain" => "%{domain}"
      }
    }
  }

  grok {
    match => {
      "kv_data" => [
        "(S|s)uccess=\\s+%{WORD:success}"
      ]
    }
    on_error => "success_error"
    overwrite => ["success"]
  }

  if [category] == "" {
    mutate {
      replace => {
        "category" => "%{success}"
      }
    }
  }

  if [category] != "" {
    if [category] =~ "(?i)Auth failed" or [category] =~ "(?i)false" {
      mutate {
        replace => {
          "sec_result_action" => "BLOCK"
        }
      }
    } else if [category] =~ "(?i)Auth succeed" or [category] =~ "(?i)true"{
      mutate {
        replace => {
          "sec_result_action" => "ALLOW"
        }
      }
    }
    if [sec_result_action]  != "" {
      mutate {
        merge => {
          "sec_result.action" =>"sec_result_action"
        }
      }
    }
    mutate {
      merge => {
        "sec_result.category_details" => "category"
      }
    }
  }

  if [OrigServer] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{OrigServer}"
        "is_target_present" => "true"
      }
    }
  }

  if [Reason] != "" {
    mutate {
      replace => {
        "sec_result.summary" => "%{Reason}"
        "event_type" => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }
  if [SettingName] != "" and [SettingName] =~ "Group Membership Changes"{
    mutate {
      replace => {
        "event_type" => "GROUP_MODIFICATION"
      }
    }
  }

  if [AlertText] != "" {
    grok {
      match => {
        "AlertText" => [
          "%{GREEDYDATA}; Attacking hosts:  %{GREEDYDATA:attacking_host_list}"
          "%{GREEDYDATA}; Breached from Host: (\UNKNOWN\) %{IP:breached_from_host}"
          "%{GREEDYDATA}; Breached from Host: %{GREEDYDATA:breached_from_host}"]
      }
      on_error  => "grok_not_matched"
      overwrite => ["attacking_host_list", "breached_from_host"]
    }

    if [attacking_host_list] != "" {
      mutate {
        gsub => ["attacking_host_list", ", ","\",\""]
      }
      mutate {
        replace => {
          "attacking_host_list" => '{\"attacking_host_list\":["%{attacking_host_list}"]}'
        }
      }
      json {
        source => "attacking_host_list"
        array_function => "split_columns"
      }
      for index,attacked_host in attacking_host_list {
        mutate {
          replace => {
            "about" => ""
          }
        }
        grok {
          match => {
            "attacked_host" => "%{GREEDYDATA:attack_host} \\(%{NUMBER}\\)"
          }
          overwrite => ["attack_host"]
        }
        if [index] == 0 {
          mutate {
            replace => {
              "attacking_host" => "%{attack_host}"
            }
          }
        }
        else {
          mutate {
            replace => {
              "about.hostname" => "%{attack_host}"
            }
          }
          if [about] != "" {
            mutate {
              merge => {
                "event.idm.read_only_udm.about" => "about"
              }
            }
          }
        }
      }
    }
    mutate {
      replace => {
        "sec_result.description" => "%{AlertText}"
      }
    }
  }

  if [Severity] =~ "(?i)Info" {
    mutate {
      replace => {
        "sec_result.severity" => "INFORMATIONAL"
      }
    }
  } else if [Severity] =~ "(?i)Warning" {
    mutate {
      replace => {
        "sec_result.severity" => "MEDIUM"
      }
    }
  } else if [Severity] =~ "(?i)(Critical|block)" {
    mutate {
      replace => {
        "sec_result.severity" => "HIGH"
      }
    }
  }

  grok {
    match => {
      "kv_data" => [
        "Operation=(?P<operation> (.*?)(?:\\t|$))"
      ]
    }
    on_error => "operation_error"
    overwrite => ["operation"]
  }
  if [operation] != "" {
    mutate {
      replace => {
        "sec_result.description" => "%{operation}"
      }
    }
  }

  grok {
    match => {
      "kv_data" => [
         "Attribute_Name=\\s+%{WORD:att_name}"
      ]
    }
    on_error => "att_name_error"
    overwrite => ["att_name"]
  }
  if [att_name] != "" {
    mutate {
      replace => {
        "sec_result.summary" => "%{att_name}"
      }
    }
  }

  if [UsedLoginProtocols] != "" {
    mutate {
      replace => {
        "protocol_label.key" => "Used Login Protocols"
        "protocol_label.value" => "%{UsedLoginProtocols}"
      }
    }
    mutate {
      merge => {
        "sec_result.about.labels" => "protocol_label"
      }
    }
  }

  grok {
    match => {
      "kv_data" => [
         "msg=(P|p)olicy_Name=\\s+(?P<policy_name>[\\w_:\\s]+) %{NOTSPACE}"
      ]
    }
    on_error => "policy_error"
    overwrite => ["policy_name"]
  }

  if [policy_name] != "" {
    mutate {
      replace => {
        "sec_result.rule_name" => "%{policy_name}"
      }
    }
  }

  if [UsedLoginProtocols] =~ "NTLM" or [UsedLoginProtocols] =~ "Kerberos" {
    mutate {
      replace =>  {
        "event.idm.read_only_udm.extensions.auth.type" => "SSO"
      }
    }
  }

  grok {
    match => {
      "kv_data" => [
         "suser=%{DATA:suser}@%{DATA:domain}(\\s+)(\\w+)="
         "suser=%{DATA:suser}@%{DATA:domain}(\\s+)"
         "suser=%{DATA:suser}@%{DATA:domain}"
         "suser=%{DATA:suser}(\\s+)(\\w+)="
         "suser=%{DATA:suser}(\\s+)"
         "suser=%{DATA:suser}"
       ]
    }
    overwrite => ["suser", "domain"]
    on_error => "suser_fail"
  }

  # Source User UDM Field
  if [suser] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{suser}"
        "is_pri_user_present" => "true"
      }
    }
  }
  else if [usrName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{usrName}"
        "is_pri_user_present" => "true"
      }
    }
  }

  # Grok source Data
  grok {
    match => {
      "kv_data" => [
        "src=%{DATA:src}(\\s+)(\\w+)="
        "src=%{DATA:src}(\\s+)"
        "src=%{DATA:src}"
      ]
    }
    overwrite => ["src"]
    on_error => "src_fail"
  }
  if [src] not in ["","unknown","n/a"] {
    grok {
      match => {
        "src" => "%{IP:src_test_ip}"
      }
      on_error => "src_not_ip"
    }
    if ![src_not_ip] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "src"
        }
      }
      mutate {
        replace => {
          "is_principal_present" => "true"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{src}"
          "is_principal_present" => "true"
        }
      }
    }
  }

  # Grok source Host Data
  if [shost] != "" {
    grok {
      match => {
        "kv_data" => [
          "shost=%{DATA:shost}(\\s+)(\\w+)="
          "shost=%{DATA:shost}(\\s+)"
          "shost=%{DATA:shost}"
        ]
      }
      overwrite => ["shost"]
      on_error => "shost_error"
    }
  }
  # Source Host UDM Field
  if [shost] != [src] and [shost] != "" {
    grok {
      match => {
        "shost" => "%{IP:shost_test_ip}"
      }
      on_error => "shost_not_ip"
    }
    if [shost_not_ip] {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{shost}"
          "is_principal_present" => "true"
        }
      }
    }
    else {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "shost"
        }
      }
      mutate {
        replace => {
          "is_principal_present" => "true"
        }
      }
    }
  }

  if [dst] != "" and [dst] != "unknown" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "dst"
      }
    }
    mutate {
      replace => {
        "is_target_present" => "true"
      }
    }
  }

  if [DistinguishedName] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.user.group_identifiers" => "DistinguishedName"
      }
    }
  }

  if [AffectedObject] not in ["","unknown","n/a"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.user_display_name" => "%{AffectedObject}"
      }
    }
  }

  grok {
    match => {
      "kv_data" => [
        "sntdom=%{DATA:source_domain}\\s+"
      ]
    }
    on_error => "source_domain_error"
    overwrite => ["source_domain"]
  }

  if [source_domain] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.domain.name" => "%{source_domain}"
      }
    }
  }

  grok {
    match => {
      "kv_data" => [
         "duser=CN\\\\=%{DATA:duser},"
         "duser=%{DATA:duser}@%{DATA:domain}(\\s+)(\\w+)="
         "duser=%{DATA:duser}@%{DATA:domain}(\\s+)"
         "duser=%{DATA:duser}@%{DATA:domain}"
         "duser=%{DATA:duser}(\\s+)(\\w+)="
         "duser=%{DATA:duser}(\\s+)"
         "duser=%{DATA:duser}"
       ]
    }
    overwrite => ["duser", "domain"]
    on_error => "duser_fail"
  }

  # target User UDM Field
  if [duser] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{duser}"
        "is_tar_user_present" => "true"
      }
    }
  }
  else if [UserName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{UserName}"
        "is_tar_user_present" => "true"
      }
    }
  }

  if [AttackedHost] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{AttackedHost}"
        "is_target_present" => "true"
      }
    }
  }

  if[AttackedHostIp] != "" and [dst] == "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "AttackedHostIp"
      }
    }
    mutate {
      replace => {
        "is_target_present" => "true"
      }
    }
  }

  if [attacking_host] != "" {
    mutate {
      replace => {
        "AttackingHost" => "%{attacking_host}"
      }
    }
  }

  if [AttackingHost] != "" and [AttackingHost] !~ "UNKNOWN" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{AttackingHost}"
        "is_principal_present" => "true"
        "event_type" => "SCAN_HOST"
      }
    }
  }

  if [AttackingHostIp] != "" and [src] == "" and [AttackingHostIp] != "unknown" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "AttackingHostIp"
      }
    }
    mutate {
      replace => {
        "is_principal_present" => "true"
      }
    }
  }

  if [UserSID] != "" and [UserSID] != "unknown" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.windows_sid" => "%{UserSID}"
      }
    }
  }

  if [breached_from_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{breached_from_host}"
        "is_principal_present" => "true"
        "event_type" => "SCAN_HOST"
      }
    }
  }

  if [Started] != "" {
    date {
      match => ["Started","RFC3339", "MMM dd HH:mm:ss"]
      target => "vulns.vulnerabilities.scan_start_time"
      rebase => true
      on_error => "start_time_error"
    }
  }

  if [Ended] != "" {
    date {
      match => ["Ended","RFC3339", "MMM dd HH:mm:ss"]
      target => "vulns.vulnerabilities.scan_end_time"
      rebase => true
      on_error => "end_time_error"
    }
  }

  grok {
    match => {
      "kv_data" => [
        "rt=(?P<rt_time>\\d{4}-\\d{2}-\\d{2} \\d{2}:\\d{2}:\\d{2}.\\d*)"
      ]
    }
    overwrite => ["rt_time"]
    on_error => "rt_error"
  }

  if [devTime] != "" {
    date {
      match => [devTime,"yyyy-MM-dd HH:mm:ss.SSS"]
    }
  }
  else if [rt_time] != "" {
    date {
      match => ["rt_time", "yyyy-MM-dd HH:mm:ss.SSS","yyyy-MM-dd HH:mm:ss"]
    }
  }
  if [vulns] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.extensions.vulns.vulnerabilities" => "vulns.vulnerabilities"
      }
    }
  }

  if [sec_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "sec_result"
      }
    }
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
    }
  }

 # Making it as Generic event as value for principal.hostname is not present which is must for events related to SCAN_* .
  if [event_type] == "" {
    if [is_principal_present] == "true" and [is_pri_user_present] == "true" and ([is_target_present] == "true" or [is_tar_user_present] == "true") {
      mutate {
        replace => {
          "event_type" => "USER_LOGIN"
          "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
        }
      }
    }
    else if [is_principal_present] == "true" and [is_target_present] == "true" {
      mutate {
        replace => {
          "event_type" => "NETWORK_CONNECTION"
        }
      }
    }
    else if [is_pri_user_present] == "true" {
      mutate {
        replace => {
          "event_type" => "USER_UNCATEGORIZED"
        }
      }
    }
    else if [is_principal_present] == "true" {
      mutate {
        replace => {
          "event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event_type" => "GENERIC_EVENT"
        }
      }
    }
  }

  # General Mappings.

  if [device_product] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_name" => "%{device_product}"
      }
    }
  }

  if [device_vendor] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.vendor_name" => "%{device_vendor}"
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
