# Product: Cynet 360 AutoXDR
# Category: AV and endpoint logs
# Supported Format: JSON / CEF
# Reference: N/A
# Last Updated: 2025-10-01
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "event" => ""
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "additional" => ""
      "sec_result" => ""
      "DbId" => ""
      "UserName" => ""
      "Timestamp" => ""
      "Action" => ""
      "Category" => ""
      "Info" => ""
      "RequesterIp" => ""
      "UserLevel" => ""
      "IsExists" => ""
      "CommandLine" => ""
      "RunningUser" => ""
      "Uniqueness" => ""
      "ModuleType" => ""
      "AlertType" => ""
      "AlertIP" => ""
      "AlertDomain" => ""
      "DomainId" => ""
      "AlertURL" => ""
      "SocketId" => ""
      "UserId" => ""
      "FileRisk" => ""
      "NetworkRisk" => ""
      "HostRisk" => ""
      "UserRisk" => ""
      "TotalRisk" => ""
      "ProductId" => ""
      "remediationStatus" => ""
      "remediationActionId" => ""
      "autoRemediationId" => ""
      "EpsActionStatus" => ""
      "Id" => ""
      "CloudId" => ""
      "Subject" => ""
      "Description" => ""
      "Recommendation" => ""
      "ScanGroupName" => ""
      "Severity" => ""
      "Status" => ""
      "StringIP" => ""
      "HostName" => ""
      "HostId" => ""
      "Sha256" => ""
      "Path" => ""
      "DateIn" => ""
      "LastSeen" => ""
      "DateChanged" => ""
      "Comment" => ""
      "OnCloud" => ""
      "OnSiem" => ""
      "AlertCategory" => ""
      "LastSeenUtc" => ""
      "AlertName" => ""
      "OSVersion" => ""
      "DesiredEPSPrevention" => ""
      "ActualEPSPrevention" => ""
      "RemediationStatus" => ""
      "Infectedfile" => ""
      "MalwareID" => ""
      "MalwareType" => ""
      "has_principal" => "false"
      "has_user" => "false"
      "has_target_user" => "false"
      "has_target_file" => "false"
      "filePath" => ""
      "confVer" => ""
      "clientId" => ""
      "scanGroupId" => ""
      "rtUtc" => ""
      "dtUtc" => ""
      "hostLS" => ""
      "osVer" => ""
      "epsVer" => ""
      "remedStat" => ""
      "pFileHash" => ""
      "pprUser" => ""
      "ppParams" => ""
      "pssdeep" => ""
      "pSign" => ""
      "pct" => ""
      "gpFileHash" => ""
      "gpprUser" => ""
      "gpParams" => ""
      "gpssdeep" => ""
      "gpSign" => ""
      "actRem" => ""
      "fname" => ""
      "dhost" => ""
      "sign" => ""
      "scanGroupName" => ""
      "parent_process" => ""
      "filehash_is_hash" => "false"
      "externalId" => ""
      "etwAlertId" => ""
      "sev" => ""
      "duser" => ""
      "cat" => ""
      "rt" => ""
      "src" => ""
      "dst" => ""
      "fileHash" => ""
      "prUser" => ""
      "pParams" => ""
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "json_failed"
  }
  if [json_failed] {
    grok {
      match => { "message" => "(?:<\\d+>)?CEF:0\\|Cynet\\|Cynet 360\\|%{DATA:cef_device_version}\\|%{INT:cef_signature_id}\\|%{DATA:cef_header}\\|%{INT:cef_severity}\\|(?P<cef_extension>.*)" }
      overwrite => ["cef_device_version", "cef_signature_id", "cef_header", "cef_severity", "cef_extension"]
      on_error => "grok_cef_failed"
    }
    if [grok_cef_failed] {
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }
    if [cef_header] != "" {
      mutate {
        replace => {
          "sec_result.summary" => "%{cef_header}"
        }
        on_error => "cef_header_empty"
      }
    }
  }
  mutate {
    gsub => ["cef_extension", "(\\\s+)([0-9a-zA-Z_.-]+?)=", "#$2="]
  }
  kv {
    source => "cef_extension"
    field_split => "#"
    value_split => "="
    on_error => "kv_cef_failed"
  }
  if [externalId] != "" {
    mutate {
      replace => {
        "externalId_label.key" => "externalId"
        "externalId_label.value.string_value" => "%{externalId}"
      }
      on_error => "externalId_empty"
    }
    if ![externalId_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "externalId_label"
        }
        on_error => "externalId_label_empty"
      }
    }
  }
  if [fname] != "" {
    mutate {
      replace => {
        "fname_label.key" => "fname"
        "fname_label.value.string_value" => "%{fname}"
      }
      on_error => "fname_empty"
    }
    if ![fname_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "fname_label"
        }
        on_error => "fname_label_empty"
      }
    }
  }
  if [sev] != "" {
    mutate {
      replace => {
        "sev_label.key" => "Original Severity"
        "sev_label.value.string_value" => "%{sev}"
      }
      on_error => "sev_empty"
    }
    if ![sev_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "sev_label"
        }
        on_error => "sev_label_empty"
      }
    }
    if [sev] == "Medium" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    } else if [sev] == "Low" {
      mutate {
        replace => {
          "security_result.severity" => "LOW"
        }
      }
    } else if [sev] == "High" {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
      }
    } else if [sev] == "Critical" {
      mutate {
        replace => {
          "security_result.severity" => "CRITICAL"
        }
      }
    }
  }

  if [duser] != "" {
    mutate {
      gsub => ["duser", "\\\\\\\\", "\\"]
    }
    grok {
      match => { "duser" => "(?P<domain>[^\\\\]+)\\\\(?P<user>.+)" }
      on_error => "duser_parse_failed"
    }
    if ![duser_parse_failed] {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.user.userid" => "%{user}"
          "has_target_user" => "true"
        }
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.target.administrative_domain" => "%{domain}"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.user.userid" => "%{duser}"
          "has_target_user" => "true"
        }
      }
    }
  }
  if [src] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "src"
        "event.idm.read_only_udm.principal.asset.ip" => "src"
      }
      on_error => "src_mapping_failed"
    }
    if ![src_mapping_failed] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [cat] != "" {
    mutate {
      merge => {
        "sec_result.category_details" => "cat"
      }
      on_error => "cat_empty"
    }
  }

  if [dhost] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{dhost}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{dhost}"
      }
      on_error => "dhost_mapping_failed"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [osVer] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.platform_version" => "%{osVer}"
      }
      on_error => "osVer_empty"
    }
  }
  if [gpParams] != "" {
    mutate {
      replace => {
        "gpParams_label.key" => "gpParams"
        "gpParams_label.value.string_value" => "%{gpParams}"
      }
      on_error => "gpParams_empty"
    }
    if ![gpParams_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "gpParams_label"
        }
        on_error => "gpParams_label_empty"
      }
    }
  }
  if [gpprUser] != "" {
    mutate {
      replace => {
        "gpprUser_label.key" => "gpprUser"
        "gpprUser_label.value.string_value" => "%{gpprUser}"
      }
      on_error => "gpprUser_empty"
    }
    if ![gpprUser_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "gpprUser_label"
        }
        on_error => "gpprUser_label_empty"
      }
    }
  }
  if [gpSign] != "" {
    mutate {
      replace => {
        "gpSign_label.key" => "gpSign"
        "gpSign_label.value.string_value" => "%{gpSign}"
      }
      on_error => "gpSign_empty"
    }
    if ![gpSign_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "gpSign_label"
        }
        on_error => "gpSign_label_empty"
      }
    }
  }
  if [rtUtc] != "" {
    date {
      match => ["rtUtc", "MMM dd yyyy HH:mm:ss.SSS"]
      target => "event.idm.read_only_udm.metadata.collected_timestamp"
      on_error => "rtUtc_empty"
    }
  }
  if [dtUtc] != "" {
    date {
      match => ["dtUtc", "MMM dd yyyy HH:mm:ss.SSS"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "dtUtc_empty"
    }
  }
  else if [rt] != "" {
     date {
      match => ["rt", "MMM dd yyyy HH:mm:ss", "yyyy/MM/dd HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "rt_empty"
    }
  }
  if [hostLS] != "" {
    mutate {
      replace => {
        "hostLS_label.key" => "hostLS"
        "hostLS_label.value.string_value" => "%{hostLS}"
      }
      on_error => "hostLS_empty"
    }
    if ![hostLS_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "hostLS_label"
        }
        on_error => "hostLS_label_empty"
      }
    }
  }
  if [epsVer] != "" {
    mutate {
      replace => {
        "epsVer_label.key" => "epsVer"
        "epsVer_label.value.string_value" => "%{epsVer}"
      }
      on_error => "epsVer_empty"
    }
    if ![epsVer_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "epsVer_label"
        }
        on_error => "epsVer_label_empty"
      }
    }
  }
  if [confVer] != "" {
    mutate {
      replace => {
        "confVer_label.key" => "confVer"
        "confVer_label.value.string_value" => "%{confVer}"
      }
      on_error => "confVer_empty"
    }
    if ![confVer_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "confVer_label"
        }
        on_error => "confVer_label_empty"
      }
    }
  }
  if [remedStat] != "" {
    mutate {
      replace => {
        "sec_result.summary" => "%{remedStat}"
      }
      on_error => "remedStat_empty"
    }
  }
  if [actRem] != "" {
    mutate {
      replace => {
        "sec_result.action_details" => "%{actRem}"
      }
      on_error => "actRem_empty"
    }
  }
  if [scanGroupId] != "" {
    mutate {
      replace => {
        "scanGroupId_label.key" => "scanGroupId"
        "scanGroupId_label.value.string_value" => "%{scanGroupId}"
      }
      on_error => "scanGroupId_empty"
    }
    if ![scanGroupId_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "scanGroupId_label"
        }
        on_error => "scanGroupId_label_empty"
      }
    }
  }
  if [scanGroupName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.group.group_display_name" => "%{scanGroupName}"
      }
      on_error => "scanGroupName_empty"
    }
  }
  if [sign] != "" {
    mutate {
      replace => {
        "sign_label.key" => "sign"
        "sign_label.value.string_value" => "%{sign}"
      }
      on_error => "sign_empty"
    }
    if ![sign_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "sign_label"
        }
        on_error => "sign_label_empty"
      }
    }
  }
  if [pFileHash] != "" {
    mutate {
      lowercase => ["pFileHash"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.file.sha256" => "%{pFileHash}"
      }
      on_error => "pFileHash_empty"
    }
  }
  if [prUser] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{prUser}"
      }
      on_error => "prUser_empty"
    }
  }
  if [pprUser] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.administrative_domain" => "%{pprUser}"
      }
      on_error => "pprUser_empty"
    }
  }
  if [ppParams] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.file.full_path" => "%{ppParams}"
      }
      on_error => "ppParams_empty"
    }
  }
  if [pssdeep] != "" {
    mutate {
      replace => {
        "pssdeep_label.value.string_value" => "%{pssdeep}"
        "pssdeep_label.key" => "pssdeep"
      }
      on_error => "pssdeep_empty"
    }
    if ![pssdeep_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "pssdeep_label"
        }
        on_error => "pssdeep_label_empty"
      }
    }
  }
  if [pSign] != "" {
    mutate {
      replace => {
          "pSign_label.key" => "pSign"
        "pSign_label.value.string_value" => "%{pSign}"
      }
      on_error => "pSign_empty"
    }
    if ![pSign_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "pSign_label"
        }
        on_error => "pSign_label_empty"
      }
    }
  }
  if [pct] != "" {
    mutate {
      replace => {
        "pct_label.key" => "pct"
        "pct_label.value.string_value" => "%{pct}"
      }
      on_error => "pct_empty"
    }
    if ![pct_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "pct_label"
        }
        on_error => "pct_label_empty"
      }
    }
  }
  if [gpFileHash] != "" {
    mutate {
      lowercase => ["gpFileHash"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.parent_process.file.sha256" => "%{gpFileHash}"
      }
      on_error => "gpFileHash_empty"
    }
  }
  if [gpssdeep] != "" {
    mutate {
      replace => {
        "gpssdeep_label.key" => "gpssdeep"
        "gpssdeep_label.value.string_value" => "%{gpssdeep}"
      }
      on_error => "gpssdeep_empty"
    }
    if ![gpssdeep_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "gpssdeep_label"
        }
        on_error => "gpssdeep_label_empty"
      }
    }
  }
  if [clientId] != "" {
    mutate {
      replace => {
        "clientId_label.key" => "clientId"
        "clientId_label.value.string_value" => "%{clientId}"
      }
      on_error => "clientId_empty"
    }
    if ![clientId_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "clientId_label"
        }
        on_error => "clientId_label_empty"
      }
    }
  }
  if [pParams] != "" {
    mutate {
      replace => {
        "pParams_label.key" => "pParams"
        "pParams_label.value.string_value" => "%{pParams}"
      }
      on_error => "pParamslabel_empty"
    }
    if ![pParamslabel_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "pParams_label"
        }
        on_error => "pParams_empty_label"
      }
    }
  }
  if [etwAlertId] != "" {
    mutate {
      replace => {
        "etwAlertId_label.key" => "etwAlertId"
        "etwAlertId_label.value.string_value" => "%{etwAlertId}"
      }
      on_error => "etwAlertId_empty"
    }
    if ![etwAlertId_empty] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "etwAlertId_label"
        }
        on_error => "etwAlertId_label_empty"
      }
    }
  }
  if [dst] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "dst"
        "event.idm.read_only_udm.target.asset.ip" => "dst"
      }
      on_error => "dst_empty"
    }
    if ![dst_empty] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [filePath] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{filePath}"
      }
      on_error => "filePath_empty"
    }
    if ![filePath_empty] {
      mutate {
        replace => {
          "has_target_file" => "true"
        }
      }
    }
  }
  if [fileHash] != "" {
    mutate {
      lowercase => ["fileHash"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.sha256" => "%{fileHash}"
      }
      on_error => "fileHash_empty"
    }
    if ![fileHash_empty] {
      mutate {
        replace => {
          "has_target_file" => "true"
        }
      }
    }
  }
  if [UserName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{UserName}"
        "has_target_user" => "true"
      }
      on_error => "principal_user_userid_empty"
    }
  }

  if [Info] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{Info}"
      }
      on_error => "metadata_description_empty"
    }
  }

  if [RequesterIp] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "RequesterIp"
        "event.idm.read_only_udm.principal.asset.ip" => "RequesterIp"
      }
      on_error => "principal_ip_empty"
    }
    if ![principal_ip_empty] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [Subject] != "" {
    mutate {
      replace => {
        "sec_result.summary" => "%{Subject}"
      }
      on_error => "security_result_summary_empty"
    }
  }

  if [Description] != "" {
    mutate {
      gsub => ["Description","\\\r\\\n","#"]
    }
    mutate {
      gsub => ["Description","OS Version","OSVersion"]
    }
    mutate {
      gsub => ["Description","Alert Name","AlertName"]
    }
    mutate {
      gsub => ["Description","Remediation Status","RemediationStatus"]
    }
    mutate {
      gsub => ["Description","Infected file","Infectedfile"]
    }
    mutate {
      gsub => ["Description","Malware Type","MalwareType"]
    }
    mutate {
      gsub => ["Description","Malware ID","MalwareID"]
    }
    mutate {
      gsub => ["Description","Desired EPS Prevention","DesiredEPSPrevention"]
    }
    mutate {
      gsub => ["Description","Actual EPS Prevention","ActualEPSPrevention"]
    }
    kv {
      source => "Description"
      field_split => "#"
      value_split => ":"
      on_error => "description_empty"
    }
  }

  if [Sha256] != "" {
    mutate {
      replace => {
        "sha256_label.value" => "%{Sha256}"
        "sha256_label.key" => "Sha256"
      }
      on_error => "sha256_empty"
    }
    if ![sha256_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "sha256_label"
        }
        on_error => "sha256_label_empty"
      }
    }
  }

  if [Path] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{Path}"
        "has_target_file" => "true"
      }
      on_error => "target_file_full_path_empty"
    }
  }

  if [StringIP] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "StringIP"
        "principal.asset.ip" => "StringIP"
      }
      on_error => "StringIP_empty"
    }
    if ![StringIP_empty] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [HostName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{HostName}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{HostName}"
        "has_principal" => "true"
      }
      on_error => "principal_asset_hostname_empty"
    }
  }

  if [Recommendation] != "" {
    mutate {
      replace => {
        "Recommendation_label.value" => "%{Recommendation}"
        "Recommendation_label.key" => "Recommendation"
      }
      on_error => "Recommendation_empty"
    }
    if ![Recommendation_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "Recommendation_label"
        }
        on_error => "Recommendation_label_empty"
      }
    }
  }

  if [UserLevel] != "" {
    mutate {
      replace => {
        "UserLevel_label.value" => "%{UserLevel}"
        "UserLevel_label.key" => "UserLevel"
      }
      on_error => "UserLevel_empty"
    }
    if ![UserLevel_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "UserLevel_label"
        }
        on_error => "UserLevel_label_empty"
      }
    }
  }

  if [AlertName] != "" {
    mutate {
      replace => {
        "AlertName_label.value" => "%{AlertName}"
        "AlertName_label.key" => "AlertName"
      }
      on_error => "AlertName_empty"
    }
    if ![AlertName_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "AlertName_label"
        }
        on_error => "AlertName_label_empty"
      }
    }
  }

  if [MalwareID] != "" {
    mutate {
      replace => {
        "MalwareID_label.value" => "%{MalwareID}"
        "MalwareID_label.key" => "MalwareID"
      }
      on_error => "MalwareID_empty"
    }
    if ![MalwareID_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "MalwareID_label"
        }
        on_error => "MalwareID_label_empty"
      }
    }
  }

  if [Action] != "" {
    mutate {
      convert => {
        "Action" => "string"
      }
      on_error => "Action_conversion_error"
    }
    mutate {
      replace => {
        "sec_result.action_details" => "%{Action}"
      }
      on_error => "Action_empty"
    }
  }

  if [Category] != "" {
    mutate {
      convert => {
        "Category" => "string"
      }
      on_error => "Category_conversion_error"
    }
    mutate {
      merge => {
        "sec_result.category_details" => "Category"
      }
      on_error => "Category_empty"
    }
  }

  if [DbId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{DbId}"
      }
      on_error => "DbId_empty"
    }
  }

  if [MalwareType] != "" {
    mutate {
      replace => {
        "MalwareType_label.value" => "%{MalwareType}"
        "MalwareType_label.key" => "MalwareType"
      }
      on_error => "MalwareType_empty"
    }
    if ![MalwareType_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "MalwareType_label"
        }
        on_error => "MalwareType_label_empty"
      }
    }
  }

  if [ActualEPSPrevention] != "" {
    mutate {
      replace => {
        "ActualEPSPrevention_label.value" => "%{ActualEPSPrevention}"
        "ActualEPSPrevention_label.key" => "ActualEPSPrevention"
      }
      on_error => "ActualEPSPrevention_empty"
    }
    if ![ActualEPSPrevention_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "ActualEPSPrevention_label"
        }
        on_error => "ActualEPSPrevention_label_empty"
      }
    }
  }

  if [DesiredEPSPrevention] != "" {
    mutate {
      replace => {
        "DesiredEPSPrevention_label.value" => "%{DesiredEPSPrevention}"
        "DesiredEPSPrevention_label.key" => "DesiredEPSPrevention"
      }
      on_error => "DesiredEPSPrevention_empty"
    }
    if ![DesiredEPSPrevention_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "DesiredEPSPrevention_label"
        }
        on_error => "DesiredEPSPrevention_label_empty"
      }
    }
  }

  if [Infectedfile] != "" {
    mutate {
      replace => {
        "Infectedfile_label.value" => "%{Infectedfile}"
        "Infectedfile_label.key" => "Infectedfile"
      }
      on_error => "Infectedfile_empty"
    }
    if ![Infectedfile_empty] {
      mutate {
        merge => {
          "sec_result.detection_fields" => "Infectedfile_label"
        }
        on_error => "Infectedfile_label_empty"
      }
    }
  }

  if [Uniqueness] != "" {
    mutate {
      replace => {
        "Uniqueness_label.value.string_value" => "%{Uniqueness}"
        "Uniqueness_label.key" => "Uniqueness"
      }
      on_error => "Uniqueness_empty"
    }
    if ![Uniqueness_empty] {
      mutate {
        merge => {
          "additional.fields" => "Uniqueness_label"
        }
        on_error => "Uniqueness_label_empty"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "Cynet 360 AutoXDR"
      "event.idm.read_only_udm.metadata.vendor_name" => "Cynet 360 AutoXDR"
    }
  }
  if [Action] == "111" and [has_principal] == "true" and [has_target_user] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }
  else if [has_principal] == "true" and [has_target_file] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "FILE_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else if [has_user] == "true" or [has_target_user] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [sec_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "sec_result"
      }
      on_error => "security_result_empty"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
