# Product: YUBICO_OTP
# Category: Audit event
# Supported Format: SYSLOG, JSON, CSV
# Reference: https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html-single/security_guide/index
# Last Updated: 2023-02-20
# Copyright 2023 Chronicle LLC


filter {
  mutate {
    replace => {
      "day" => ""
      "description" => ""
      "etime" => ""
      "sdomain" => ""
      "hostname" => ""
      "hours" => ""
      "log_type" => ""
      "minutes" => ""
      "month" => ""
      "observer" => ""
      "product" => ""
      "product_event" => ""
      "seconds" => ""
      "security_result" => ""
      "severity" => ""
      "src_ip" => ""
      "summary" => ""
      "suser" => ""
      "token1" => ""
      "token2" => ""
      "token3" => ""
      "token4" => ""
      "tokens" => ""
      "tokentest" => ""
      "vendor" => ""
      "year" => ""
      "csv.column13" => ""
      "csv.column11" => ""
      "csv.column2" => ""
      "csv.column3" => ""
      "csv.column5" => ""
      "csv.column7" => ""
      "csv.column8" => ""
      "csv.column14" => ""
      "csv.column6" => ""
      "csv.column10" => ""
      "csv.column12" => ""
      "cwd" => ""
      "test_ip" => ""
      "ppid" => ""
      "pid" => ""
      "auid" => ""
      "uid" => ""
      "gid" => ""
      "euid" => ""
      "suid" => ""
      "fsuid" => ""
      "egid" => ""
      "fsgid" => ""
      "sgid" => ""
      "comm" => ""
      "exe" => ""
      "subj" => ""
      "key" => ""
      "arch" => ""
      "type" => ""
      "name" => ""
      "ouid" => ""
      "ogid" => ""
      "cap_fp" => ""
      "cap_fi" => ""
      "cap_fe" => ""
      "cap_fver" => ""
      "inode" => ""
      "objtype" => ""
      "mode" => ""
      "int_host" => ""
      "audit_type" => ""
      "node" => ""
      "proctitle" => ""
      "user" => ""
      "user_id" => ""
      "domain_name" => ""
      "status" => ""
      "server" => ""
      "intermediary" => ""
      "event_type" => "GENERIC_EVENT"
      "has_principal_machine_field" => "false"
      "has_principal_user_id" => "false"
    }
  }
  #Handle JSON
  json {
      source => "message"
      array_function => "split_columns"
      on_error => "json_error"
  }
  # GSub
  mutate {
    gsub => [
      "msg", "\"", "", #"
    ]
  }
  mutate {
    gsub => [
      "msg", "\\s'", "",
    ]
  }
  mutate {
    gsub => [
      "msg", "'", "",
    ]
  }
  # Handle CSV
  csv {
    source => "msg"
    target => "csv"
    separator => ","
    on_error => "not_csv"
  }
  if [not_csv] {
    grok {
      match => {
        "message" => [
          "<%{INT}>%{SYSLOGTIMESTAMP}\\s+%{DATA:int_host}\\s+%{DATA:audit_type}:\\s+%{TIMESTAMP_ISO8601}\\s+%{DATA}\\s+%{GREEDYDATA:description}",
          "<%{INT}>%{SYSLOGTIMESTAMP}\\s+%{DATA:int_host}\\s+%{DATA:audit_type}\\s+%{DATA:severity}\\s+%{DATA:product_event}\\|%{DATA:vendor}\\|%{DATA}\\|%{DATA}\\|%{DATA}\\|%{DATA:summary}\\|%{DATA}\\|%{GREEDYDATA:kv_data}"
          "<%{INT}>%{SYSLOGTIMESTAMP:ts}\\s+%{NOTSPACE:int_host}\\s+%{DATA:audit_type}: %{GREEDYDATA:kv_data}"
          "<%{INT}>%{SYSLOGTIMESTAMP}\\s+%{DATA:int_host}\\s+%{DATA}\\s+%{GREEDYDATA:summary}"
        ]
      }
      overwrite => ["int_host","audit_type","description","severity","summary","product_event","vendor"]
      on_error => "grok_fail"
    }

    mutate {
      gsub => ["kv_data","([a-zA-Z0-9]+)=","#$1="]
    }

    mutate {
      gsub => ["kv_data",":  #",": #"]
    }
    mutate {
      gsub => ["kv_data",": #"," #"]
    }
    kv {
      source => "kv_data"
      field_split => " #"
      value_split => "="
      on_error => "not_kv"
    }
  }
  if [int_host] != "" {
    grok {
      match => {
        "int_host" => [
          "%{IP:int_ip}"
        ]
      }
      on_error => "not_intermediary_ip"
    }

    if ![not_intermediary_ip] {
      mutate {
        merge => {
          "intermediary.ip" => "int_host"
        }
      }
    }
    else {
      mutate {
        replace => {
          "intermediary.hostname" => "%{int_host}"
        }
      }
    }
  }

  if [csv][column3] != "" {
    mutate {
      replace => {
        "product_event" => "%{csv.column3}"
      }
    }
  }
  if [csv][column5] != "" {
    mutate {
      replace => {
        "tokens" => "%{csv.column5}"
      }
    }
  }
  if [csv][column7] != "" {
    mutate {
      replace => {
        "suser" => "%{csv.column7}"
      }
    }
  }
  if [csv][column8] != "" {
    mutate {
      replace => {
        "sdomain" => "%{csv.column8}"
      }
    }
  }
  # check Order
  if [csv][column13] =~ "conf=" {
    mutate {
      replace => {
        "description" => "%{csv.column12}%{csv.column13}%{csv.column14}"
        "hostname" => "%{csv.column15}"
        "src_ip" => "%{csv.column16}"
        "severity" => "%{csv.column17}"
      }
    }
  }
  else if [csv][column11] =~ "realm:" {
    mutate {
      replace => {
        "description" => "%{csv.column11}%{csv.column12}"
        "hostname" => "%{csv.column13}"
        "severity" => "%{csv.column15}"
      }
    }
    if [csv][column14] != "" {
      mutate {
        replace => {
          "src_ip" => "%{csv.column14}"
        }
      }
    }
  }
  else if [csv][column11] =~ "UserNotFound" {
    mutate {
      replace => {
        "description" => "%{csv.column11}"
        "hostname" => "%{csv.column13}"
        "severity" => "%{csv.column15}"
      }
    }
    if [csv][column14] != "" {
      mutate {
        replace => {
          "src_ip" => "%{csv.column14}"
        }
      }
    }
  }
  else if [csv][column11] =~ "OperationalError" {
    mutate {
      replace => {
        "product_event" => "OperationalError"
        "src_ip" => "%{csv.column15}"
        "severity" => "%{csv.column16}"
      }
    }
    if [csv][column14] != "" {
      mutate {
        replace => {
          "src_ip" => "%{csv.column14}"
        }
      }
    }
    if [csv][column12] != "" {
      mutate {
        replace => {
          "description" => "%{csv.column12}"
        }
      }
    }
  }
  else if [csv][column11] =~ "TimeoutError" {
    mutate {
      replace => {
        "product_event" => "TimeoutError"
        "description" => "%{csv.column11}%{csv.column12}%{csv.column13}%{csv.column14}"
        "hostname" => "%{csv.column15}"
        "src_ip" => "%{csv.column16}"
        "severity" => "%{csv.column17}"
      }
    }
  }
  # Replace Data
  else if [csv][column14] != "" {
    mutate {
      replace => {
        "src_ip" => "%{csv.column13}"
        "severity" => "%{csv.column14}"
      }
    }
    if [csv][column12] != "" {
      mutate {
        replace => {
          "hostname" => "%{csv.column12}"
        }
      }
    }
    if [csv][column6] != "" {
      mutate {
        replace => {
          "summary" => "%{csv.column6}"
        }
      }
    }
    if [csv][column10] != "" {
      mutate {
        replace => {
          "description" => "%{csv.column10}"
        }
      }
    }
  }
  # Find Username
  if [csv][column11] =~ "UserNotFound" {
    grok {
      match => {
        "csv.column11" => [
          "u\\\\%{GREEDYDATA:suser}\\\\"
        ]
      }
      overwrite => ["suser"]
      on_error => "grok02__error"
    }
  }
  if [type] != "" {
    mutate {
      replace => {
        "product_event" => "%{type}"
      }
    }
  }
  # Uppercase Product Event
  if [product_event] != "" {
    mutate {
      uppercase => ["product_event"]
    }
  }

  if [csv][column2] != "" {
    mutate {
      replace => {
        "etime" => "%{csv.column2}"
      }
    }
  }
  # Grok Time
  if [etime] != "" {
    grok {
      match => {
          "etime" => [
            "%{INT:year}-%{INT:month}-%{INT:day}\\s*%{INT:hours}:%{INT:minutes}:%{INT:seconds}.%{INT}"
          ]
      }
      overwrite => ["year", "month", "day", "hours", "minutes", "seconds"]
      on_error => "grok00__error"
    }
  }
  # Grok Tokens
  if [tokens] != "" {
    grok {
      match => {
        "tokens" => [
          "%{DATA:token1}\\s+%%{DATA:token2}\\s+%{DATA:token3}\\s+{GREEDYDATA:token4}"
          "%{DATA:token1}\\s+%%{DATA:token2}\\s+{GREEDYDATA:token3}"
          "%{DATA:token1}\\s+%{GREEDYDATA:token2}"
          "%{GREEDYDATA:token1}"
        ]
      }
      overwrite => ["token1", "token2", "token3", "token4"]
      on_error => "grok01__error"
    }
  }
  # Set Time
  if [year] != "" {
    mutate {
      replace => {
          "mydate" => "%{month} %{day} %{year} %{hours}:%{minutes}:%{seconds}"
      }
      on_error => "no_year"
    }
    date {
      match => [
          "mydate",
          "ISO8601",
          "UNIX",
          "UNIX_MS",
          "TAI64N",
          "MMM dd yyyy HH:mm:ss",
          "MMM d yyyy HH:mm:ss",
          "MM dd yyyy HH:mm:ss",
          "MM d yyyy HH:mm:ss",
          "M dd yyyy HH:mm:ss",
          "M d yyyy HH:mm:ss"
      ]
    }
  }
  else if [month] != "" {
    mutate {
    replace => {
        "mydate" => "%{month} %{day} %{hours}:%{minutes}:%{seconds}" 
    }
    on_error => "no_date"
  }
  date {
      match => [
        "mydate",
        "ISO8601",
        "UNIX",
        "UNIX_MS",
        "TAI64N",
        "MMM dd HH:mm:ss",
        "MMM d HH:mm:ss",
        "MM dd HH:mm:ss",
        "MM d HH:mm:ss",
        "M dd yyyy HH:mm:ss",
        "M d yyyy HH:mm:ss"
      ]
      rebase => true
    }
  }
  # Default Event Data
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name"  =>  "%{product}"
    }
    on_error => "product_not_set"
  }

  if [vendor] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.vendor_name"  =>  "%{vendor}"
      }
    }
  }

  # Severity Level
  if [severity] =~ "(?i)(low|Unknown|info)" {
    mutate {
      replace => {
        "security_result.severity" => "LOW"
      }
    }
  }
  # token1 Fields
  if [token1] != "" {
    mutate {
      replace => {
        "additional_token1.key" => "TOKEN1"
        "additional_token1.value.string_value" => "%{token1}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_token1"
      }
    }
  }
  # token2 Fields
  if [token2] != "" {
    mutate {
      replace => {
        "additional_token2.key" => "TOKEN2"
        "additional_token2.value.string_value" => "%{token2}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_token2"
      }
    }
  }
  # token3 Fields
  if [token3] != "" {
    mutate {
      replace => {
        "additional_token3.key" => "TOKEN3"
        "additional_token3.value.string_value" => "%{token3}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_token3"
      }
    }
  }
  # token4 Fields
  if [token4] != "" {
    mutate {
      replace => {
        "additional_token4.key" => "TOKEN4"
        "additional_token4.value.string_value" => "%{token4}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_token4"
      }
    }
  }
  # Source User UDM Field
  if [suser] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{suser}"
      }
    }
  }
  else if [user] != "" {
    grok {
      match => {
        "user" => [
          "%{DATA:user_id}@%{GREEDYDATA:domain_name}"
        ]
      }
      overwrite => ["user_id","domain_name"]
      on_error => "user_not_present"
    }
    if ![user_not_present] {
      mutate {
        replace => {
          "principal.user.userid" => "%{user_id}"
          "has_principal_user_id" => "true"
        }
      }
      mutate {
        replace => {
          "principal.domain.name" => "%{domain_name}"
        }
      }
      if [user] =~ "(^.+@.+$)" {
        mutate {
          merge => {
            "principal.user.email_addresses" => "user"
          }
        }
      }
      else {
        mutate {
          replace => {
            "principal.user.user_display_name" => "%{user}"
          }
        }
      }
    }
  }
  # Source Domain UDM Field
  if [suser] != "" {
    mutate {
      replace => {
        "principal.administrative_domain" => "%{sdomain}"
      }
    }
  }
  # Hostname UDM Field
  if [hostname] != "" {
    mutate {
      replace => {
        "target.hostname"  => "%{hostname}"
      }
    }
  }
  else if [server] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{server}"
      }
    }
  }
  # Source IP UDM Field
  if [src_ip] != "" {
    grok {
      match => {
        "srcip" => [
          "%{IP:src_ip}"
        ]
      }
      on_error => "not_ip"
    }
    if ![not_ip] {
      mutate {
        merge => {
          "target.ip"  => "src_ip"
        }
      }
    }
    else {
      mutate {
        replace => {
          "target.hostname" => "%{src_ip}"
        }
      }
    }
  }
  # Observer Data
  if [observer] != "" {
    grok {
      match => {
        "observer" => "%{IP:test_ip}"
      }
      overwrite => ["test_ip"]
      on_error => "not_ip"
    }
    if [not_ip] {
      mutate {
        replace => {
          "event.idm.read_only_udm.observer.hostname" => "%{observer}"
        }
      }
    }
    else {
      mutate {
        merge => {
          "event.idm.read_only_udm.observer.ip" => "observer"
        }
      }
    }
  }

  if [node] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{node}"
        "has_principal_machine_field" => "true"
      }
    }
  }

  if [cwd] != "" {
    mutate {
      replace => {
        "principal.process.file.full_path" => "%{cwd}"
      }
    }
  }

  #principal process
  if [ppid] != "" {
    mutate {
      replace => {
        "principal.process.parent_process.pid" => "%{ppid}"
      }
    }
  }

  if [pid] != "" {
    mutate {
      replace => {
        "principal.process.pid" => "%{pid}"
      }
    }
  }

  if [uid] != "" {
    mutate {
      replace => {
        "uid_label.key" => "uid"
        "uid_label.value" => "%{uid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "uid_label"
      }
    }
  }

  if [gid] != "" {
    mutate {
      replace => {
        "gid_label.key" => "gid"
        "gid_label.value" => "%{gid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "gid_label"
      }
    }
  }

  if [euid] != "" {
    mutate {
      replace => {
        "euid_label.key" => "euid"
        "euid_label.value" => "%{euid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "euid_label"
      }
    }
  }

  if [suid] != "" {
    mutate {
      replace => {
        "suid_label.key" => "suid"
        "suid_label.value" => "%{suid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "suid_label"
      }
    }
  }

  if [fsuid] != "" {
    mutate {
      replace => {
        "fsuid_label.key" => "fsuid"
        "fsuid_label.value" => "%{fsuid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "fsuid_label"
      }
    }
  }

  if [egid] != "" {
    mutate {
      replace => {
        "egid_label.key" => "egid"
        "egid_label.value" => "%{egid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "egid_label"
      }
    }
  }

  if [sgid] != "" {
    mutate {
      replace => {
        "sgid_label.key" => "sgid"
        "sgid_label.value" => "%{sgid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "sgid_label"
      }
    }
  }

  if [fsgid] != "" {
    mutate {
      replace => {
        "fsgid_label.key" => "fsgid"
        "fsgid_label.value" => "%{fsgid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "fsgid_label"
      }
    }
  }

  if [comm] != "" {
    mutate {
      replace => {
        "comm_label.key" => "comm"
        "comm_label.value" => "%{comm}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "comm_label"
      }
    }
  }

  if [subj] != "" {
    mutate {
      replace => {
        "subj_label.key" => "subj"
        "subj_label.value" => "%{subj}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "subj_label"
      }
    }
  }

  if [key] != "" {
    mutate {
      replace => {
        "key_label.key" => "key"
        "key_label.value" => "%{key}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "key_label"
      }
    }
  }


  if [arch] != "" {
    mutate {
      replace => {
        "arch_label.key" => "arch"
        "arch_label.value" => "%{arch}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "arch_label"
      }
    }
  }

  if [name] != "" {
    mutate {
      replace => {
        "name_label.key" => "name"
        "name_label.value" => "%{name}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "name_label"
      }
    }
  }

  if [ouid] != "" {
    mutate {
      replace => {
        "ouid_label.key" => "ouid"
        "ouid_label.value" => "%{ouid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "ouid_label"
      }
    }
  }

  if [ogid] != "" {
    mutate {
      replace => {
        "ogid_label.key" => "ogid"
        "ogid_label.value" => "%{ogid}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "ogid_label"
      }
    }
  }

  if [inode] != "" {
    mutate {
      replace => {
        "inode_label.key" => "inode"
        "inode_label.value" => "%{inode}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "inode_label"
      }
    }
  }

  if [cap_fp] != "" {
    mutate {
      replace => {
        "cap_fp_label.key" => "cap_fp"
        "cap_fp_label.value" => "%{cap_fp}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "cap_fp_label"
      }
    }
  }

  if [cap_fi] != "" {
    mutate {
      replace => {
        "cap_fi_label.key" => "cap_fi"
        "cap_fi_label.value" => "%{cap_fi}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "cap_fi_label"
      }
    }
  }

  if [mode] != "" {
    mutate {
      replace => {
        "mode_label.key" => "mode"
        "mode_label.value" => "%{mode}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "mode_label"
      }
    }
  }

  if [cap_fe] != "" {
    mutate {
      replace => {
        "cap_fe_label.key" => "cap_fe"
        "cap_fe_label.value" => "%{cap_fe}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "cap_fe_label"
      }
    }
  }

  if [proctitle] != "" {
    mutate {
      replace => {
        "proctitle_label.key" => "proctitle"
        "proctitle_label.value" => "%{proctitle}"
      }
    }
    mutate {
      merge => {
        "principal.resource.attribute.labels" => "proctitle_label"
      }
    }
  }


  if [exe] != "" {
    mutate {
      replace => {
        "principal.process.file.full_path" => "%{exe}"
      }
    }
  }
  if [auid] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{auid}"
        "has_principal_user_id" => "true"
      }
    }
  }

  # Event Action
  if [description] =~ "(?i)(success|logged in)" or [status] =~ "(?i)(GRANTED)" {
    mutate {
      replace => {
        "event_action" => "ALLOW"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "event_action"
      }
    }
  }
  else if [description] =~ "wrong" {
    mutate {
      replace => {
        "event_action" => "BLOCK"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "event_action"
      }
    }
  }
  # Security Summary
  if [summary] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{summary}"
      }
    }
  }
  # Merge Security Results
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description"  =>  "%{description}"
      }
    }
  }
  # UDM Events
  if [description] =~ "authenticated" or [description] =~ "wrong" or [description] =~ "logged in" {
    mutate {
      replace => {
          "event_type"  => "USER_LOGIN"
          "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
    if [token1] != "" or [token2] != "" {
      mutate {
        replace => {
          "auth_mechanism" => "OTP"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.extensions.auth.mechanism" => "auth_mechanism"
        }
      }
    }
  }
  else if ([audit_type] =~ "(?i)audi" or [product_event] =~ "(?i)Audit") and [has_principal_machine_field] == "true" and [has_principal_user_id] == "true" {
    mutate {
      replace => {
        "event_type"  => "SYSTEM_AUDIT_LOG_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal_machine_field] == "true" {
    mutate {
      replace => {
        "event_type"  => "STATUS_UPDATE"
      }
    }
  }
  else if [has_principal_user_id] == "true" {
    mutate {
      replace => {
        "event_type"  => "USER_UNCATEGORIZED"
      }
    }
  }

 # intermediary
  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
    }
  }

  if [product_event] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type"  =>  "%{product_event}"
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      }
    }
  }

  mutate {
    rename => {
      "target" => "event.idm.read_only_udm.target"
      "principal" => "event.idm.read_only_udm.principal"
    }
  }
  # Generate Event
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
