# Product: CEQUENCE_BOT_DEFENSE
# Category: Log Aggregator
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2025-08-26
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "country" => ""
      "referer" => ""
      "method" => ""
      "sessionid" => ""
      "uri" => ""
      "host" => ""
      "action" => ""
      "client_ip" => ""
      "user_agent" => ""
      "timestamp" => ""
      "policy.id" => ""
      "policy.name" => ""
      "policy.type" => ""
      "policy.version" => ""
      "metadata" => ""
      "principal" => ""
      "network" => ""
      "target" => ""
      "additional" => ""
      "security_result" => ""
      "principal_present" => "false"
      "target_present" => "false"
      "http_present" => "false"
      "status_code" => ""
      "server_ip" => ""
      "confidence" => ""
      "mitigation_action" => ""
      "city" => ""
      "x-b3-sampled" => ""
      "x-envoy-attempt-count" => ""
      "x-forwarded-host" => ""
      "x-forwarded-proto" => ""
      "access-control-max-age" => ""
      "x-forwarded-client-cert" => ""
      "rule_id" => ""
      "weight" => ""
      "hash_component" => ""
      "experimental" => ""
      "sec_action" => ""
      "username" => ""
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [not_json] {
    drop {
      tag => "TAG_UNSUPPORTED"
    }
  }
  if [host] not in ["","-"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{host}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{host}"
        "principal_present" => "true"
      }
      on_error => "invalid_host"
    }
  }
  if [username] not in ["","-"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{username}"
      }
      on_error => "invalid_username"
    }
  }

  if [country] not in ["","-"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.country_or_region" => "%{country}"
      }
      on_error => "invalid_country"
    }
  }
  if [city] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.city" => "%{city}"
      }
      on_error => "invalid_city"
    }
  }
  if [status_code] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.response_code" => "%{status_code}"
      }
      on_error => "invalid_status_code"
    }
  }
  for ruleinfo in rule_info {
    mutate {
      replace => {
        "sec_res" => ""
        "weight_label" => ""
        "hash_component_label" => ""
        "experimental_label" => ""
      }
    }
    mutate {
      replace => {
        "rule_id" => "%{ruleinfo.rule_id}"
      }
      on_error => "invalid_rule_id"
    }
    if [rule_id] != "" {
      mutate {
        replace => {
          "sec_res.rule_id" => "%{rule_id}"
        }
        on_error => "invalid_ruleid"
      }
    }
    mutate {
      convert => {
        "ruleinfo.weight" => "string"
      }
      on_error => "conversion_weight_error"
    }
    mutate {
      replace => {
        "weight" => "%{ruleinfo.weight}"
      }
      on_error => "invalid_weight"
    }
    if [weight] != "" {
       mutate {
        replace => {
          "weight_label.key" => "weight"
          "weight_label.value" => "%{weight}"
        }
        on_error => "invalid_ruleinfo_weight"
      }
      if ![invalid_weight] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "weight_label"
          }
          on_error => "invalid_weight_label"
        }
      }
    }
    mutate {
      convert => {
        "ruleinfo.hash_component" => "string"
      }
      on_error => "invalid_hash_component"
    }
    mutate {
      replace => {
        "hash_component" => "%{ruleinfo.hash_component}"
      }
      on_error => "invalid_hash_component"
    }
    if [hash_component] != "" {
      mutate {
        replace => {
          "hash_component_label.key" => "hash_component"
          "hash_component_label.value" => "%{hash_component}"
        }
        on_error => "invalid_ruleinfo_hash_component"
      }
      if ![invalid_hash_component] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "hash_component_label"
          }
          on_error => "invalid_hash_component_label"
        }
      }
    }
    mutate {
      convert => {
        "ruleinfo.experimental" => "string"
      }
      on_error => "invalid_experimental"
    }
    mutate {
      replace => {
        "experimental" => "%{ruleinfo.experimental}"
      }
      on_error => "invalid_experimental"
    }
    if [experimental] != "" {
      mutate {
        replace => {
          "experimental_label.key" => "experimental"
          "experimental_label.value" => "%{experimental}"
        }
        on_error => "invalid_ruleinfo_experimental"
      }
      if ![invalid_experimental] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "experimental_label"
          }
          on_error => "invalid_experimental_label"
        }
      }
    }
    if [sec_res] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.security_result" => "sec_res"
        }
        on_error => "invalid_sec_res"
      }
    }
  }
  if [server_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "server_ip"
        "event.idm.read_only_udm.target.asset.ip" => "server_ip"
      }
      on_error => "invalid_server_ip"
    }
    if not [invalid_server_ip] {
      mutate {
        replace => {
          "target_present" => "true"
        }
      }
    }
  }
  mutate {
    convert => {
      "confidence" => "string"
    }
    on_error => "invalid_confidence"
  }
  if [confidence] != "" {
    mutate {
      replace => {
        "security_result.confidence_details" => "%{confidence}"
      }
      on_error => "invalid_confidence"
    }
  }
  if [mitigation_action] != "" {
    if [mitigation_action] =~ "(?i)allow" {
      mutate {
        replace => {
          "sec_action" => "ALLOW"
        }
        on_error => "invalid_sec_action"
      }
    }
    if [mitigation_action] =~ "(?i)block" {
      mutate {
        replace => {
          "sec_action" => "BLOCK"
        }
        on_error => "invalid_sec_action"
      }
    }
    if [sec_action] != "" {
      mutate {
        merge => {
          "security_result.action" => "sec_action"
        }
        on_error => "invalid_sec_action"
      }
    }
  }
  mutate {
    replace => {
      "tag_label.value" => ""
    }
  }
  for tag in tags {
    mutate {
      replace => {
        "tag_arr" => ""
      }
    }
    mutate {
      replace => {
        "tag_arr.string_value" => "%{tag}"
      }
      on_error => "invalid_tag"
    }
    if ![invalid_tag] {
      mutate {
        merge => {
          "tag_label.value.list_value.values" => "tag_arr"
        }
        on_error => "invalid_tag_label"
      }
    }
  }
  if [tag_label][value] != "" {
    mutate {
      replace => {
        "tag_label.key" => "tag"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "tag_label"
      }
      on_error => "tag_label_empty"
    }
  }
  grok{
    match => {
      "extracted_data.req_headers" => [
        "\\{%{GREEDYDATA:req_headers}\\}"
      ]
    }
    overwrite => ["req_headers"]
    on_error => "req_headers_not_parsing"
  }
  mutate {
    gsub => ["req_headers",", positions=\\[\\d\\]\\)",""]
  }
  mutate {
    gsub => ["req_headers",", positions=\\[\\d\\d\\]\\)",""]
  }
  mutate {
    gsub => ["req_headers","Header\\(values=",""]
  }
  mutate {
    gsub => ["req_headers",", ","#"]
  }
  kv {
    source => "req_headers"
    field_split => "#"
    value_split => "="
    on_error => "req_headers_kv_error"
  }
  grok {
    match => {
      "extracted_data.resp_headers" => [
        "\\{%{GREEDYDATA:resp_headers}\\}"
      ]
    }
    overwrite => ["resp_headers"]
    on_error => "resp_headers_not_parsing"
  }
  mutate {
    gsub => ["resp_headers","Header\\(values=",""]
  }
  mutate {
    gsub => ["resp_headers",", positions=\\[\\d\\]\\)",""]
  }
  mutate {
    gsub => ["resp_headers",", positions=\\[\\d\\d\\]\\)",""]
  }
  mutate {
    gsub => ["resp_headers","(\\\s+)(\\S+)=\\[", "#$2=["]
  }
  mutate {
    gsub => ["resp_headers","\\],", "]"]
  }
  kv {
    source => "resp_headers"
    field_split => "#"
    value_split => "="
    on_error => "resp_headers_kv_error"
  }
  mutate {
    gsub => ["x-forwarded-for", ",[\\s]*", '","']
  }
  mutate {
    replace => {
      "x_forwarded_for" => '{\"x_forwarded_for\":["%{x-forwarded-for}"]}'
    }
    on_error => "x_forwarded_for_not_valid"
  }
  json {
    source => "x_forwarded_for"
    array_function => "split_columns"
    on_error => "x_forwarded_for_not_valid"
  }
  for ip in x_forwarded_for {
    grok {
      match => {
        "ip" => "%{IP:x_ip}"
      }
      overwrite => ["x_ip"]
      on_error => "no_ip"
    }
    if ![no_ip] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "x_ip"
          "event.idm.read_only_udm.principal.asset.ip" => "x_ip"
        }
        on_error => "x_ip_not_valid"
      }
    }
  }
  mutate {
    replace => {
      "x_envoy_external_address" => '{\"x_envoy_external_address\":["%{x-envoy-external-address}"]}'
    }
    on_error => "x_envoy_external_address_not_valid"
  }
  json {
    source => "x_envoy_external_address"
    array_function => "split_columns"
    on_error => "x_envoy_external_address_not_valid"
  }
  for externalip in x_envoy_external_address {
    grok {
      match => {
        "externalip" => "%{IP:x_externalip}"
      }
      overwrite => ["x_externalip"]
      on_error => "no_externalip"
    }
    if ![no_externalip] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "x_externalip"
          "event.idm.read_only_udm.target.asset.ip" => "x_externalip"
        }
        on_error => "x_externalip_not_valid"
      }
    }
  }
  if [x-forwarded-proto] != "" {
    mutate {
      gsub => ["x-forwarded-proto","\\[",""]
    }
    mutate {
      gsub => ["x-forwarded-proto","\\]",""]
    }
    mutate {
      uppercase => ["x-forwarded-proto"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "%{x-forwarded-proto}"
      }
      on_error => "invalid_x_forwarded_proto"
    }
  }
  if [x-forwarded-client-cert] != "" {
    mutate {
      gsub => ["x-forwarded-client-cert","\\[",""]
    }
    mutate {
      gsub => ["x-forwarded-client-cert","\\]",""]
    }
    kv {
      source => "x-forwarded-client-cert"
      field_split => ";"
      value_split => "="
      on_error => "invalid_x_forwarded_client_cert"
    }
  }
  if [timestamp] != "" {
    date {
      match => ["timestamp","ISO8601","yyyy-MM-ddTHH:mm:ss.SSS"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "invalid_timestamp"
    }
  }

  if [referer] not in ["","-"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.referral_url" => "%{referer}"
      }
      on_error => "invalid_referer"
    }
  }

  if [method] not in ["","-"] {
    mutate {
      uppercase => ["method"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{method}"
      }
      on_error => "invalid_method"
    }
  }

  if [sessionid] not in ["","-"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{sessionid}"
      }
      on_error => "invalid_sessionid"
    }
  }

  if [uri] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.url" => "%{uri}"
      }
      on_error => "invalid_uri"
    }
  }

  if [action] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{action}"
      }
      on_error => "invalid_action"
    }
    if [action] =~ "(?i)allow" {
      mutate {
        replace => {
          "sec_action" => "ALLOW"
        }
      }
      mutate {
        merge => {
          "security_result.action" => "sec_action"
        }
        on_error => "invalid_sec_action"
      }
    }
  }

  if [client_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "client_ip"
        "event.idm.read_only_udm.principal.asset.ip" => "client_ip"
      }
      on_error => "invalid_client_ip"
    }
    if not [invalid_client_ip] {
      mutate {
        replace => {
          "principal_present" => "true"
        }
      }
    }
  }

  if [user_agent] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" => "%{user_agent}"
        "http_present" => "true"
      }
      on_error => "invalid_user_agent"
    }
    mutate {
      convert => {
        "user_agent" => "parseduseragent"
      }
      on_error => "invalid_parseduseragent"
    }
    if not [invalid_parseduseragent] {
      mutate {
        rename => {
          "user_agent" => "event.idm.read_only_udm.network.http.parsed_user_agent"
        }
        on_error => "invalid_user_agent_label"
      }
    }
  }

  if [policy][id] != "" {
    mutate {
      replace => {
        "security_result.rule_id" => "%{policy.id}"
      }
      on_error => "invalid_policy_id"
    }
  }

  if [policy][name] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{policy.name}"
      }
      on_error => "invalid_policy_name"
    }
  }

  if [policy][type] != "" {
    mutate {
      replace => {
        "security_result.rule_type" => "%{policy.type}"
      }
      on_error => "invalid_policy_type_sec"
    }
    mutate {
      replace => {
        "policy_type_label.key" => "PolicyType"
        "policy_type_label.value" => "%{policy.type}"
      }
      on_error => "invalid_policy_type"
    }
    if not [invalid_policy_type] {
      mutate {
        merge => {
          "security_result.detection_fields" => "policy_type_label"
        }
        on_error => "invalid_policy_type_label"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "CEQUENCE_BOT_DEFENSE"
      "event.idm.read_only_udm.metadata.vendor_name" => "CEQUENCE_BOT_DEFENSE"
      "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
    }
  }

  if [principal_present] == "true" and [target_present] == "true" and [http_present] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  } else if [principal_present] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  mutate {
    rename => {
      "experimental_confidence" => "additiondata.experimental_confidence"
      "extracted_data.respbody" => "additiondata.respbody"
      "successful_login" => "additiondata.successful_login"
      "transaction_id" => "additiondata.transaction_id"
      "isp" => "additiondata.isp"
      "organization" => "additiondata.organization"
      "fingerprint" => "additiondata.fingerprint"
      "challenge_status" => "additiondata.challenge_status"
      "asn" => "additiondata.asn"
      "parameterized_url" => "additiondata.parameterized_url"

      # security
      "x-b3-parentspanid" => "additiondata.x_b3_parentspanid"
      "x-b3-spanid" => "additiondata.x_b3_spanid"
      "x-b3-traceid" => "additiondata.x_b3_traceid"
      "x-cloud-trace-context" => "additiondata.x_cloud_trace_context"
      "x-envoy-attempt-count" => "additiondata.x_envoy_attempt_count"
      "x-forwarded-host" => "additiondata.x_forwarded_host"
      "access-control-allow-headers" => "additiondata.access-control-allow-headers"
      "access-control-allow-methods" => "additiondata.access-control-allow-methods"
      "access-control-allow-origin" => "additiondata.access-control-allow-origin"
      "access-control-max-age" => "additiondata.access-control-max-age"
      "authorization" => "additiondata.authorization"
      "connection" => "additiondata.connection"
      "content-type" => "additiondata.content-type"
      "cq-content-type" => "additiondata.cq-content-type"
      "x-request-id" => "additiondata.x-request-id"
      "request-headers.content-type" => "additiondata.request_headers_content_type"
      "request-headers.accept-encoding" => "additiondata.request_headers_accept_encoding"
      "strict-transport-security" => "additiondata.strict_transport_security"
      "x-content-type-options" => "additiondata.x_content_type_options"
      "x-frame-options" => "additiondata.x_frame_options"
      "content-length" => "additiondata.content_length"
      "vary" => "additiondata.vary"
      "failed_login" => "additiondata.failed_login"
      "By" => "additiondata.x-forwarded-client-cert_By"
      "Hash" => "additiondata.x-forwarded-client-cert_Hash"
      "URI" => "additiondata.x-forwarded-client-cert_URI"
      "policy_id" => "additiondata.policy_id"
    }
  }
  for key, value in additiondata map {
    mutate {
      replace => {
        "_field" => ""
      }
    }
    mutate {
      convert => {
        "value" => "string"
      }
      on_error => "value_conversion_error"
    }
    mutate {
      replace => {
        "_check" => "%{value}"
      }
      on_error => "no_value"
    }
    if ![no_value] and [value] not in ["", "-"] {
      mutate {
        replace => {
          "_field.key" => "%{key}"
        }
        on_error => "key_not_present"
      }
      if [key] in [ "experimental_confidence", "respbody", "successful_login", "transaction_id", "isp", "organization", "fingerprint", "challenge_status", "asn", "parameterized_url"] {
        mutate {
          replace => {
            "_field.value.string_value" => "%{value}"
          }
          on_error => "value_not_present"
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "_field"
          }
          on_error => "addition_merge_failed"
        }
      }
      else if [key] in [ "x_b3_parentspanid", "x_b3_spanid", "x_b3_traceid", "x_cloud_trace_context", "x_envoy_attempt_count", "x_forwarded_host", "access-control-allow-headers", "access-control-allow-methods", "access-control-allow-origin", "access-control-max-age", "authorization", "connection", "content-type", "cq-content-type", "x-request-id", "request_headers_content_type", "request_headers_accept_encoding", "strict_transport_security", "x_content_type_options", "x_frame_options", "content_length", "vary", "failed_login", "x-forwarded-client-cert_By", "x-forwarded-client-cert_Hash", "x-forwarded-client-cert_URI", "policy_id"] {
        mutate {
          gsub => ["value","\\[",""]
        }
        mutate {
          gsub => ["value","\\]",""]
        }
        mutate {
          replace => {
            "_field.value" => "%{value}"
          }
          on_error => "value_not_present"
        }
        mutate {
          merge => {
            "security_result.detection_fields" => "_field"
          }
          on_error => "addition_merge_failed"
        }
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "invalid_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
