# Product: CAMBIUM NETWORKS
# Category: Switches and Routers Log Type
# Supported Format: SYSLOG
# Reference: NA
# Last Updated: 2025-10-28
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "timestamp" => ""
      "host_name" => ""
      "severity" => ""
      "kv_fields" => ""
      "ids_event" => ""
      "iap" => ""
      "security_result" => ""
      "ssid" => ""
      "bssid" => ""
      "manufacturer" => ""
      "channel" => ""
      "ids_status" => ""
      "rssi" => ""
      "security" => ""
      "event_type" => ""
      "msg" => ""
      "action" => ""
      "client_mac" => ""
      "wlan" => ""
      "sta" => ""
      "after" => ""
      "roamed" => ""
      "txbytes" => ""
      "rxbytes" => ""
      "avgtx" => ""
      "maxtx" => ""
      "mintx" => ""
      "avgrx" => ""
      "maxrx" => ""
      "minrx" => ""
      "radio" => ""
      "auth_alg" => ""
      "auth_transaction" => ""
      "status_code" => ""
      "wep" => ""
      "seq_ctrl" => ""
      "kv_data" => ""
      "connection_status" => ""
      "has_principal" => "false"
      "has_target" => "false"
    }
  }

  mutate {
    gsub => ["message", "[\\r\\n]", ""]
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} %{HOSTNAME:host_name} : %{LOGLEVEL:severity}\\s+:\\s+%{GREEDYDATA:kv_fields}",
        "%{SYSLOGTIMESTAMP:timestamp} %{HOSTNAME:host_name} : %{LOGLEVEL:severity}\\s+:\\s+%{GREEDYDATA:kv_fields}",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp} %{HOSTNAME:host_name} %{GREEDYDATA:msg}",
        "%{SYSLOGTIMESTAMP:timestamp} %{HOSTNAME:host_name} %{GREEDYDATA:msg}"
      ]
    }
    overwrite => ["timestamp", "host_name", "severity", "kv_fields", "msg"]
    on_error => "invalid_logs"
  }

  mutate {
    gsub => ["kv_fields", " ([\\w-]+)=", "#$1="]
  }
  mutate {
    gsub => ["kv_fields", "\"", ""]
  }
  kv {
    source => "kv_fields"
    field_split => "#"
    value_split => "="
    on_error => "invalid_kv"
  }

  if [msg] != "" {
    grok {
      match => {
        "msg" => [
          "^(?<action>WIFI-\\d-CLIENT-DISCONNECTED) Client \\[(?<client_mac>[^\\]]+)\\] %{WORD:connection_status} from WLAN \\[(?<wlan>[^\\]]+)\\] after \\[(?<after>\\d+)\\] secs roamed \\[(?<roamed>\\w+)\\] txbytes \\[(?<txbytes>\\d+)\\] rxbytes \\[(?<rxbytes>\\d+)\\] avgtx \\[(?<avgtx>\\d+)\\] maxtx \\[(?<maxtx>\\d+)\\] mintx \\[(?<mintx>\\d+)\\] avgrx \\[(?<avgrx>\\d+)\\] maxrx \\[(?<maxrx>\\d+)\\] minrx \\[(?<minrx>\\d+)\\]",
          "^(?<action>WIFI-\\d-CLIENT-CONNECTED) Client \\[(?<client_mac>[^\\]]+)\\] %{WORD:connection_status} to WLAN \\[(?<wlan>[^\\]]+)\\] on radio \\[(?<radio>\\d+)\\]",
          "^(?<action>authentication): STA=(?<sta>[^ ]+)%{GREEDYDATA:kv_data}"
        ]
      }
      overwrite => ["action", "client_mac", "wlan", "sta", "after", "roamed", "txbytes", "rxbytes", "avgtx", "maxtx", "mintx", "avgrx", "maxrx", "minrx", "radio", "kv_data", "connection_status"]
      on_error => "msg_grok_fail"
    }
  }

  if [kv_data] != "" {
    mutate {
      strip => ["kv_data"]
    }
    kv {
      source => "kv_data"
      field_split => " "
      value_split => "="
      on_error => "kv_data_invalid"
    }
  }

  if [timestamp] != "" {
    date {
      match => ["timestamp", "ISO8601", "MMM dd HH:mm:ss", "MMM d HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      rebase => true
      on_error => "timestamp_error"
    }
  }

  if [host_name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{host_name}",
        "has_principal" => "true"
      }
    }
  }

  if [severity] =~ "(?i)alert" {
    mutate {
      replace => {
        "security_result.severity" => "HIGH"
      }
    }
  }
  else if [severity] =~ "(?i)warn" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
    }
  }
  else {
    mutate {
      replace => {
        "security_result.severity" => "LOW"
      }
    }
  }

  if [severity] != "" {
    mutate {
      replace => {
        "security_result.severity_details" => "%{severity}"
      }
    }
  }

  if [severity] =~ "(?i)warn"  {
    mutate {
      replace => {
        "security_result.description" => "%{kv_fields}"
      }
    }
  }
  else if [ids_status] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{ids_status}"
      }
    }
  }

  if [ids_event] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{ids_event}"
      }
    }
  }

  if [iap] != "" {
    mutate {
      replace => {
        "iap_label.key" => "Internet_Access_Provider"
        "iap_label.value" => "%{iap}"
      }
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "iap_label"
      }
    }
  }

  if [ssid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.application" => "%{ssid}"
      }
    }
  }
  if [wlan] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.application" => "%{wlan}"
      }
      on_error => "wlan_not_found"
    }
  }

  if [bssid] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.mac" => "bssid"
      }
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [client_mac] != "" {
    mutate {
      gsub => ["client_mac", "-", ":"]
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.mac" => "client_mac"
      }
      on_error => "client_mac_not_found"
    }
    if ![client_mac_not_found] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [sta] != "" {
    mutate {
      gsub => ["sta", "-", ":"]
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.mac" => "sta"
      }
      on_error => "sta_not_found"
    }
    if ![sta_not_found] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }

  if [after] != "" {
    mutate {
      convert => {
        "after" => "integer"
      }
      on_error => "after_not_integer"
    }
    mutate {
      rename => {
        "after" => "event.idm.read_only_udm.network.session_duration.seconds"
      }
    }
  }
  if [roamed] != "" {
    mutate {
      replace => {
        "roamed_label.key" => "roamed"
        "roamed_label.value" => "%{roamed}"
      }
      on_error => "roamed_not_found"
    }
    if ![roamed_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "roamed_label"
        }
        on_error => "roamed_label_not_exist"
      }
    }
  }
  if [txbytes] != "" {
    mutate {
      convert => {
        "txbytes" => "uinteger"
      }
      on_error => "txbytes_not_uinteger"
    }
    mutate {
      rename => {
        "txbytes" => "event.idm.read_only_udm.network.sent_bytes"
      }
      on_error => "txbytes_not_found"
    }
  }
  if [rxbytes] != "" {
    mutate {
      convert => {
        "rxbytes" => "uinteger"
      }
      on_error => "rxbytes_not_uinteger"
    }
    mutate {
      rename => {
        "rxbytes" => "event.idm.read_only_udm.network.received_bytes"
      }
      on_error => "rxbytes_not_found"
    }
  }
  if [avgtx] != "" {
    mutate {
      replace => {
        "avgtx_label.key" => "avg_tx_rate"
        "avgtx_label.value" => "%{avgtx}"
      }
      on_error => "avgtx_not_found"
    }
    if ![avgtx_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "avgtx_label"
        }
        on_error => "avgtx_label_not_exist"
      }
    }
  }
  if [maxtx] != "" {
    mutate {
      replace => {
        "maxtx_label.key" => "max_tx_rate"
        "maxtx_label.value" => "%{maxtx}"
      }
      on_error => "maxtx_not_found"
    }
    if ![maxtx_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "maxtx_label"
        }
        on_error => "maxtx_label_not_exist"
      }
    }
  }
  if [mintx] != "" {
    mutate {
      replace => {
        "mintx_label.key" => "min_tx_rate"
        "mintx_label.value" => "%{mintx}"
      }
      on_error => "mintx_not_found"
    }
    if ![mintx_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "mintx_label"
        }
        on_error => "mintx_label_not_exist"
      }
    }
  }
  if [avgrx] != "" {
    mutate {
      replace => {
        "avgrx_label.key" => "avg_rx_rate"
        "avgrx_label.value" => "%{avgrx}"
      }
      on_error => "avgrx_not_found"
    }
    if ![avgrx_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "avgrx_label"
        }
        on_error => "avgrx_label_not_exist"
      }
    }
  }
  if [maxrx] != "" {
    mutate {
      replace => {
        "maxrx_label.key" => "max_rx_rate"
        "maxrx_label.value" => "%{maxrx}"
      }
      on_error => "maxrx_not_found"
    }
    if ![maxrx_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "maxrx_label"
        }
        on_error => "maxrx_label_not_exist"
      }
    }
  }
  if [minrx] != "" {
    mutate {
      replace => {
        "minrx_label.key" => "min_rx_rate"
        "minrx_label.value" => "%{minrx}"
      }
      on_error => "minrx_not_found"
    }
    if ![minrx_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "minrx_label"
        }
        on_error => "minrx_label_not_exist"
      }
    }
  }
  if [radio] != "" {
    mutate {
      replace => {
        "radio_label.key" => "radio"
        "radio_label.value" => "%{radio}"
      }
      on_error => "radio_not_exist"
    }
    if ![radio_not_exist] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "radio_label"
        }
        on_error => "radio_label_not_exist"
      }
    }
  }
  if [connection_status] != ""  {
    mutate {
      replace => {
        "security_result.description" => "%{connection_status}"
      }
      on_error => "connection_status_not_exist"
    }
  }
  if [auth_alg] != "" {
    mutate {
      replace => {
        "auth_alg_label.key" => "auth_alg"
        "auth_alg_label.value" => "%{auth_alg}"
      }
      on_error => "auth_alg_not_found"
    }
    if ![auth_alg_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "auth_alg_label"
        }
        on_error => "auth_alg_label_not_exist"
      }
    }
  }
  if [status_code] == "0" {
    mutate {
      replace => {
        "sr_action" => "ALLOW"
      }
      on_error => "status_code_not_found"
    }
    mutate {
      merge => {
        "security_result.action" => "sr_action"
      }
    }
  }
  if [wep] != ""{
    mutate {
      replace => {
        "wep_label.key" => "wep"
        "wep_label.value" => "%{wep}"
      }
      on_error => "wep_not_found"
    }
    if ![wep_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "wep_label"
        }
        on_error => "wep_label_not_exist"
      }
    }
  }
  if [auth_transaction] != "" {
    mutate {
      replace => {
        "auth_transaction_label.key" => "auth_transaction"
        "auth_transaction_label.value" => "%{auth_transaction}"
      }
      on_error => "auth_transaction_not_found"
    }
    if ![auth_transaction_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "auth_transaction_label"
        }
        on_error => "auth_transaction_label_not_exist"
      }
    }
  }
  if [seq_ctrl] != "" {
    mutate {
      replace => {
        "seq_ctrl_label.key" => "seq_ctrl"
        "seq_ctrl_label.value" => "%{seq_ctrl}"
      }
      on_error => "seq_ctrl_not_found"
    }
    if ![seq_ctrl_not_found] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.asset.attribute.labels" => "seq_ctrl_label"
        }
        on_error => "seq_ctrl_label_not_exist"
      }
    }
  }

  if [manufacturer] != "" {
    mutate {
      replace => {
        "manufacturer_label.key" => "manufacturer"
        "manufacturer_label.value" => "%{manufacturer}"
      }
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "manufacturer_label"
      }
    }
  }

  if [channel] != "" {
    mutate {
      replace => {
        "channel_label.key" => "channel"
        "channel_label.value" => "%{channel}"
      }
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "channel_label"
      }
    }
  }

  if [rssi] != "" {
    mutate {
      replace => {
        "rssi_label.key" => "received_signal_strength_indicator"
        "rssi_label.value" => "%{rssi}"
      }
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "rssi_label"
      }
    }
  }

  if [action] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{action}"
      }
      on_error => "action_not_found"
    }
  }
  if [security] != "" {
    mutate {
      replace => {
        "encrypt_label.key" => "encryption_standard"
        "encrypt_label.value" => "%{security}"
      }
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "encrypt_label"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [action] == "authentication" and [has_target] == "true" {
    mutate {
      replace => {
        "event_type" => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type" => "MACHINE"
      }
    }
  } else if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
    }
  } else if [has_principal] == "true" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }

}
