# Product: TCPWAVE_DDI
# Category: Secure ddi
# Supported Format: SYSLOG + JSON, SYSLOG
# Reference: N/A
# Last Updated: 2025-12-02
# Copyright 2022 Chronicle LLC



filter {
  mutate {
    replace => {
      "ts" => ""
      "intermediary_host" => ""
      "application" => ""
      "pid" => ""
      "product_event_type" => ""
      "zone" => ""
      "description" => ""
      "smb_host" => ""
      "smb_stage1" => ""
      "smb_uid" => ""
      "json_data" => ""
      "target_ip" => ""
      "port" => ""
      "kv_data" => ""
      "client" => ""
      "security_result" => ""
      "thread" => ""
      "filepath" => ""
      "d_host" => ""
      "d_ip" => ""
      "d_mac" => ""
      "d_domain" => ""
      "d_clientID" => ""
      "des" => ""
      "src" => ""
      "src_mac" => ""
      "int_ip" => ""
      "pool_id" => ""
      "dhcp_pool_range" => ""
      "dhcp_pool_total" => ""
      "dhcp_pool_free" => ""
      "dhcp_pool_backup" => ""
      "dhcp_pool_lts" => ""
      "dhcp_pool_max_own" => ""
      "dhcp_pool_max_misbal" => ""
    }
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{UNIXPATH:filepath}\\[%{INT:pid}\\]: %{DATA:product_event_type}: Host=%{DATA:d_host} IP=%{IP:d_ip} MAC=%{NOTSPACE:d_mac} Domain=%{NOTSPACE:d_domain} ClientID=%{NOTSPACE:d_clientID}",
        "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{UNIXPATH:filepath}\\[%{INT:pid}\\]: %{GREEDYDATA:description}",
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: zone %{GREEDYDATA:zone}: %{GREEDYDATA:description} (?P<kv_data>smb_host.*) (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: zone (?P<zone>.*IN): %{GREEDYDATA:description} (?P<kv_data>smb_host.*) (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: query %{GREEDYDATA:kv_data} (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: %{WORD:product_event_type} %{GREEDYDATA:description} (?P<kv_data>smb_host.*) (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]:( .*%{WORD:product_event_type}:)? %{GREEDYDATA:zone}: dns_diff_apply: %{GREEDYDATA:description} (?P<kv_data>smb_host.*) (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: transfer of %{GREEDYDATA:zone} from %{GREEDYDATA:description} (?P<kv_data>smb_host.*) (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: client %{GREEDYDATA:client} %{IP:target_ip}#%{INT:port}(: )?%{GREEDYDATA:description} (?P<kv_data>smb_host.*) (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: %{GREEDYDATA:description}: %{IP:target_ip}#%{INT:port} (?P<kv_data>smb_host.*) (?P<json_data>{.*)"
        # with no json_data
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: zone %{GREEDYDATA:zone}: %{GREEDYDATA:description} (?P<kv_data>smb_host.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: zone (?P<zone>.*IN): %{GREEDYDATA:description} (?P<kv_data>smb_host.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: query %{GREEDYDATA:kv_data}"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: %{WORD:product_event_type} %{GREEDYDATA:description} (?P<kv_data>smb_host.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]:( .*%{WORD:product_event_type}:)? %{GREEDYDATA:zone}: dns_diff_apply: %{GREEDYDATA:description} (?P<kv_data>smb_host.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: transfer of %{GREEDYDATA:zone} from %{GREEDYDATA:description} (?P<kv_data>smb_host.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: client %{GREEDYDATA:client} %{IP:target_ip}#%{INT:port}(: )?%{GREEDYDATA:description} (?P<kv_data>smb_host.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: %{GREEDYDATA:description}: %{IP:target_ip}#%{INT:port} (?P<kv_data>smb_host.*)"
        # with no kv data
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: zone %{GREEDYDATA:zone}: %{GREEDYDATA:description} (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: zone (?P<zone>.*IN): %{GREEDYDATA:description} (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: query (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: %{WORD:product_event_type} %{GREEDYDATA:description} (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]:( .*%{WORD:product_event_type}:)? %{GREEDYDATA:zone}: dns_diff_apply: %{GREEDYDATA:description} (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: transfer of %{GREEDYDATA:zone} from %{GREEDYDATA:description} (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: client %{GREEDYDATA:client} %{IP:target_ip}#%{INT:port}(: )?%{GREEDYDATA:description} (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: %{GREEDYDATA:description}: %{IP:target_ip}#%{INT:port} (?P<json_data>{.*)"
        "%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: .* %{WORD:product_event_type}: .* (?P<json_data>{.*)"
        "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:intermediary_host} %{WORD:application}\\[%{INT:pid}\\]: %{GREEDYDATA:description}"
      ]
    }
    overwrite => ["ts","intermediary_host","application","pid","product_event_type","zone","description","json_data","kv_data","target_ip","port","client","filepath","d_host","d_ip","d_mac","d_domain","d_clientID"]
    on_error => "match_error"
  }

  if [match_error] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }

  if [json_data] != "" {
    mutate {
      gsub => ["json_data","smb_host\\\"value","smb_host\",\"value"]
    }
    json {
      source => "json_data"
      array_function => "split_columns"
      on_error => "not_json"
    }
  }

  if [kv_data] != "" {
    mutate {
      gsub => ["kv_data", "([a-zA-Z0-9_]+=)", "#$1"]
    }
    kv {
      source => "kv_data"
      field_split => "#"
      value_split => "="
    }
  }

  if [description] != "" {
    grok {
      match => {
        "description" => [
          "DHCPINFORM from %{IP:target_ip} via %{IP:int_ip}",
          "DHCPREQUEST for %{IP:target_ip} from %{MAC:d_mac} \\(%{NOTSPACE:d_host}\\) via %{IP:int_ip}",
          "DHCPACK on %{IP:target_ip} to %{MAC:d_mac} \\(%{NOTSPACE:d_host}\\) via %{IP:int_ip}",
          "balancing pool %{NOTSPACE:pool_id} %{DATA:dhcp_pool_range} total %{DATA:dhcp_pool_total}  free %{DATA:dhcp_pool_free}  backup %{DATA:dhcp_pool_backup}  lts %{DATA:dhcp_pool_lts}  max-own %{GREEDYDATA:dhcp_pool_max_own}",
          "balanced pool %{NOTSPACE:pool_id} %{DATA:dhcp_pool_range} total %{DATA:dhcp_pool_total}  free %{DATA:dhcp_pool_free}  backup %{DATA:dhcp_pool_backup}  lts %{DATA:dhcp_pool_lts} max-misbal %{GREEDYDATA:dhcp_pool_max_misbal}",
          "%{IP:target_ip}#%{INT:port}",
          "zone (?P<zone>.*IN)",
          "bind update on %{IP:target_ip} from %{HOSTNAME:src} rejected: %{GREEDYDATA:des}",
          "DHCPDISCOVER from %{MAC:src_mac} via %{IP:int_ip}: %{GREEDYDATA:des}",
          "BOOTP Request failed: No IP available from subnet %{IP:target_ip}."
        ]
      }
      overwrite => ["target_ip","port","zone","src","des","src_mac","int_ip","pool_id","dhcp_pool_range","dhcp_pool_total","dhcp_pool_free","dhcp_pool_backup","dhcp_pool_lts","dhcp_pool_max_own","dhcp_pool_max_misbal","d_mac","d_host"]
      on_error => "match_error"
    }

    if [pool_id] != "" {
      mutate {
        replace => {
          "pool_id_label.key" => "dhcp_pool_id"
          "pool_id_label.value.string_value" => "%{pool_id}"
        }
        on_error => "pool_id_not_found"
      }
      if ![pool_id_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "pool_id_label"
          }
          on_error => "pool_id_not_found"
        }
      }
    }
    if [dhcp_pool_range] != "" {
      mutate {
        replace => {
          "dhcp_pool_range_label.key" => "dhcp_pool_range"
          "dhcp_pool_range_label.value.string_value" => "%{dhcp_pool_range}"
        }
        on_error => "dhcp_pool_range_not_found"
      }
      if ![dhcp_pool_range_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "dhcp_pool_range_label"
          }
          on_error => "dhcp_pool_range_not_found"
        }
      }
    }
    if [dhcp_pool_total] != "" {
      mutate {
        replace => {
          "dhcp_pool_total_label.key" => "dhcp_pool_total"
          "dhcp_pool_total_label.value.string_value" => "%{dhcp_pool_total}"
        }
        on_error => "dhcp_pool_total_not_found"
      }
      if ![dhcp_pool_total_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "dhcp_pool_total_label"
          }
          on_error => "dhcp_pool_total_not_found"
        }
      }
    }
    if [dhcp_pool_free] != "" {
      mutate {
        replace => {
          "dhcp_pool_free_label.key" => "dhcp_pool_free"
          "dhcp_pool_free_label.value.string_value" => "%{dhcp_pool_free}"
        }
        on_error => "dhcp_pool_free_not_found"
      }
      if ![dhcp_pool_free_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "dhcp_pool_free_label"
          }
          on_error => "dhcp_pool_free_not_found"
        }
      }
    }
    if [dhcp_pool_backup] != "" {
      mutate {
        replace => {
          "dhcp_pool_backup_label.key" => "dhcp_pool_backup"
          "dhcp_pool_backup_label.value.string_value" => "%{dhcp_pool_backup}"
        }
        on_error => "dhcp_pool_backup_not_found"
      }
      if ![dhcp_pool_backup_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "dhcp_pool_backup_label"
          }
          on_error => "dhcp_pool_backup_not_found"
        }
      }
    }
    if [dhcp_pool_lts] != "" {
      mutate {
        replace => {
          "dhcp_pool_lts_label.key" => "dhcp_pool_lts"
          "dhcp_pool_lts_label.value.string_value" => "%{dhcp_pool_lts}"
        }
        on_error => "dhcp_pool_lts_not_found"
      }
      if ![dhcp_pool_lts_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "dhcp_pool_lts_label"
          }
          on_error => "dhcp_pool_lts_not_found"
        }
      }
    }
    if [dhcp_pool_max_own] != "" {
      mutate {
        replace => {
          "dhcp_pool_max_own_label.key" => "dhcp_pool_max_own"
          "dhcp_pool_max_own_label.value.string_value" => "%{dhcp_pool_max_own}"
        }
        on_error => "dhcp_pool_max_own_not_found"
      }
      if ![dhcp_pool_max_own_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "dhcp_pool_max_own_label"
          }
          on_error => "dhcp_pool_max_own_not_found"
        }
      }
    }
    if [dhcp_pool_max_misbal] != "" {
      mutate {
        replace => {
          "dhcp_pool_max_misbal_label.key" => "dhcp_pool_max_misbal"
          "dhcp_pool_max_misbal_label.value.string_value" => "%{dhcp_pool_max_misbal}"
        }
        on_error => "dhcp_pool_max_misbal_not_found"
      }
      if ![dhcp_pool_max_misbal_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "dhcp_pool_max_misbal_label"
          }
          on_error => "dhcp_pool_max_misbal_not_found"
        }
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{description}"
      }
    }
  }
  if [src_mac] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.src.mac" => "src_mac"
      }
      on_error => "src_mac_not_found"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.dhcp.chaddr" => "%{src_mac}"
      }
      on_error => "src_mac_not_found"
    }
  }
  if [int_ip] != "" {
    mutate {
      replace => {
        "int_ip_temp" => "%{int_ip}"
      }
    }
    mutate {
      convert => {
        "int_ip_temp" => "ipaddress"
      }
      on_error => "int_ip_invalid"
    }
    if ![int_ip_invalid] {
      mutate {
        replace => {
          "intermediary_entry" => ""
        }
      }
      mutate {
        merge => {
          "intermediary_entry.ip" => "int_ip"
          "intermediary_entry.asset.ip" => "int_ip"
        }
        on_error => "int_ip_not_found"
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.intermediary" => "intermediary_entry"
        }
        on_error => "intermediary_not_found"
      }
    }
  }
  if [description] =~ "DHCPDISCOVER" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DHCP"
        "event.idm.read_only_udm.network.application_protocol" => "DHCP"
        "event.idm.read_only_udm.network.dhcp.type" => "DISCOVER"
      }
    }
  }
  if [description] =~ "DHCPACK" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DHCP"
        "event.idm.read_only_udm.network.application_protocol" => "DHCP"
        "event.idm.read_only_udm.network.dhcp.type" => "ACK"
      }
    }
  }
  if [description] =~ "DHCPREQUEST" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DHCP"
        "event.idm.read_only_udm.network.application_protocol" => "DHCP"
        "event.idm.read_only_udm.network.dhcp.type" => "REQUEST"
      }
    }
  }
  if [description] =~ "DHCPINFORM" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DHCP"
        "event.idm.read_only_udm.network.application_protocol" => "DHCP"
        "event.idm.read_only_udm.network.dhcp.type" => "INFORM"
      }
    }
  }
  if [description] =~ "BOOTP Request failed" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DHCP"
        "event.idm.read_only_udm.network.application_protocol" => "DHCP"
        "event.idm.read_only_udm.network.dhcp.type" => "REQUEST"
      }
    }
  }
if [des] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{des}"
      }
    }
  }
if [src] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.src.hostname" => "%{src}"
      }
    }
  }
  if [description] =~ "rejected" {
    mutate {
      replace => {
        "security_action" => "BLOCK"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "security_action"
      }
      on_error => "security_result_not_found"
    }
  }

  if [ts] != "" {
    date {
      match => [ "ts", "MMM d HH:mm:ss"]
      rebase => true
    }
  }
  if [intermediary_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{intermediary_host}"
      }
      on_error => "intermediary_host_not_found"
    }
  }
  if [filepath] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.file.full_path" => "%{filepath}"
      }
      on_error => "filepath_not_found"
    }
  }
  if [d_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{d_host}"
      }
      on_error => "d_host_not_found"
    }
  }
  if [d_ip] != "" {
    mutate {
      replace => {
        "d_ip_temp" => "%{d_ip}"
      }
    }
    mutate {
      convert => {
        "d_ip_temp" => "ipaddress"
      }
      on_error => "d_ip_invalid"
    }
    if ![d_ip_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "d_ip"
        }
        on_error => "d_ip_not_found"
      }
    }
  }
  if [d_mac] != "" {
    mutate {
      gsub => [
        "d_mac", "^([0-9a-fA-F]{2})([0-9a-fA-F]{2})([0-9a-fA-F]{2})([0-9a-fA-F]{2})([0-9a-fA-F]{2})([0-9a-fA-F]{2})$", "$1:$2:$3:$4:$5:$6"
      ]
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.mac" => "d_mac"
      }
      on_error => "d_mac_not_found"
    }
  }
  if [d_domain] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.administrative_domain" => "%{d_domain}"
      }
      on_error => "d_domain_not_found"
    }
  }
  if [d_clientID] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.dhcp.client_identifier" => "%{d_clientID}"
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_DHCP"
        "event.idm.read_only_udm.network.application_protocol" => "DHCP"
      }
      on_error => "d_clientID_not_found"
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.network.dhcp.client_identifier" => "bytes"
      }
    }
  }

  if [pid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.pid" => "%{pid}"
      }
    }
    if [d_clientID] == "" && [src_mac] == "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "PROCESS_UNCATEGORIZED"
        }
        on_error => "event_type_not_found"
      }
    }
  }

  if [application] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.application" => "%{application}"
      }
      on_error => "application_not_found"
    }
  }

  if [product_event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{product_event_type}"
      }
      on_error => "product_event_type_not_found"
    }
    if [product_event_type] == "info" {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    }
    else if [product_event_type] == "error" {
      mutate {
        replace => {
          "security_result.severity" => "ERROR"
        }
      }
    }
  }

  if [target_ip] != "" {
    mutate {
      replace => {
        "target_ip_temp" => "%{target_ip}"
      }
    }
    mutate {
      convert => {
        "target_ip_temp" => "ipaddress"
      }
      on_error => "target_ip_invalid"
    }
    if ![target_ip_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "target_ip"
        }
        on_error => "target_ip_not_found"
      }
    }
  }

  if [port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.port" => "%{port}"
      }
      on_error => "port_not_found"
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.target.port" => "integer"
      }
    }
  }

  if [zone] != "" {
    mutate {
      replace => {
        "zone_label.key" => "zone"
        "zone_label.value" => "%{zone}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.metadata.ingestion_labels" => "zone_label"
      }
      on_error => "zone_label_not_found"
    }
  }



  if [client] != "" {
    mutate {
      replace => {
        "client_label.key" => "client"
        "client_label.value" => "%{client}"
      }
      on_error => "client_not_found"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.metadata.ingestion_labels" => "client_label"
      }
      on_error => "client_label_not_found"
    }
  }

  for field in additional {
    mutate {
      replace => {
        "label" => ""
      }
    }
    if [smb_host] != "" and [smb_stage1] != "" and [smb_uid] != "" {
      if [field][label] not in ["smb_host","smb_stage1","smb_uid", "source_country_name"] {
        if [field][value] != "" {
          mutate {
            replace => {
              "label.key" => "%{field.label}"
              "label.value" => "%{field.value}"
            }
          }
          mutate {
            merge => {
              "event.idm.read_only_udm.metadata.ingestion_labels" => "label"
            }
            on_error => "label_not_found"
          }
        }
      }
    }

    if [field][label] == "source_country_name" and [field][value] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.location.country_or_region" => "%{field.value}"
        }
        on_error => "source_country_name_not_found"
      }
    }

    if [smb_host] == "" and [field][label] == "smb_host" {
      mutate {
        replace => {
          "smb_host" => "%{field.value}"
        }
      }
    }
    if [smb_stage1] == "" and [field][label] == "smb_stage1" {
      mutate {
        replace => {
          "smb_stage1" => "%{field.value}"
        }
      }
    }
    if [smb_uid] == "" and [field][label] == "smb_uid" {
      mutate {
        replace => {
          "smb_uid" => "%{field.value}"
        }
      }
    }

  }

  if [smb_stage1] != "" {
    mutate {
      replace => {
        "smb_stage_label.key" => "smb stage"
        "smb_stage_label.value" => "%{smb_stage1}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.metadata.ingestion_labels" => "smb_stage_label"
      }
      on_error => "smb_stage_label_not_found"
    }
  }

  if [smb_uid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{smb_uid}"
      }
      on_error => "smb_uid_not_found"
    }
  }

  if [smb_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{smb_host}"
      }
      on_error => "smb_host_not_found"
    }
  }

  if [thread] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{thread}"
      }
      on_error => "thread_not_found"
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "sec_result_not_found"
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "TCPWAVE_DDI"
      "event.idm.read_only_udm.metadata.product_name" => "TCPWAVE_DDI"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
