# Product: IBM SOAR
# Category: Security
# Supported Format: SYSLOG + KV
# Reference: N/A
# Last Updated: 2024-10-08
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "time" => ""
      "prin_host" => ""
      "log_level" => ""
      "kv_data" => ""
      "entity_name" => ""
      "entity_id" => ""
      "entity_type" => ""
      "ip_address" => ""
      "modified_by_id" => ""
      "modified_by_name" => ""
      "modified_timestamp" => ""
      "api_key_display_name" => ""
      "api_key_id" => ""
      "msg_id" => ""
      "org_id" => ""
      "org_name" => ""
      "msg" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "metadata" => ""
      "additional" => ""
      "security_result" => ""
      "has_principal" => "false"
      "has_target" => "false"
    }
  }

  grok {
    match => {
      "message" => "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:prin_host} %{DATA} \\[%{DATA}\\]\\s+(?P<log_level>INFO)\\s+.*(?P<kv_data>msg_id.*)"
    }
    overwrite => ["time", "prin_host", "log_level", "kv_data"]
    on_error => "grok_failure"
  }
  if [grok_failure] {
    drop{
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  kv {
    source => "kv_data"
    field_split => ";"
    value_split => "="
    on_error => "kv_failure"
  }
  date {
    match => ["time", "MMM dd HH:mm:ss","MMM  d HH:mm:ss"]
    rebase => true
    on_error => "time_date_match_failed"
  }

  mutate {
    replace => {
      "metadata.product_name" => "IBM SOAR"
      "metadata.vendor_name" => "IBM SOAR"
    }
  }
  if [modified_by_name] =~ "^.+@.+$" {
    mutate {
      merge => {
        "target.user.email_addresses" => "modified_by_name"
      }
      on_error => "modified_by_name_empty"
    }
  }
  if [entity_id] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{entity_id}"
      }
      on_error => "no_entity_id"
    }
  }
  if [msg] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{msg}"
      }
      on_error => "msg_empty"
    }
  }
  if [ip_address] != "" {
    mutate {
      merge => {
        "principal.ip" => "ip_address"
        "principal.asset.ip" => "ip_address"
      }
      on_error => "prin_ip_merge_failed"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [prin_host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{prin_host}"
        "principal.asset.hostname" => "%{prin_host}"
        "has_principal" => "true"
      }
      on_error => "prin_host_empty"
    }
  }
  if [modified_by_id] != "" {
    mutate {
      replace => {
        "modified_by_id_label.value.string_value" => "%{modified_by_id}"
      }
      on_error => "modified_by_id_empty"
    }
    if ![modified_by_id_empty] {
      mutate {
        replace => {
          "modified_by_id_label.key" => "modified_by_id"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "modified_by_id_label"
        }
        on_error => "modified_by_id_label_empty"
      }
    }
  }
  if [modified_timestamp] != "" {
    mutate {
      replace => {
        "modified_timestamp_label.value.string_value" => "%{modified_timestamp}"
      }
      on_error => "modified_timestamp_empty"
    }
    if ![modified_timestamp_empty] {
      mutate {
        replace => {
          "modified_timestamp_label.key" => "modified_timestamp"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "modified_timestamp_label"
        }
        on_error => "modified_timestamp_label_empty"
      }
    }
  }
  if [org_name] != "" {
    mutate {
      replace => {
        "org_name_label.value.string_value" => "%{org_name}"
      }
      on_error => "org_name_empty"
    }
    if ![org_name_empty] {
      mutate {
        replace => {
          "org_name_label.key" => "org_name"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "org_name_label"
        }
        on_error => "org_name_label_empty"
      }
    }
  }
  if [entity_name] != "" {
    mutate {
      replace => {
        "entity_name_label.value.string_value" => "%{entity_name}"
      }
      on_error => "entity_name_empty"
    }
    if ![entity_name_empty] {
      mutate {
        replace => {
          "entity_name_label.key" => "entity_name"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "entity_name_label"
        }
        on_error => "entity_name_label_empty"
      }
    }
  }
  if [entity_type] != "" {
    mutate {
      replace => {
        "entity_type_label.value.string_value" => "%{entity_type}"
      }
      on_error => "entity_type_empty"
    }
    if ![entity_type_empty] {
      mutate {
        replace => {
          "entity_type_label.key" => "entity_type"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "entity_type_label"
        }
        on_error => "entity_type_label_empty"
      }
    }
  }
  if [api_key_id] != "" {
    mutate {
      replace => {
        "api_key_id_label.value.string_value" => "%{api_key_id}"
      }
      on_error => "api_key_id_empty"
    }
    if ![api_key_id_empty] {
      mutate {
        replace => {
          "api_key_id_label.key" => "api_key_id"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "api_key_id_label"
        }
        on_error => "api_key_id_label_empty"
      }
    }
  }
  if [api_key_display_name] != "" {
    mutate {
      replace => {
        "api_key_display_name_label.value.string_value" => "%{api_key_display_name}"
      }
      on_error => "api_key_display_name_empty"
    }
    if ![api_key_display_name_empty] {
      mutate {
        replace => {
          "api_key_display_name_label.key" => "api_key_display_name"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "api_key_display_name_label"
        }
        on_error => "api_key_display_name_label_empty"
      }
    }
  }
  if [org_id] != "" {
    mutate {
      replace => {
        "org_id_label.value.string_value" => "%{org_id}"
      }
      on_error => "org_id_empty"
    }
    if ![org_id_empty] {
      mutate {
        replace => {
          "org_id_label.key" => "org_id"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "org_id_label"
        }
        on_error => "org_id_label_empty"
      }
    }
  }
  if [msg_id] != "" {
    mutate {
      replace => {
        "msg_id_label.value.string_value" => "%{msg_id}"
      }
      on_error => "msg_id_empty"
    }
    if ![msg_id_empty] {
      mutate {
        replace => {
          "msg_id_label.key" => "msg_id"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "msg_id_label"
        }
        on_error => "msg_id_label_empty"
      }
    }
  }

  if [log_level] =~ "(?i)(DEBUG|INFO|AUDIT|NOTICE)" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  }
  else if [log_level] =~ "(?i)ERROR" {
    mutate {
      replace => {
        "security_result.severity" => "ERROR"
      }
    }
  }
  else if [log_level] =~ "(?i)(WARNING|WARN)" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
    }
  }

  if [has_principal] == "true" and [has_target] == "false" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
