# Product: KERIOCONTROL
# Category: Threat Management Firewall
# Supported Format: SYSLOG
# Reference: https://support.keriocontrol.gfi.com/hc/en-us/articles/360015191899-HTTP-Logs-in-Kerio-Control
# Last Updated: 2024-02-28
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "security_result" => ""
      "event_type" => ""
      "metadata" => ""
      "principal" => ""
      "additional" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "target" => ""
      "network" => ""
      "extensions" => ""
      "timestamp" => ""
      "product_event_type" => ""
      "desc" => ""
      "kv_data1" => ""
      "severity" => ""
      "rule_id" => ""
      "sec_result_desc" => ""
      "ip_port" => ""
      "src_ip" => ""
      "src_port" => ""
      "dest_port" => ""
      "principal_host" => ""
      "target_host" => ""
      "dest_ip" => ""
      "proto" => ""
      "kv_data2" => ""
      "flags" => ""
      "seq" => ""
      "len" => ""
      "win" => ""
      "tcplen" => ""
      "udplen" => ""
      "kv_data" => ""
      "hostip" => ""
      "hostname" => ""
      "username" => ""
      "has_principal_user" => ""
      "dstipcount" => ""
      "dstipsingle" => ""
      "dstportcount" => ""
      "dstportsingle" => ""
      "firewall" => ""
      "haparty" => ""
      "connlimit" => ""
      "target_app" => ""
      "http_datetime" => ""
      "http_method" => ""
      "referral_url" => ""
      "app_protocol" => ""
      "http_version" => ""
      "response_code" => ""
      "sent_bytes" => ""
      "http_req" => ""
    }
  }
  mutate {
    gsub => ["message","ip/port","ip_port"]
  }
  mutate {
    gsub => ["message","protocol:","proto:"]
  }
  mutate {
    gsub => ["message","source:","src_ip:"]
  }
  mutate {
    gsub => ["message","destination:","dest_ip:"]
  }

  grok {
    match => {
      "message" => ["<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{DATA}\\s+- - - %{DATA} %{DATA:product_event_type}: %{DATA:desc},\\s+severity:\\s+%{DATA:severity},\\s+Rule ID:\\s+%{DATA:rule_id}\\s+%{DATA:sec_result_desc},%{GREEDYDATA:kv_data1}",
                    "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{DATA}\\s+- - - %{DATA} %{DATA:product_event_type} %{DATA:desc},%{DATA:kv_data1},\\s+%{IP:src_ip}:%{INT:src_port} -> %{IP:dest_ip}:%{INT:dest_port},\\s+%{GREEDYDATA:kv_data2}",
                    "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{DATA}\\s+- - - %{DATA} \\[%{DATA:http_version}\\] %{IP:src_ip} \\[Hostname] %{DATA:principal_host} - %{GREEDYDATA:desc}"
                    "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{DATA}\\s+- - - %{DATA} %{DATA:product_event_type}: %{DATA:target_app}: %{DATA:client}: %{IP:src_ip}: %{GREEDYDATA:desc}",
                    "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{DATA}\\s+- - - %{DATA} %{IP:src_ip} - - \\[%{DATA:http_datetime}] \\\"%{DATA:http_method} %{DATA:referral_url} %{DATA:app_protocol}/%{DATA:http_version}\\\" %{INT:response_code} %{DATA:sent_bytes} %{GREEDYDATA:http_req}",
                    "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{DATA}\\s+- - - %{DATA} %{DATA:product_event_type}: %{DATA:desc},%{GREEDYDATA:kv_data1}",
                    "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{DATA}\\s+- - - %{DATA} %{DATA:product_event_type} \\'%{DATA:desc}\\' \\[%{DATA}\\] %{DATA:principal_host} \\(%{IP:src_ip}\\):%{INT:src_port} -> %{DATA:target_host} \\(%{IP:dest_ip}\\):%{INT:dest_port}, %{DATA:app_protocol} %{GREEDYDATA:sec_result_desc}"
""                  "<%{INT}>%{INT} %{TIMESTAMP_ISO8601:timestamp} %{DATA} %{DATA}\\s+- - - %{DATA} %{DATA:product_event_type} %{GREEDYDATA:kv_data}"]
    }
    overwrite => ["timestamp","product_event_type","desc","kv_data1","severity","rule_id","sec_result_desc","kv_data2","src_ip","dest_ip","src_port","dest_port","kv_data","target_app","http_datetime","referral_url","app_protocol","http_version","response_code","sent_bytes","http_req","http_method","principal_host","desc","app_protocol"]
    on_error => "grok_fail"
  }
  if [kv_data1] != "" {
    kv {
      source => "kv_data1"
      value_split => ":"
      field_split => ","
      on_error => "invalid_kv1"
    }
  }
  if [kv_data2] != "" {
    kv {
      source => "kv_data2"
      value_split => ":"
      field_split => ","
      on_error => "invalid_kv2"
    }
  }

  if [kv_data] != "" {
    mutate {
      gsub => ["kv_data","dsthost","target_host"]
    }
    mutate {
      gsub => ["kv_data","dstip=","dest_ip="]
    }
    mutate {
      gsub => ["kv_data","srchost=","principal_host="]
    }
    mutate {
      gsub => ["kv_data","dstip=","dest_ip="]
    }
    mutate {
      gsub => ["kv_data","dstport=","dest_port="]
    }
    mutate {
      gsub => ["kv_data","srcip=","src_ip="]
    }
    mutate {
      gsub => ["kv_data","\\\"\\\"",""]
    }
    mutate {
      gsub => ["kv_data","\\\"",""]
    }
    kv {
      source => "kv_data"
      value_split => "="
      field_split => " "
      on_error => "invalid_kv"
    }
  }
  if [timestamp] != "" {
    date {
      match => ["timestamp","ISO8601","RFC3339","UNIX","SYSLOGTIMESTAMP"]
      target => "metadata.event_timestamp"
      on_error => "invalid_timestamp"
    }
  }

  if [hostip] != "" {
    mutate {
      merge => {
        "principal.ip" => "hostip"
        "principal.asset.ip" => "hostip"
      }
      on_error => "host_ip_error"
    }
    if ![host_ip_error] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [http_datetime] != "" {
    mutate {
      replace => {
        "http_datetime_label.key" => "HTTP Request DateTime"
        "http_datetime_label.value.string_value" => "%{http_datetime}"
      }
      on_error => "http_datetime_label_error"
    }
    if ![http_datetime_label_error] {
      mutate {
        merge => {
          "additional.fields" => "http_datetime_label"
        }
        on_error => "http_datetime_label_merge_error"
      }
    }
  }
  if [http_method] != "" {
    mutate {
      replace => {
        "network.http.method" => "%{http_method}"
      }
      on_error => "http_method_error"
    }
  }
  if [referral_url] != "" {
    mutate {
      replace => {
        "network.http.referral_url" => "%{referral_url}"
      }
      on_error => "url_error"
    }
    mutate {
      replace => {
        "target.url" => "%{referral_url}"
      }
      on_error => "url_error"
    }
  }
  if [app_protocol] in ["HTTP","HTTPS"] {
    mutate {
      replace => {
        "network.application_protocol" => "%{app_protocol}"
      }
      on_error => "protocol_error"
    }
  }
  if [http_version] != "" {
    mutate {
      replace => {
        "network.application_protocol_version" => "%{http_version}"
      }
    }
  }
  if [response_code] != "" {
    mutate {
      replace => {
        "network.http.response_code" => "%{response_code}"
      }
      convert => {
        "network.http.response_code" => "integer"
      }
      on_error => "code_error"
    }
  }
  if [sent_bytes] != "" {
    mutate {
      replace => {
        "network.sent_bytes" => "%{sent_bytes}"
      }
      on_error => "len_error"
    }
    mutate {
      convert => {
        "network.sent_bytes" => "uinteger"
      }
      on_error => "conversion_error"
    }
  }
  if [http_req] != "" {
    mutate {
      replace => {
        "http_req_label.key" => "HTTP_Requests_In_Connection"
        "http_req_label.value.string_value" => "%{http_req}"
      }
      on_error => "http_req_error"
    }
    if ![http_req_error] {
      mutate {
        merge => {
          "additional.fields" => "http_req_label"
        }
        on_error => "http_req_merge_error"
      }
    }
  }

  if [hostname] != "" and [principal_host] == "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
        "principal.asset.hostname" => "%{hostname}"
        "has_principal" => "true"
      }
      on_error => "hostname_error"
    }
  }

  if [username] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{username}"
        "has_principal_user" => "true"
      }
      on_error => "username_error"
    }
  }

  if [severity] in ["Medium","High"] {
    mutate {
      uppercase => ["severity"]
    }
    mutate {
      replace => {
        "security_result.severity" => "%{severity}"
      }
    }
  }
  else if [severity] != "" {
    mutate {
      replace  => {
        "security_result.severity_details" => "%{severity}"
      }
      on_error => "severity_error"
    }
  }
  if [proto] in ["TCP","UDP","ICMP"] {
    mutate {
      replace => {
        "network.ip_protocol" => "%{proto}"
      }
      on_error => "proto_error"
    }
  }
  else if [proto] != "" {
    mutate {
      replace => {
        "proto_label.key" => "Proto"
        "proto_label.value.string_value" => "%{proto}"
      }
      on_error => "proto_label_error"
    }
    if ![proto_label_error] {
      mutate {
        merge => {
          "additional.fields" => "proto_label"
        }
        on_error => "proto_label_merge_error"
      }
    }
  }
  if [target_app] != "" {
    mutate {
      replace => {
        "target.application" => "%{target_app}"
      }
      on_error => "target_app_error"
    }
  }
  if [flags] != "" {
    mutate {
      replace => {
        "flags_label.key" => "Flags"
        "flags_label.value.string_value" => "%{flags}"
      }
      on_error => "flags_label_error"
    }
    if ![flags_label_error] {
      mutate {
        merge => {
          "additional.fields" => "flags_label"
        }
        on_error => "flags_label_merge_error"
      }
    }
  }
  if [dstipcount] != "" {
    mutate {
      replace => {
        "dstipcount_label.key" => "dstipcount"
        "dstipcount_label.value.string_value" => "%{dstipcount}"
      }
      on_error => "dstipcount_label_error"
    }
    if ![dstipcount_label_error] {
      mutate {
        merge => {
          "additional.fields" => "dstipcount_label"
        }
        on_error => "dstipcount_label_merge_error"
      }
    }
  }
  if [dstipsingle] != "" {
    mutate {
      replace => {
        "dstipsingle_label.key" => "dstipsingle"
        "dstipsingle_label.value.string_value" => "%{dstipsingle}"
      }
      on_error => "dstipsingle_label_error"
    }
    if ![dstipsingle_label_error] {
      mutate {
        merge => {
          "additional.fields" => "dstipsingle_label"
        }
        on_error => "dstipsingle_label_merge_error"
      }
    }
  }
  if [dstportcount] != "" {
    mutate {
      replace => {
        "dstportcount_label.key" => "dstportcount"
        "dstportcount_label.value.string_value" => "%{dstportcount}"
      }
      on_error => "dstportcount_label_error"
    }
    if ![dstportcount_label_error] {
      mutate {
        merge => {
          "additional.fields" => "dstportcount_label"
        }
        on_error => "dstportcount_label_merge_error"
      }
    }
  }
  if [connlimit] != "" {
    mutate {
      replace => {
        "connlimit_label.key" => "connlimit"
        "connlimit_label.value.string_value" => "%{connlimit}"
      }
      on_error => "connlimit_label_error"
    }
    if ![connlimit_label_error] {
      mutate {
        merge => {
          "additional.fields" => "connlimit_label"
        }
        on_error => "connlimit_label_merge_error"
      }
    }
  }
  if [dstportsingle] != "" {
    mutate {
      replace => {
        "dstportsingle_label.key" => "dstportsingle"
        "dstportsingle_label.value.string_value" => "%{dstportsingle}"
      }
      on_error => "dstportsingle_label_error"
    }
    if ![dstportsingle_label_error] {
      mutate {
        merge => {
          "additional.fields" => "dstportsingle_label"
        }
        on_error => "dstportsingle_label_merge_error"
      }
    }
  }
  if [firewall] != "" {
    mutate {
      replace => {
        "firewall_label.key" => "firewall"
        "firewall_label.value.string_value" => "%{firewall}"
      }
      on_error => "firewall_label_error"
    }
    if ![firewall_label_error] {
      mutate {
        merge => {
          "additional.fields" => "firewall_label"
        }
        on_error => "firewall_label_merge_error"
      }
    }
  }
  if [haparty] != "" {
    mutate {
      replace => {
        "haparty_label.key" => "haparty"
        "haparty_label.value.string_value" => "%{haparty}"
      }
      on_error => "haparty_label_error"
    }
    if ![haparty_label_error] {
      mutate {
        merge => {
          "additional.fields" => "haparty_label"
        }
        on_error => "haparty_label_merge_error"
      }
    }
  }


  if [seq] != "" {
    mutate {
      replace => {
        "seq_label.key" => "Sequence Number"
        "seq_label.value.string_value" => "%{seq}"
      }
      on_error => "seq_label_error"
    }
    if ![seq_label_error] {
      mutate {
        merge => {
          "additional.fields" => "seq_label"
        }
        on_error => "seq_label_merge_error"
      }
    }
  }
  if [win] != "" {
    mutate {
      replace => {
        "win_label.key" => "win"
        "win_label.value.string_value" => "%{win}"
      }
      on_error => "win_label_error"
    }
    if ![win_label_error] {
      mutate {
        merge => {
          "additional.fields" => "win_label"
        }
        on_error => "win_label_merge_error"
      }
    }
  }
  if [tcplen] != "" {
    mutate {
      replace => {
        "tcplen_label.key" => "tcplen"
        "tcplen_label.value.string_value" => "%{tcplen}"
      }
      on_error => "tcplen_label_error"
    }
    if ![tcplen_label_error] {
      mutate {
        merge => {
          "additional.fields" => "tcplen_label"
        }
        on_error => "tcplen_label_merge_error"
      }
    }
  }

  if [udplen] != "" {
    mutate {
      replace => {
        "udplen_label.key" => "udplen"
        "udplen_label.value.string_value" => "%{udplen}"
      }
      on_error => "udplen_label_error"
    }
    if ![udplen_label_error] {
      mutate {
        merge => {
          "additional.fields" => "udplen_label"
        }
        on_error => "udplen_label_error_error"
      }
    }
  }

  if [product_event_type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{product_event_type}"
      }
      on_error => "event_type_error"
    }
  }

  if [desc] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{desc}"
      }
      on_error => "desc_error"
    }
  }

  if [desc] =~ "(?i)Packet from" {
    mutate {
      replace => {
        "network.direction" => "INBOUND"
      }
    }
    if [len] != "" {
      mutate {
        replace => {
          "network.received_bytes" => "%{len}"
        }
        on_error => "len_error"
      }
      mutate {
        convert => {
          "network.received_bytes" => "uinteger"
        }
        on_error => "conversion_error"
      }
    }
  }
  else if [desc] =~ "(?i)Packet to" {
    mutate {
      replace => {
        "network.direction" => "OUTBOUND"
      }
    }
    if [len] != "" {
      mutate {
        replace => {
          "network.sent_bytes" => "%{len}"
        }
        on_error => "len_error"
      }
    }
    mutate {
      convert => {
        "network.sent_bytes" => "uinteger"
      }
      on_error => "conversion_error"
    }
  }
  if [ip_port] != "" {
    grok {
      match => {
        "ip_port" => ["%{IP:src_ip}:%{INT:src_port} \\(%{DATA:principal_host}\\) -> %{IP:dest_ip}:%{INT:dest_port} \\(%{DATA:target_host}\\)",
                        "%{IP:src_ip}:%{INT:src_port} -> %{IP:dest_ip}:%{INT:dest_port}"
                        ]
      }
      overwrite => ["src_ip","src_port","dest_ip","dest_port","principal_host","target_host"]
      on_error => "no_grok_match"
    }
  }
  if [src_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "src_ip"
        "principal.asset.ip" => "src_ip"
      }
      on_error => "src_ip_error"
    }
    if ![src_ip_error] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [dest_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "dest_ip"
        "target.asset.ip" => "dest_ip"
      }
      on_error => "dest_ip_error"
    }
    if ![dest_ip_error] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [principal_host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{principal_host}"
        "principal.asset.hostname" => "%{principal_host}"
        "has_principal" => "true"
      }
      on_error => "principal_host_error"
    }
  }
  if [target_host] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{target_host}"
        "target.asset.hostname" => "%{target_host}"
        "has_target" => "true"
      }
      on_error => "target_host_error"
    }
  }
  if [src_port] != "" {
    mutate {
      rename => {
        "src_port" => "principal.port"
      }
      convert => {
        "principal.port" => "integer"
      }
      on_error => "src_port_error"
    }
  }
  if [dest_port] != "" {
    mutate {
      rename => {
        "dest_port" => "target.port"
      }
      convert => {
        "target.port" => "integer"
      }
      on_error => "dest_port_error"
    }
  }

  if [rule_id] != "" {
    mutate {
      replace => {
        "rule_id_label.key" => "Rule ID"
        "rule_id_label.value" => "%{rule_id}"
      }
      on_error => "rule_id_error"
    }
    if ![rule_id_error] {
      mutate {
        merge => {
          "security_result.detection_fields" => "rule_id_label"
        }
        on_error => "rule_id_merge_error"
      }
    }
  }

  if [sec_result_desc] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{sec_result_desc}"
      }
      on_error => "sec_result_desc_error"
    }
  }
  if [has_principal] == "true" and [app_protocol] != "" {
    mutate {
      replace => {
        "event_type" => "NETWORK_HTTP"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" and ([network] != "" or [proto] != "") {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" and [has_principal_user] == "true" {
    mutate {
      replace => {
        "event_type" => "USER_LOGIN"
        "extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }
    if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "sec_result_error"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
