# Product: SHRUBBERY TACACS
# Category: NETWORK MANAGEMENT
# Supported Format: SYSLOG + KV
# Reference: N/A
# Last Updated: 2022-11-08
# Copyright 2022 Chronicle LLC


filter {
  mutate {
    replace => {
      "src_hostname" => ""
      "time" => ""
      "prin_ip" => ""
      "dest_ip" => ""
      "cmd" => ""
      "task_id" => ""
      "security_action" => ""
      "action" => ""
      "user" => ""
      "kv_data" => ""
      "service" => ""
      "security_result" => ""
      "event_type" => "GENERIC_EVENT"
      "session_pid" => ""
      "pid" => ""
      "process"=> ""
    }
  }

  mutate {
    gsub => ["message" ,"\\t","#"]
  }

  mutate {
    replace => {
         "event.idm.read_only_udm.extensions.auth.type" => "TACACS"
    }
  }

  mutate {
    gsub => ["message","process\\*","process="]
  }

  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:src_hostname} %{SYSLOGTIMESTAMP}%{IP:dest_ip}#%{WORD:user}#%{DATA:user_tty}#%{IP:prin_ip}#%{WORD:action}#%{GREEDYDATA:kv_data}",
       "<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:src_hostname} %{SYSLOGTIMESTAMP}%{IP:dest_ip}#%{WORD:user}#%{DATA:user_tty}#%{DATA}#%{WORD:action}#%{GREEDYDATA:kv_data}"
      ]
    }
    overwrite => ["src_hostname","time","prin_ip","dest_ip","cmd","task_id","action","user","service","session_pid,""kv_data"]
    on_error => "grok_failure"
  }


  if [kv_data] != "" {
    kv {
      source => "kv_data"
      field_split => "#"
      value_split => "="
      on_error => "not_kv"
    }
  }

  if [process] != ""  {
    grok {
       match => {
           "process" => ["\\[%{INT:pid}\\]"]}
            overwrite => ["pid"]
              }
         }

  if [user] != "" {
       mutate {
             replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{user}"
      }
    }
  }

  if [time] != "" {
    date {
      match => ["time", "MMM dd yyyy HH:mm:ss", "MMM dd HH:mm:ss","MMM  d HH:mm:ss"]
      rebase => true
    }
  }

  if [prin_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "prin_ip"
      }
    }
  }

  if [dest_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "dest_ip"
      }
    }
  }

  if [src_hostname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{src_hostname}"
      }
    }
  }



  if [cmd] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.command_line" => "%{cmd}"
      }
    }
  }

  if [pid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.pid" => "%{pid}"
      }
    }
  }


  if [session_pid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{session_pid}"
      }
    }
  }


  if [service] != "" {
    mutate {
      replace => {
        "service_field.key" => "service"
        "service_field.value.string_value" => "%{service}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "service_field"
      }
    }
  }

  if [task_id] != "" {
    mutate {
      replace => {
        "task_id_field.key" => "TASK_ID"
        "task_id_field.value.string_value" => "%{task_id}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "task_id_field"
      }
    }
  }

  if [action]  == "stop" {
    mutate {
      replace => {
        "security_action" => "BLOCK"
        "security_result.action_details" => "%{action}"
      }
    }
  }
  else if [action] == "start" {
    mutate {
      replace => {
        "security_action" => "ALLOW"
        "security_result.action_details" => "%{action}"
      }
    }
  }

  if [security_action] != "" {
    mutate {
      merge => {
        "security_result.action" => "security_action"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "shrubbery_tacacs"
      "event.idm.read_only_udm.metadata.product_name" => "shrubbery_tacacs"
    }
  }

  if ([src_hostname] != "" or [prin_ip] != "") and [dest_ip] == "" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }
   else if [cmd] =~ "(?i)login" {
    mutate {
      replace => {
        "event_type" => "USER_LOGIN"
      }
    }
  }
  else if [cmd] =~ "(?i)logout" {
    mutate {
      replace => {
        "event_type" => "USER_LOGOUT"
      }
    }
  }
  else if ([src_hostname] != "" or [prin_ip] != "") and [dest_ip] != "" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if  [event_type] == "GENERIC_EVENT" and [src_hostname] != ""  and [dest_ip] == "" {
    mutate {
      replace => {
        "event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  if  [event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
