# Product: REDHAT DIRECTORY SERVER
# Category: Identity and Access Management
# Supported Format: JSON + SYSLOG + KV
# Reference: https://access.redhat.com/documentation/en-us/red_hat_directory_server/11
# Last Updated: 2026-05-04
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "level" => ""
      "sec_result" => ""
      "base" => ""
      "dn" => ""
      "client_ip" => ""
      "target_ip" => ""
      "oid" => ""
      "operation" => ""
      "conn" => ""
      "csn" => ""
      "op" => ""
      "err" => ""
      "tag" => ""
      "nentries" => ""
      "kvdata1" => ""
      "kvdata" => ""
      "creationDate" => ""
      "recordDate" => ""
      "wtime" => ""
      "optime" => ""
      "etime" => ""
      "cn" => ""
      "ou" => ""
      "o" => ""
      "scope" => ""
      "filter" => ""
      "attrs" => ""
      "name" => ""
      "method" => ""
      "version" => ""
      "targetop" => ""
      "msgid" => ""
      "fd" => ""
      "slot" => ""
      "time" => ""
      "properties._hostname" => ""
      "properties.host" => ""
      "properties._file_path" => ""
      "properties._ecs_agent_version" => ""
      "properties._file_inode" => ""
      "properties._file_offset" => ""
      "properties._os" => ""
      "properties.country" => ""
      "properties.discipline" => ""
      "properties.document_type" => ""
      "properties.environment" => ""
      "properties.hostgroup" => ""
      "properties.platform" => ""
      "properties.product" => ""
      "properties.project" => ""
      "target" => ""
      "user" => ""
      "msg1" => ""
      "mrId" => ""
      "namespace" => ""
      "msg_test" => ""
      "ts" => ""
      "host" => ""
      "desc" => ""
      "attrs_label_flag" => "false"
      "is_present_app" => "false"
      "has_userid" => "false"
      "has_principal" => "false"
      "has_target" => "false"
      "has_resource" => "false"
    }
  }

  mutate {
    gsub => ["message","message","msg_test"]
  }
  mutate {
    gsub => ["message","\\r",""]
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "json_failure"
  }
  if [json_failure] {
    mutate {
      replace => {
        "msg_test" => "%{message}"
      }
      on_error => "msg_test_replace_failure"
    }
  }
  if [msg_test] != "" {
    grok {
      match => {
        "msg_test" => [
                             "\\[%{HTTPDATE:time}\\] %{DATA:kvdata}\\s+%{WORD:operation} connection from %{IP:client_ip} to %{IP:target_ip}"
                             "\\[%{HTTPDATE:time}\\] %{GREEDYDATA:kvdata}(?:s|)(?:%{GREEDYDATA}|) %{IP:client_ip} to %{IP:target_ip}",
                             "\\[%{HTTPDATE:time}\\] %{DATA:kvdata} %{WORD:operation} %{GREEDYDATA:kvdata1}(?:)"
                             "\\[%{HTTPDATE:time}\\] %{GREEDYDATA:kvdata} %{WORD:operation}(?:\s|)(?:%{GREEDYDATA:kvdata1}|)(?:\s|)(?:%{GREEDYDATA}|)"
                             "%{GREEDYDATA:msg1}"
                            ]
      }
      overwrite => ["client_ip", "target_ip", "operation","kvdata1","kvdata","time","msg1"]
      on_error => "msg_test_failure"
    }
    if [time] != "" {
      date {
        match => ["time", "dd/MMM/yyyy:HH:mm:ss Z"]
        on_error => "failure"
      }
    }
    if [msg_test_failure] {
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }

    if [operation] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.product_event_type" => "%{operation}"
        }
      }
    }

    if [client_ip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "client_ip"
        }
        on_error => "client_ip_merge_failed"
      }
      if ![client_ip_merge_failed] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }

    if [target_ip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "target_ip"
        }
        on_error => "target_ip_merge_failed"
      }
      if ![target_ip_merge_failed] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }
    if [kvdata1] != "" {
      mutate {
        gsub => ["kvdata1", "\\s+([a-zA-Z]+=)", "^$1"]
      }
      kv {
        source => "kvdata1"
        value_split => "="
        field_split => "^"
        on_error => "failure"
      }
    }
    if [kvdata] != "" {
      kv {
        source => "kvdata"
        value_split => "="
        field_split => " "
        on_error => "failure"
      }

      if [oid] != "" {
        mutate {
          gsub => ["oid", '\"', ""]
        }
        mutate {
          replace => {
            "event.idm.read_only_udm.principal.asset.product_object_id" => "%{oid}"
          }
        }
      }
      if [base] != "" {
        mutate {
          gsub => ["base", '\"', ""]
        }
        kv {
          source => "base"
          value_split => "="
          field_split => ","
          on_error => "failure"
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.target.user.group_identifiers" => "base"
          }
        }
      }
      else if [dn] != "" {
        mutate {
          gsub => ["dn", '\"', ""]
        }
        grok {
          match => {
            "dn" => [
              "cn=%{DATA:user},"
            ]
          }
          overwrite => ["user"]
          on_error => "failure"
        }
        if [user] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.principal.user.userid" => "%{user}"
              "has_userid" => "true"
            }
            on_error => "failure"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.target.user.group_identifiers" => "dn"
          }
        }
        kv {
          source => "dn"
          value_split => "="
          field_split => ","
          on_error => "failure"
        }

      }
    }
  }
  grok {
    match => {
      "message" => [
          "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{DATA:host}\\[%{INT}\\]: %{GREEDYDATA:desc}"
      ]
    }
    overwrite => ["host", "desc", "ts"]
    on_error => "grok_message_failure"
  }
    if [ts] != "" {
    date {
      match => ["ts", "MMM d HH:mm:ss"]
      rebase => true
      on_error => "ts_failure"
    }
  }
  if [host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{host}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{host}"
        "has_principal" => "true"
      }
      on_error => "host_failure"
    }
  }
  if [desc] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{desc}"
      }
      on_error => "desc_failure"
    }
  }
  mutate {
    rename => {
      "o" => "organization"
    }
  }
  if [level] != "" {
    mutate {
      uppercase => ["level"]
    }
  }

  if [level] in ["INFO", "DEBUG", "AUDIT"] {
    mutate {
      replace => {
        "sec_result.severity" => "INFORMATIONAL"
      }
    }
  }
  else if [level] in ["ERROR", "WARNING"] {
    mutate {
      replace => {
        "sec_result.severity" => "ERROR"
      }
    }
  }

  if [sec_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "sec_result"
      }
    }
  }

  if [mrId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{mrId}"
      }
      on_error => "mrId_failed"
    }
  }
  if [namespace] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.namespace" => "%{namespace}"
      }
      on_error => "namespace_failed"
    }
  }

  if [properties][_hostname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{properties._hostname}"
        "event.idm.read_only_udm.target.asset.hostname" => "%{properties._hostname}"
        "has_target" => "true"
      }
      on_error => "hostname_label_merge_failed1"
    }
  }
  else if [properties][host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{properties.host}"
        "event.idm.read_only_udm.target.asset.hostname" => "%{properties.host}"
        "has_target" => "true"
      }
      on_error => "hostname_label_merge_failed2"
    }
  }

  if [properties][_file_path] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.file.full_path" => "%{properties._file_path}"
      }
    }
  }
  if [properties][_ecs_agent_version] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{properties._ecs_agent_version}"
      }
    }
  }
  mutate {
    convert =>  {
      "properties._file_size" => "uinteger"
    }
    on_error => "file_size_conversion_failed"
  }
  mutate {
    rename => {
      "properties._file_size" => "event.idm.read_only_udm.target.process.file.size"
    }
  }

  if [properties][_file_inode] != "" {
    mutate {
      replace => {
        "label.key" => "File inode"
        "label.value.string_value" => "%{properties._file_inode}"
      }
      on_error => "no_label"
    }
    if ![no_label] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "label"
        }
        on_error => "label_merge_failed"
      }
    }
  }
  if [properties][_file_offset] != "" {
    mutate {
      convert => {
        "properties._file_offset" => "string"
      }
    }
    mutate {
      replace => {
        "offset_label.key" => "File Offset"
        "offset_label.value.string_value" => "%{properties._file_offset}"
      }
      on_error => "offset_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "offset_label"
      }
      on_error => "offset_label_merge_failed"
    }
  }

  if [properties][country] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.location.country_or_region" => "%{properties.country}"
      }
      on_error => "country_label_merge_failed"
    }
  }
  if [properties][discipline] != "" {
    mutate {
      replace => {
        "discipline_label.key" => "Discipline"
        "discipline_label.value" => "%{properties.discipline}"
      }
      on_error => "no_discipline_label"
    }
    if ![no_discipline_label] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "discipline_label"
        }
        on_error => "discipline_label_merge_failed"
      }
      mutate {
        replace => {
          "has_resource" => "true"
        }
      }
    }
  }
  if [properties][document_type] != "" {
    mutate {
      replace => {
        "document_type_label.key" => "Document_Type"
        "document_type_label.value" => "%{properties.document_type}"
      }
      on_error => "no_document_type_label"
    }
    if ![no_document_type_label] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "document_type_label"
        }
        on_error => "document_type_label_merge_failed"
      }
      mutate {
        replace => {
          "has_resource" => "true"
        }
      }
    }
  }
  if [properties][environment] != "" {
    mutate {
        replace => {
          "environment_label.key" => "Environment"
          "environment_label.value" => "%{properties.environment}"
        }
        on_error => "no_environment_label"
      }
    if ![no_environment_label] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "environment_label"
        }
        on_error => "environment_label_merge_failed"
      }
      mutate {
        replace => {
          "has_resource" => "true"
        }
      }
    }
  }
  if [properties][hostgroup] != "" {
    mutate {
      replace => {
        "hostgroup_label.key" => "Hostgroup"
        "hostgroup_label.value" => "%{properties.hostgroup}"
      }
      on_error => "no_hostgroup_label"
    }
    if ![no_hostgroup_label] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "hostgroup_label"
        }
        on_error => "hostgroup_label_merge_failed"
      }
      mutate {
        replace => {
          "has_resource" => "true"
        }
      }
    }
  }
  if [properties][platform] != "" {
    mutate {
      replace => {
        "platform_label.key" => "Platform"
        "platform_label.value" => "%{properties.platform}"
      }
      on_error => "no_platform_label"
    }
    if ![no_platform_label] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "platform_label"
        }
        on_error => "platform_label_merge_failed"
      }
      mutate {
        replace => {
          "has_resource" => "true"
        }
      }
    }
  }
  if [properties][product] != "" {
    mutate {
      replace => {
        "product_label.key" => "Product"
        "product_label.value" => "%{properties.product}"
      }
      on_error => "no_product_label"
    }
    if ![no_product_label] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "product_label"
        }
        on_error => "product_label_merge_failed"
      }
      mutate {
        replace => {
          "has_resource" => "true"
        }
      }
    }
  }
  if [properties][project] != "" {
    mutate {
      replace => {
        "project_label.key" => "Project"
        "project_label.value" => "%{properties.project}"
      }
      on_error => "no_project_label"
    }
    if ![no_project_label] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.resource.attribute.labels" => "project_label"
        }
        on_error => "project_label_merge_failed"
      }
      mutate {
        replace => {
          "has_resource" => "true"
        }
      }
    }
  }
  if [conn] != "" {
    mutate {
      replace => {
        "conn_label.key" => "Connection Number"
        "conn_label.value.string_value" => "%{conn}"
      }
      on_error => "conn_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "conn_label"
      }
      on_error => "conn_label_merge_failed"
    }
  }
  if [op] != "" {
    mutate {
      replace => {
        "op_label.key" => "Operation Number"
        "op_label.value.string_value" => "%{op}"
      }
      on_error => "op_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "op_label"
      }
      on_error => "op_label_merge_failed"
    }
  }
  if [err] != "" {
    mutate {
      replace => {
        "err_label.key" => "Error Number"
        "err_label.value.string_value" => "%{err}"
      }
      on_error => "err_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "err_label"
      }
      on_error => "err_label_merge_failed"
    }
  }
  if [tag] != "" {
    mutate {
      replace => {
        "tag_label.key" => "Tag Number"
        "tag_label.value.string_value" => "%{tag}"
      }
      on_error => "tag_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "tag_label"
      }
      on_error => "tag_label_merge_failed"
    }
  }
  if [nentries] != "" {
    mutate {
      replace => {
        "nentries_label.key" => "Number of Entries"
        "nentries_label.value.string_value" => "%{nentries}"
      }
      on_error => "nentries_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "nentries_label"
      }
      on_error => "nentries_label_merge_failed"
    }
  }
  if [csn] != "" {
    mutate {
      replace => {
        "csn_label.key" => "Change Sequence Number"
        "csn_label.value.string_value" => "%{csn}"
      }
      on_error => "csn_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "csn_label"
      }
      on_error => "csn_label_merge_failed"
    }
  }
  if [wtime] != "" {
    mutate {
      replace => {
        "wtime_label.key" => "wtime"
        "wtime_label.value.string_value" => "%{wtime}"
      }
      on_error => "wtime_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "wtime_label"
      }
      on_error => "wtime_label_merge_failed"
    }
  }
  if [optime] != "" {
    mutate {
      replace => {
        "optime_label.key" => "optime"
        "optime_label.value.string_value" => "%{optime}"
      }
      on_error => "optime_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "optime_label"
      }
      on_error => "optime_label_merge_failed"
    }
  }
  if [etime] != "" {
    mutate {
      replace => {
        "etime_label.key" => "etime"
        "etime_label.value.string_value" => "%{etime}"
      }
      on_error => "etime_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "etime_label"
      }
      on_error => "etime_label_merge_failed"
    }
  }
  if [cn] != "" {
    mutate {
      replace => {
        "cn_label.key" => "Common name"
        "cn_label.value.string_value" => "%{cn}"
      }
      on_error => "cn_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "cn_label"
      }
      on_error => "cn_label_merge_failed"
    }
  }
  if [ou] != "" {
    mutate {
      replace => {
        "ou_label.key" => "Organizational Unit"
        "ou_label.value.string_value" => "%{ou}"
      }
      on_error => "ou_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "ou_label"
      }
      on_error => "ou_label_merge_failed"
    }
  }
  if [organization] != "" {
    mutate {
      replace => {
        "org_label.key" => "Organization"
        "org_label.value.string_value" => "%{organization}"
      }
      on_error => "org_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "org_label"
      }
      on_error => "org_label_merge_failed"
    }
  }
  if [scope] != "" {
    mutate {
      replace => {
        "scope_label.key" => "Scope"
        "scope_label.value.string_value" => "%{scope}"
      }
      on_error => "scope_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "scope_label"
      }
      on_error => "scope_label_merge_failed"
    }
  }
  if [version] != "" {
    mutate {
      replace => {
        "version_label.key" => "Version"
        "version_label.value.string_value" => "%{version}"
      }
      on_error => "version_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "version_label"
      }
      on_error => "version_label_merge_failed"
    }
  }
  if [method] != "" {
    mutate {
      replace => {
        "method_label.key" => "Method"
        "method_label.value.string_value" => "%{method}"
      }
      on_error => "method_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "method_label"
      }
      on_error => "method_label_merge_failed"
    }
  }
  if [targetop] != "" {
    mutate {
      replace => {
        "targetop_label.key" => "targetop"
        "targetop_label.value.string_value" => "%{targetop}"
      }
      on_error => "targetop_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "targetop_label"
      }
      on_error => "targetop_label_merge_failed"
    }
  }
  if [msgid] != "" {
    mutate {
      replace => {
        "msgid_label.key" => "msgid"
        "msgid_label.value.string_value" => "%{msgid}"
      }
      on_error => "msgid_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "msgid_label"
      }
      on_error => "msgid_label_merge_failed"
    }
  }
  if [fd] != "" {
    mutate {
      replace => {
        "fd_label.key" => "fd"
        "fd_label.value.string_value" => "%{fd}"
      }
      on_error => "fd_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "fd_label"
      }
      on_error => "fd_label_merge_failed"
    }
  }
  if [slot] != "" {
    mutate {
      replace => {
        "slot_label.key" => "slot"
        "slot_label.value.string_value" => "%{slot}"
      }
      on_error => "slot_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "slot_label"
      }
      on_error => "slot_label_merge_failed"
    }
  }
  if [attrs] != "" {
    mutate {
      gsub => [
        "attrs", '\"', ''
      ]
    }
    mutate {
      gsub => ["attrs", '\\s+', ',']
    }
    mutate {
      replace => {
        "attrs" => "{\"attrs\":[%{attrs}]}"
      }
    }
    mutate {
      gsub => ["attrs", '\\[', '\["']
    }
    mutate {
      gsub => ["attrs", '\\]', '"\]']
    }
    mutate {
      gsub => ["attrs", ',', '","']
    }
    json {
      source => "attrs"
      array_function => "split_columns"
      on_error => "attrs_json_parse_failed"
    }
    for evntapp in attrs {
      mutate {
        convert => {
          "evntapp" => "string"
        }
        on_error => "evntapp_conversion_error"
      }
      mutate {
        replace => {
          "value_array1" => ""
        }
      }
      mutate {
        replace => {
          "value_array1.string_value" => "%{evntapp}"
        }
        on_error => "additional_evnt_empty1"
      }
      mutate {
        merge => {
          "evnt_label1.value.list_value.values" => "value_array1"
        }
        on_error => "additional_evnt_not_found1"
      }
      if ![additional_evnt_not_found1] {
        mutate {
          replace => {
            "is_present_app" => "true"
          }
        }
      }
    }
    if [is_present_app] == "true" {
      mutate {
        replace => {
          "evnt_label1.key" => "Attrs"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "evnt_label1"
        }
        on_error => "additional_events_empty1"
      }
    }
  }
  if [filter] != "" {
    mutate {
      gsub => [
        "filter", '\"', ''
      ]
    }
    mutate {
      replace => {
        "filter_label.key" => "Filter"
        "filter_label.value.string_value" => "%{filter}"
      }
      on_error => "filter_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "filter_label"
      }
      on_error => "filter_label_merge_failed"
    }
  }
  if [name] != "" {
    mutate {
      gsub => [
        "name", '\"', ''
      ]
    }
    mutate {
      replace => {
        "name_label.key" => "Name"
        "name_label.value.string_value" => "%{name}"
      }
      on_error => "name_label_replace_failed"
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "name_label"
      }
      on_error => "name_label_merge_failed"
    }
  }

  if [creationDate] != "" {
    mutate {
      convert => {
        "creationDate" => "string"
      }
    }
    mutate {
      gsub => ["creationDate","\\d\\d\\d\\d\\d\\d$" ,"" ]
    }
    date {
      match => ["creationDate","UNIX_MS" ]
      target => "about.resource.attribute.creation_time"
      on_error => "creation_date_conversion_failed"
    }
    if ![creation_date_conversion_failed] {
      mutate {
        replace => {
          "has_resource" => "true"
        }
      }
    }
  }
  if [recordDate] != "" {
    mutate {
      convert => {
        "recordDate" => "string"
      }
    }

    mutate {
      gsub => ["recordDate","\\d\\d\\d\\d\\d\\d$" ,"" ]
    }

    date {
      match => ["recordDate","UNIX_MS" ]
      target => "event.idm.read_only_udm.metadata.collected_timestamp"
    }
  }
  mutate {
    merge => {
      "event.idm.read_only_udm.about" => "about"
    }
    on_error => "about_merge_failed"
  }

  if [properties][_os] == "linux" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.platform" => "LINUX"
      }
    }
  }

  if [has_principal] == "true" && [has_target] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_userid] == "true" && [has_resource] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_RESOURCE_ACCESS"
      }
    }
  }
  else if [has_userid] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "REDHAT_DIRECTORY_SERVER"
      "event.idm.read_only_udm.metadata.vendor_name" => "REDHAT"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
