# Product: Azure Cosmos DB
# Category: Database
# Supported Format: JSON
# Reference: https://docs.microsoft.com/en-us/azure/cosmos-db/monitor-cosmos-db-reference
# Last Updated: 2025-01-16
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "category" => ""
      "resourceId" => ""
      "query_text" => ""
      "operationName" => ""
      "network" => ""
      "intermediary" => ""
      "security_result" => ""
      "subscription_id" => ""
      "resource_group" => ""
      "target_application" => ""
      "db_account" => ""
      "properties.querytext.query" => ""
      "properties.subscriptionid" => ""
      "properties.subscriptionId" => ""
      "properties.resourcegroupname" => ""
      "properties.databasename" => ""
      "properties.databaseName" => ""
      "properties.numberofrowsreturned" => ""
      "properties.signature" => ""
      "properties.shapesignature" => ""
      "properties.queryexecutionstatus" => ""
      "properties.collectionname" => ""
      "properties.collectionName" => ""
      "properties.useragent" => ""
      "properties.userAgent" => ""
      "properties.partialipaddress" => ""
      "properties.statusCode" => ""
      "properties.requestLength" => ""
      "properties.responseLength" => ""
      "properties.clientIpAddress" => ""
      "properties.partitionId" => ""
      "properties.collectionRid" => ""
      "properties.activityId" => ""
      "properties.region" => ""
      "properties.authTokenType" => ""
      "properties.keyType" => ""
      "properties.connectionMode" => ""
      "properties.requestResourceId" => ""
      "properties.requestResourceType" => ""
      "time" => ""
      "TimeGenerated" => ""
      "TenantId" => ""
      "AccountType" => ""
      "Account" => ""
      "Computer" => ""
      "EventSourceName" => ""
      "EventID" => ""
      "Activity" => ""
      "CommandLine" => ""
      "Process" => ""
      "ProcessId" => ""
      "ParentProcessName" => ""
      "SubjectUserSid" => ""
      "SubjectDomainName" => ""
      "SubjectLogonId" => ""
      "SubjectUserName" => ""
      "TargetDomainName" => ""
      "TargetLogonId" => ""
      "TargetUserName" => ""
      "TargetUserSid" => ""
      "_ResourceId" => ""
      "_Internal_WorkspaceResourceId" => ""
      "TokenElevationType" => ""
      "Channel" => ""
      "Task" => ""
      "SourceSystem" => ""
      "SourceComputerId" => ""
      "EventOriginId" => ""
      "ManagementGroupName" => ""
      "FileHash" => ""
      "FilePath" => ""
      "UserName" => ""
      "domain" => ""
      "user_name" => ""
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "enconded_logs"
  }

  if [enconded_logs] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }

  if [properties][clientIpAddress] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "properties.clientIpAddress"
      }
    }
  }

  if [properties][region] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.location.country_or_region" => "%{properties.region}"
      }
    }
  }

  mutate {
    replace => {
      "query_text" => "%{properties.querytext}"
    }
    on_error => "query_not_found"
  }

  if [query_text] != "" {
    json {
      source => "query_text"
      array_function => "split_columns"
      target => "properties.querytext"
    }

    if [properties][querytext][query] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.process.command_line" => "%{properties.querytext.query}"
        }
      }
    }

    for parameter in properties.querytext.parameters {
      mutate {
        replace => {
          "parameter_label" => ""
          "param_value" => "false"
        }
      }

      mutate {
        convert => {
          "parameter.value" => "string"
        }
        on_error => "already_a_string"
      }

      mutate {
        replace => {
          "parameter_label.value.string_value" => "%{parameter.value}"
        }
        on_error => "parameter_value_not_found"
      }

      if ![parameter_value_not_found] {
        mutate {
          replace => {
            "param_value" => "true"
          }
        }
      }

      if [parameter_value_not_found] {
        for value in parameter.value {
          mutate {
            replace => {
              "tag_value_array" => ""
            }
          }
          mutate {
            replace => {
              "tag_value_array.string_value" => "%{value}"
            }
            on_error => "parameter_value_not_present"
          }

          if ![parameter_value_not_present] {
            mutate {
              replace => {
                "param_value" => "true"
              }
              merge => {
                "parameter_label.value.list_value.values" => "tag_value_array"
              }
            }
          }
        }
      }

      if [param_value] == "true" {
        mutate {
          replace => {
            "parameter_label.key" => "%{parameter.name}"
          }
          merge => {
            "event.idm.read_only_udm.additional.fields" => "parameter_label"
          }
        }
      }
    }
  }

  if [TimeGenerated] != "" {
    mutate {
      replace => {
        "time" => "%{TimeGenerated}"
      }
    }
  }

  if [time] != "" {
    date {
      match => ["time", "ISO8601"]
    }
  }

  if [properties][partialipaddress] != "" {
    mutate {
      merge => {
        "intermediary.ip" => "properties.partialipaddress"
      }
    }
  }

  if [properties][databasename] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.name" => "%{properties.databasename}"
      }
    }
  } else if [properties][databaseName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.name" => "%{properties.databaseName}"
      }
    }
  }

  if [properties][collectionname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.resource_subtype" => "%{properties.collectionname}"
      }
    }
  } else if [properties][collectionName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.resource_subtype" => "%{properties.collectionName}"
      }
    }
  }

  if [resourceId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.product_object_id" => "%{resourceId}"
        "event.idm.read_only_udm.target.resource.resource_type" => "DATABASE"
      }
    }

    grok {
      match => {
        "resourceId" => "/SUBSCRIPTIONS/(?P<subscription_id>.*?)/RESOURCEGROUPS/(?P<resource_group>.*?)/PROVIDERS/(?P<target_application>.*?)/DATABASEACCOUNTS/(?P<db_account>.*)"
      }
      overwrite => [ "subscription_id", "resource_group", "target_application", "db_account" ]
    }
  }

  if [target_application] != "" {
    mutate {
      rename => {
        "target_application" => "event.idm.read_only_udm.target.application"
      }
    }
  }

  if [properties][subscriptionid] != "" {
    mutate {
      replace => {
        "subscription_id_label.key" => "SubscriptionId"
        "subscription_id_label.value" => "%{properties.subscriptionid}"
      }
      merge => {
        "resource_attribute_labels" => "subscription_id_label"
      }
    }
  } else if [properties][subscriptionId] != "" {
    mutate {
      replace => {
        "subscription_id_label.key" => "SubscriptionId"
        "subscription_id_label.value" => "%{properties.subscriptionId}"
      }
      merge => {
        "resource_attribute_labels" => "subscription_id_label"
      }
    }
  } else if [subscription_id] != "" {
    mutate {
      replace => {
        "subscription_id_label.key" => "SubscriptionId"
        "subscription_id_label.value" => "%{subscription_id}"
      }
      merge => {
        "resource_attribute_labels" => "subscription_id_label"
      }
    }
  }

  if [properties][resourcegroupname] != "" {
    mutate {
      replace => {
        "resource_group_label.key" => "ResourceGroupName"
        "resource_group_label.value" => "%{properties.resourcegroupname}"
      }
      merge => {
        "resource_attribute_labels" => "resource_group_label"
      }
    }
  } else if [resource_group] != "" {
    mutate {
      replace => {
        "resource_group_label.key" => "ResourceGroupName"
        "resource_group_label.value" => "%{resource_group}"
      }
      merge => {
        "resource_attribute_labels" => "resource_group_label"
      }
    }
  }

  if [db_account] != "" {
    mutate {
      replace => {
        "db_account_label.key" => "DatabaseAccounts"
        "db_account_label.value" => "%{db_account}"
      }
      merge => {
        "resource_attribute_labels" => "db_account_label"
      }
    }
  }

  if [properties][requestResourceType] != "" {
    mutate {
      replace => {
        "request_resource_type_label.key" => "requestResourceType"
        "request_resource_type_label.value" => "%{properties.requestResourceType}"
      }
    }
    mutate {
      merge => {
        "resource_attribute_labels" => "request_resource_type_label"
      }
    }
  }

  if [properties][requestResourceId] != "" {
    mutate {
      replace => {
        "request_resource_id_label.key" => "requestResourceId"
        "request_resource_id_label.value" => "%{properties.requestResourceId}"
      }
    }
    mutate {
      merge => {
        "resource_attribute_labels" => "request_resource_id_label"
      }
    }
  }

  mutate {
    rename => {
      "resource_attribute_labels" => "event.idm.read_only_udm.target.resource.attribute.labels"
    }
  }

  if [properties][numberofrowsreturned] != "" {
    mutate {
      replace => {
        "number_of_rows_returned_label.key" => "NumberOfRowsReturned"
        "number_of_rows_returned_label.value.string_value" => "%{properties.numberofrowsreturned}"
      }
    }
    mutate {
      convert => {
        "number_of_rows_returned_label.value.string_value" => "float"
      }
      on_error => "not_a_number"
    }

    if ![not_a_number] {
      mutate {
        rename => {
          "number_of_rows_returned_label.value.string_value" => "number_of_rows_returned_label.value.number_value"
        }
      }
    }

    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "number_of_rows_returned_label"
      }
    }
  }

  if [properties][signature] != "" {
    mutate {
      replace => {
        "signature_label.key" => "signature"
        "signature_label.value.string_value" => "%{properties.signature}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "signature_label"
      }
    }
  }

  if [properties][shapesignature] != "" {
    mutate {
      replace => {
        "shapesignature_label.key" => "shapesignature"
        "shapesignature_label.value.string_value" => "%{properties.shapesignature}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "shapesignature_label"
      }
    }
  }

  if [properties][partitionId] != "" {
    mutate {
      replace => {
        "partition_id_label.key" => "partitionId"
        "partition_id_label.value.string_value" => "%{properties.partitionId}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "partition_id_label"
      }
    }
  }

  if [properties][collectionRid] != "" {
    mutate {
      replace => {
        "collection_rid_label.key" => "collectionRid"
        "collection_rid_label.value.string_value" => "%{properties.collectionRid}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "collection_rid_label"
      }
    }
  }

  if [properties][activityId] != "" {
    mutate {
      replace => {
        "activity_id_label.key" => "activityId"
        "activity_id_label.value.string_value" => "%{properties.activityId}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "activity_id_label"
      }
    }
  }

  if [properties][authTokenType] != "" {
    mutate {
      replace => {
        "auth_token_type_label.key" => "authTokenType"
        "auth_token_type_label.value.string_value" => "%{properties.authTokenType}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "auth_token_type_label"
      }
    }
  }

  if [properties][keyType] != "" {
    mutate {
      replace => {
        "key_type_label.key" => "keyType"
        "key_type_label.value.string_value" => "%{properties.keyType}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "key_type_label"
      }
    }
  }

  if [properties][connectionMode] != "" {
    mutate {
      replace => {
        "connection_mode_label.key" => "connectionMode"
        "connection_mode_label.value.string_value" => "%{properties.connectionMode}"
      }
      merge => {
        "event.idm.read_only_udm.additional.fields" => "connection_mode_label"
      }
    }
  }

  if [operationName] != "" {
    mutate {
      replace => {
        "operation_name_label.key" => "operationName"
        "operation_name_label.value.string_value" => "%{operationName}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "operation_name_label"
      }
    }
  }

  if [properties][useragent] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{properties.useragent}"
      }
    }
  } else if [properties][userAgent] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{properties.userAgent}"
      }
    }
  }

  if [properties][statusCode] != "" {
    mutate {
      replace => {
        "network.http.response_code" => "%{properties.statusCode}"
      }
    }

    mutate {
      convert => {
        "network.http.response_code" => "integer"
      }
    }
  }

  if [properties][requestLength] != "" {
    mutate {
      replace => {
        "network.sent_bytes" => "%{properties.requestLength}"
      }
      convert => {
        "network.sent_bytes" => "uinteger"
      }
    }
  }

  if [properties][responseLength] != "" {
    mutate {
      replace => {
        "network.received_bytes" => "%{properties.responseLength}"
      }
      convert => {
        "network.received_bytes" => "uinteger"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [properties][queryexecutionstatus] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{properties.queryexecutionstatus}"
      }
    }
  }

  if [TenantId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_deployment_id" => "%{TenantId}"
      }
    }
  }

  if [UserName] != "" {
    mutate {
      replace => {
        "Account" => "%{UserName}"
      }
    }
  }

  if [Account] != "" {
    grok {
      match => {
        "Account" => "%{GREEDYDATA:domain}\\\\%{GREEDYDATA:user_name}"
      }
      overwrite => ["domain", "user_name"]
      on_error => "no_domain"
    }
    if ![no_domain] {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.user_display_name" => "%{user_name}"
        }
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.administrative_domain" => "%{domain}"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{Account}"
        }
      }
    }
  }

  if [Computer] != "" {
     mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{Computer}"
      }
    }
  }

  if [EventSourceName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{EventSourceName}"
      }
    }
    if [EventSourceName] =~ "(?i)Windows" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.platform" => "WINDOWS"
        }
      }
    }
    else if [EventSourceName] =~ "(?i)mac" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.platform" => "MAC"
        }
      }
    }
    else if [EventSourceName] =~ "(?i)Linux" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.platform" => "LINUX"
        }
      }
    }
  }

  if [EventID] != "" {
    mutate {
      convert => {
        "EventID" => "string"
      }
      on_error => "already_a_string"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{EventID}"
      }
    }
  }

  if [Activity] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{Activity}"
      }
    }
  }

  if [CommandLine] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.command_line" => "%{CommandLine}"
      }
    }
  }

  if [Process] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.file.full_path" => "%{Process}"
      }
    }
  }

  if [ProcessId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.pid" => "%{ProcessId}"
      }
    }
  }

  if [ParentProcessName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.parent_process.file.full_path" => "%{ParentProcessName}"
      }
    }
  }

  if [SubjectUserSid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.windows_sid" => "%{SubjectUserSid}"
      }
    }
  }

  if [SubjectDomainName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.administrative_domain" => "%{SubjectDomainName}"
      }
    }
  }

  if [SubjectLogonId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{SubjectLogonId}"
      }
    }
  }

  if [SubjectUserName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.user_display_name" => "%{SubjectUserName}"
      }
    }
  }

  if [TargetDomainName] not in  ["", "-"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.administrative_domain" => "%{TargetDomainName}"
      }
    }
  }

  if [TargetLogonId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{TargetLogonId}"
      }
    }
  }

  if [TargetUserName] not in  ["", "-"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.user_display_name" => "%{TargetUserName}"
      }
    }
  }

  if [TargetUserSid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.windows_sid" => "%{TargetUserSid}"
      }
    }
  }

  if [_ResourceId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.resource.product_object_id" => "%{_ResourceId}"
        "event.idm.read_only_udm.target.resource.resource_type" => "DATABASE"
      }
    }
  }

  if [_Internal_WorkspaceResourceId] != "" {
    mutate {
      replace => {
        "Workspace_Resource_Id.value" => "%{_Internal_WorkspaceResourceId}"
        "Workspace_Resource_Id.key" => "Internal Workspace Resource Id"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.resource.attribute.labels" => "Workspace_Resource_Id"
      }
    }
  }

  if [TokenElevationType] != "" {
    mutate {
      replace => {
        "Token_Elevation_Type.value" => "%{TokenElevationType}"
        "Token_Elevation_Type.key" => "Token Elevation Type"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.resource.attribute.labels" => "Token_Elevation_Type"
      }
    }
  }

  if [Channel] != "" {
    mutate {
      replace => {
        "additional_Channel.key" => "Channel"
        "additional_Channel.value.string_value" => "%{Channel}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_Channel"
      }
    }
  }

  if [Task] != "" {
    mutate {
      replace => {
        "additional_Task.key" => "Task"
        "additional_Task.value.string_value" => "%{Task}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_Task"
      }
    }
  }

  if [SourceSystem] != "" {
    mutate {
      replace => {
        "additional_Source_System.key" => "Source System"
        "additional_Source_System.value.string_value" => "%{SourceSystem}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_Source_System"
      }
    }
  }

  if [SourceComputerId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.asset_id" => "SourceComputerId:%{SourceComputerId}"
      }
    }
  }

  if [EventOriginId] != "" {
    mutate {
      replace => {
        "additional_Event_Origin_Id.key" => "Event Origin Id"
        "additional_Event_Origin_Id.value.string_value" => "%{EventOriginId}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_Event_Origin_Id"
      }
    }
  }

  if [ManagementGroupName] != "" {
    mutate {
      replace => {
        "additional_Management_Group_Name.key" => "Management Group Name"
        "additional_Management_Group_Name.value.string_value" => "%{ManagementGroupName}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_Management_Group_Name"
      }
    }
  }

  if [FilePath] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{FilePath}"
      }
    }
  }

  if [FileHash] != "" {
    mutate {
      lowercase => ["FileHash"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.sha256" => "%{FileHash}"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "Azure Cosmos DB"
      "event.idm.read_only_udm.metadata.vendor_name" => "Microsoft"
      "event.idm.read_only_udm.metadata.event_type" => "USER_RESOURCE_ACCESS"
    }
  }

  if [category] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{category}"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
