# Product: WINDCHILL
# Category: Lifecycle Management Software
# Supported Format: SYSLOG
# Reference: NA
# Last Updated: 2024-11-21
# Copyright 2024 Chronicle LLC

filter{
  mutate{
    replace => {
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "additional" => ""
      "ipaddress" => ""
      "domainpath" => ""
      "eventlabel" => ""
      "eventtime" => ""
      "folderpath" => ""
      "lifecyclestate" => ""
      "targetname" => ""
      "targetnumber" => ""
      "targettype" => ""
      "username" => ""
      "version" => ""
      "eventtype" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "has_principal_user" => "false"
      "has_target_resource" => "false"
    }
  }
  grok{
    match => {
      "message" => [
        "%{IPORHOST:ipaddress}\\|\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|\\|\\|\\|\\|%{DATA:targettype}\\|%{DATA:username}\\|"
        "%{IPORHOST:ipaddress}\\|%{DATA:domainpath}\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|\\|\\|%{DATA:targetname}\\|\\|%{DATA:targettype}\\|%{DATA:username}\\|"
        "%{IPORHOST:ipaddress}\\|%{DATA:domainpath}\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|%{DATA:folderpath}\\|%{DATA:lifecyclestate}\\|%{DATA:targetname}\\|%{DATA:targetnumber}\\|%{DATA:targettype}\\|%{DATA:username}\\|%{GREEDYDATA:version}"
        "%{IPORHOST:ipaddress}\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|\\|\\|\\|\\|\\|%{GREEDYDATA:username}\\|"
        "%{IPORHOST:ipaddress}\\|%{DATA:domainpath}\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|\\|%{DATA:lifecyclestate}\\|%{DATA:targetname}\\|%{INT:targetnumber}\\|%{DATA:targettype}\\|%{DATA:username}\\|%{GREEDYDATA:version}"
        "%{IPORHOST:ipaddress}\\|%{DATA:domainpath}\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|\\|%{DATA:lifecyclestate}\\|%{DATA:targetname}\\|\\|%{DATA:targettype}\\|%{DATA:username}\\|"
        "%{IPORHOST:ipaddress}\\|%{DATA:domainpath}\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|\\|\\|\\|\\|%{DATA:targettype}\\|%{DATA:username}\\|"
        "%{IPORHOST:ipaddress}\\|%{DATA:domainpath}\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|%{DATA:folderpath}\\|\\|%{DATA:targetname}\\|\\|%{DATA:targettype}\\|%{DATA:username}\\|"
        "%{IPORHOST:ipaddress}\\|%{DATA:domainpath}\\|%{DATA:eventlabel}\\|%{DATA:eventtime}\\|\\|\\|%{DATA:targetname}\\|\\|%{DATA:targettype}\\|%{DATA:username}\\|"
      ]
    }
    overwrite => ["ipaddress", "domainpath", "eventlabel", "eventtime", "folderpath", "lifecyclestate", "targetname", "targetnumber", "targettype", "username", "version"]
    on_error => "grok_failed"
  }
  if [ipaddress] != "" {
    grok {
      match => {
        "ipaddress" => "%{IP:ipaddress}"
      }
      overwrite => ["ipaddress"]
      on_error => "not_an_ip"
    }
    if ![not_an_ip] {
      mutate {
        merge => {
          "principal.ip" => "ipaddress"
          "principal.asset.ip" => "ipaddress"
        }
        replace => {
          "has_principal" => "true"
        }
        on_error => "ip_merge_error"
      }
    }
    else {
      mutate {
        replace => {
          "principal.hostname" => "%{ipaddress}"
          "principal.asset.hostname" => "%{ipaddress}"
          "has_principal" => "true"
        }
        on_error => "hostname_not_found"
      }
    }
  }
  if [domainpath] != "" {
    mutate {
      replace => {
        "principal.administrative_domain" => "%{domainpath}"
      }
      on_error => "invalid_domain"
    }
  }
  if [eventlabel] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{eventlabel}"
      }
      on_error => "eventlabel_error"
    }
  }
  if [eventtime] != "" {
    date {
      match => ["eventtime", "SYSLOGTIMESTAMP", "ISO8601" ]
      rebase => true
      on_error => "diff_format"
      target => "metadata.event_timestamp"
    }
  }
  if [folderpath] != "" {
    mutate {
      replace => {
        "principal.process.file.full_path" => "%{folderpath}"
      }
      on_error => "folderpath_error"
    }
  }
  if [lifecyclestate] != "" {
    mutate {
      replace => {
        "lifecyclestate_label.key" => "lifecyclestate"
        "lifecyclestate_label.value" => "%{lifecyclestate}"
      }
      on_error => "lifecyclestate_label_invalid"
    }
    if ![lifecyclestate_label_invalid] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "lifecyclestate_label"
        }
        on_error => "lifecyclestate_label_merge_failed"
      }
    }
  }
  if [targetname] != "" {
    mutate {
      replace => {
        "targetname_label.key" => "targetname"
        "targetname_label.value" => "%{targetname}"
        "has_target_resource" => "true"
      }
      on_error => "targetname_invalid"
    }
    if ![targetname_invalid] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "targetname_label"
        }
        on_error => "targetname_label_merge_failed"
      }
    }
  }
  if [targetnumber] != "" {
    mutate {
      replace => {
        "targetnumber_label.key" => "targetnumber"
        "targetnumber_label.value" => "%{targetnumber}"
        "has_target_resource" => "true"
      }
      on_error => "targetnumber_invalid"
    }
    if ![targetnumber_invalid] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "targetnumber_label"
        }
        on_error => "targetnumber_label_merge_failed"
      }
    }
  }
  if [targettype] != "" {
    mutate {
      replace => {
        "targettype_label.key" => "targettype"
        "targettype_label.value" => "%{targettype}"
        "has_target_resource" => "true"
      }
      on_error => "targettype_invalid"
    }
    if ![targettype_invalid] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "targettype_label"
        }
        on_error => "targettype_label_merge_failed"
      }
    }
  }
  if [username] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{username}"
        "has_principal_user" => "true"
      }
    }
  }
  if [version] != "" {
    mutate {
      replace => {
        "metadata.product_version" => "%{version}"
      }
      on_error => "version_error"
    }
  }
  if [grok_failed] {
    mutate {
      replace => {
        "metadata.product_name" => "Windchill"
        "metadata.vendor_name" => "PTC"
        "metadata.event_type" => "USER_RESOURCE_ACCESS"
        "ohost" => ""
        "dbname" => ""
        "dbschema" => ""
        "phost" => ""
        "context" => ""
        "namespace" => ""
        "domain_name" => ""
        "eventkey" => ""
        "eventlabel" => ""
        "time" => ""
        "target_path" => ""
        "lifecyclestate" => ""
        "target_classname" => ""
        "targetid" => ""
        "target_identity" => ""
        "target_name" => ""
        "target_number" => ""
        "target_securitylabels" => ""
        "target_subtype" => ""
        "description" => ""
        "user_product_object_id" => ""
        "user" => ""
      }
    }
    mutate {
      gsub => ["message",'\"','']
    }
    csv {
      source => "message"
      field_split => ","
      on_error => "csv_error"
    }
    mutate {
      replace => {
        "ohost" => "%{column1}"
      }
      on_error => "ohost_error"
    }
    mutate {
      replace => {
        "dbname" => "%{column2}"
      }
      on_error => "dbname_error"
    }
    mutate {
      replace => {
        "dbschema" => "%{column3}"
      }
      on_error => "dbschema_error"
    }
    mutate {
      replace => {
        "phost" => "%{column4}"
      }
      on_error => "phost_error"
    }
    mutate {
      replace => {
        "context" => "%{column9}"
      }
      on_error => "context_error"
    }
    mutate {
      replace => {
        "namespace" => "%{column10}"
      }
      on_error => "namespace_error"
    }
    mutate {
      replace => {
        "domain_name" => "%{column13}"
      }
      on_error => "domain_name_error"
    }
    mutate {
      replace => {
        "eventkey" => "%{column16}"
      }
      on_error => "eventkey_error"
    }
    mutate {
      replace => {
        "eventlabel" => "%{column17}"
      }
      on_error => "eventlabel_error"
    }
    mutate {
      replace => {
        "time" => "%{column18}"
      }
      on_error => "time_error"
    }
    mutate {
      replace => {
        "target_path" => "%{column19}"
      }
      on_error => "target_path_error"
    }
    mutate {
      replace => {
        "lifecyclestate" => "%{column21}"
      }
      on_error => "lifecyclestate_error"
    }
    mutate {
      replace => {
        "target_classname" => "%{column31}"
      }
      on_error => "target_classname_error"
    }
    mutate {
      replace => {
        "targetid" => "%{column32}"
      }
      on_error => "targetid_error"
    }
    mutate {
      replace => {
        "target_identity" => "%{column33}"
      }
      on_error => "target_identity_error"
    }
    mutate {
      replace => {
        "target_name" => "%{column34}"
      }
      on_error => "target_name_error"
    }
    mutate {
      replace => {
        "target_number" => "%{column35}"
      }
      on_error => "target_number_error"
      }
    mutate {
      replace => {
        "target_securitylabels" => "%{column38}"
      }
      on_error => "target_securitylabels_error"
    }
    mutate {
      replace => {
        "target_subtype" => "%{column39}"
      }
      on_error => "target_subtype_error"
    }
    mutate {
      replace => {
        "description" => "%{column48}"
      }
      on_error => "description_error"
    }
    mutate {
      replace => {
        "user_product_object_id" => "%{column51}"
      }
      on_error => "user_product_object_id_error"
    }
    mutate {
      replace => {
        "user" => "%{column52}"
      }
      on_error => "user_error"
    }

    # product_deployment_id (EBS environment)
    if [dbname] != "" {
      mutate {
        replace => {
          "metadata.product_deployment_id" => "%{dbname}"
        }
        on_error => "dbname_error"
      }
    }
    # ingestion_labels (Database schema)
    if [dbschema] != "" {
      mutate {
        replace => {
          "db_schema.key" => "DBSCHEMA"
          "db_schema.value" => "%{dbschema}"
        }
        on_error => "dbschema_error"
      }
      mutate {
        merge => {
          "metadata.ingestion_labels" => "db_schema"
        }
        on_error => "dbschema_merge_error"
      }
    }
    # product_log_id
    if [context] != "" {
      mutate {
        replace => {
          "metadata.product_log_id" => "%{context}"
        }
        on_error => "context_error"
      }
    }
    # product_event_type
    if [eventlabel] != "" {
      mutate {
        replace => {
          "metadata.product_event_type" => "%{eventlabel}"
          }
        on_error => "eventlabel_error"
      }
    }
    # description
    if [description] != "" {
      mutate {
        replace => {
          "metadata.product_event_type" => "%{description}"
        }
        on_error => "description_error"
      }
    }

    if [ohost] != "" {
      grok {
        match => {
          ohost => "%{IP:ohost}"
        }
        on_error => "not_oip"
        overwrite => ["ohost"]
      }
      if ![not_oip] {
        mutate {
          merge => {
            "event.idm.read_only_udm.observer.ip" => "ohost"
          }
          on_error => "oip_merge_error"
        }
      }
      else if [ohost] != "" {
        mutate {
          replace => {
            "event.idm.read_only_udm.observer.hostname" => "%{ohost}"
          }
          on_error => "hostname_not_found"
        }
      }
    }

    if [phost] != "" {
      grok {
        match => {
          phost => "%{IP:phost}"
        }
        on_error => "not_pip"
        overwrite => ["phost"]
      }
      if ![not_pip] {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.ip" => "phost"
          }
          on_error => "pip_merge_error"
        }
      }
      else {
        mutate {
          replace => {
            "event.idm.read_only_udm.principal.hostname" => "%{phost}"
          }
          on_error => "hostname_not_found"
        }
      }
    }
    # product_object_id
    if [user_product_object_id] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.product_object_id" => "%{user_product_object_id}"
        }
        on_error => "product_object_id_error"
      }
    }
    if [user] != "" {
      grok {
        match => {
          user => "%{GREEDYDATA:user_display_name} \\(%{USERNAME:user_userid}:%{GREEDYDATA}$"
        }
        on_error => "grok_error"
      }
      if ![grok_error]{
        # display_name
        if [user_display_name] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.principal.user.user_display_name" => "%{user_display_name}"
            }
            on_error => "display_name_error"
          }
        }
        # userid
        if [user_userid] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.principal.user.userid" => "%{user_userid}"
            }
            on_error => "userid_error"
          }
        }
      }
    }
    # namespace
    if [namespace] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.namespace" => "%{namespace}"
        }
        on_error => "namespace_error"
      }
    }

    # domain.name
    if [domain_name] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.domain.name" => "%{domain_name}"
        }
        on_error => "domain_name_error"
      }
    }

    # file.full_path
    if [target_path] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.file.full_path" => "%{target_path}"
        }
        on_error => "target_path_error"
      }
    }
    # product_object_id
    if [target_identity] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.resource.product_object_id" => "%{target_identity}"
        }
        on_error => "target_identity_error"
      }
    }

    # name
    if [target_name] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.resource.name" => "%{target_name}"
        }
        on_error => "target_name_error"
      }
    }

    # number
    if [target_number] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.resource.id" => "%{target_number}"
        }
        on_error => "target_number_error"
      }
    }

    # subtype
    if [target_subtype] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.resource.resource_subtype" => "%{target_subtype}"
        }
        on_error => "target_subtype_error"
      }
    }
  }
  if [has_principal] == "true" and [has_principal_user] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_LOGIN"
      }
    }
  }
  else if [has_target_resource] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_RESOURCE_ACCESS"
      }
    }
  }
  else if [has_principal] == "true" and [has_principal_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

