# Product: VIRTRU_EMAIL_ENCRYPTION
# Category: EMAIL SERVER
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2024-12-19
# Copyright 2024 Chronicle LLC
filter {
  mutate {
    replace => {
      "event" => ""
      "principal" => ""
      "target" => ""
      "security_result" => ""
      "metadata" => ""
      "network" => ""
      "id" => ""
      "object.type" => ""
      "object.id" => ""
      "object.name"=> ""
      "email" => ""
      "action.type" => ""
      "action.result" => ""
      "owner.id" => ""
      "owner.orgId" => ""
      "actor.id" => ""
      "actor.attributes" => ""
      "clientInfo.userAgent" => ""
      "clientInfo.platform" => ""
      "clientInfo.requestIp" => ""
      "eventMetaData.auditDataType" => ""
      "eventMetaData.auditRecordId" => ""
      "eventMetaData.auditRecordType" => ""
      "log" => ""
      "prin_host" => ""
      "app" => ""
      "pid" => ""
      "desc" => ""
      "prin_ip" => ""
      "datetime" => ""
      "timestamp" => ""
      "has_principal" => ""
      "has_user" => ""
      "has_target_file" => ""
    }
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "json_failed"
  }
  if [json_failed] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  if [log] != "" {
    mutate {
      gsub => ["log", "\\r\\n", ""]
    }
    grok {
      match => {
        "log" => [
          "%{SYSLOGTIMESTAMP:datetime} %{DATA:prin_host} %{DATA:app}\\[%{INT:pid}\\]: (?P<desc>.*(%{IP:prin_ip})?.*)",
          "%{TIMESTAMP_ISO8601:datetime} %{DATA}: %{DATA:prin_host} Message-ID:.*"
        ]
      }
      overwrite => ["datetime", "prin_host", "app", "pid", "desc", "prin_ip"]
      on_error => "log_grok_failed"
    }
  }

  if [desc] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{desc}"
      }
      on_error => "desc_empty"
    }
  }
  if [pid] != "" {
    mutate {
      replace => {
        "principal.process.pid" => "%{pid}"
      }
      on_error => "pid_empty"
    }
  }
  if [prin_host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{prin_host}"
        "principal.asset.hostname" => "%{prin_host}"
        "has_principal" => "true"
      }
      on_error => "prin_host_empty"
    }
  }
  if [prin_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "prin_ip"
        "principal.asset.ip" => "prin_ip"
      }
      on_error => "prin_ip_empty"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }

  if [id] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{id}"
      }
      on_error => "id_invalid"
    }
  }
  if [object][type] != "" {
    mutate {
      replace => {
        "objtype_label.key" => "object_type"
        "objtype_label.value.string_value" => "%{object.type}"
      }
      on_error => "object_type_invlaid"
    }
    if ![object_type_invlaid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "objtype_label"
        }
        on_error => "object_type_merge_failed"
      }
    }
  }
  if [object][id] != "" {
    mutate {
      replace => {
        "objid_label.key" => "object_id"
        "objid_label.value.string_value" => "%{object.id}"
      }
      on_error => "object_id_invalid"
    }
    if ![object_id_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "objid_label"
        }
        on_error => "object_id_merge_failed"
      }
    }
  }
  if [object][name] != "" {
    if [eventMetaData][auditDataType] =~ "EMAIL" {
      mutate {
        merge => {
          "network.email.subject" => "object.name"
        }
        on_error => "no_subject"
      }
    }
    else if [eventMetaData][auditDataType] =~ "FILE" {
      mutate {
        replace => {
          "target.file.full_path" => "%{object.name}"
          "has_target_file" => "true"
        }
        on_error => "no_file"
      }
    }
    else if [eventMetaData][auditDataType] =~ "USER" {
      mutate {
        merge => {
          "principal.user.email_addresses" => "object.name"
        }
        on_error => "no_user"
      }
      if ![no_user] {
        mutate {
          replace => {
            "has_user" => "true"
          }
        }
      }
    }
  }
  for email in object.attributes.dissem {
    if [email] =~ "^.+@.+$" {
      mutate {
        merge => {
          "network.email.to" => "email"
          "target.user.email_addresses" => "email"
        }
        on_error => "object_attributes_dissem_error"
      }
      if ![object_attributes_dissem_error] {
        mutate {
          replace => {
            "has_user" => "true"
          }
        }
      }
    }
  }
  for attributelabel in object.attributes.attrs {
    mutate {
      replace => {
        "attri_label" => ""
        "attrikey" => ""
      }
    }
    mutate {
      replace => {
        "attrikey" => "%{attributelabel.key}"
      }
    }
    if [attrikey] == "virtru:data:policy:type" {
      mutate {
        replace => {
          "metadata.description" => "%{attributelabel.value}"
        }
        on_error => "metadata_description_invalid"
      }
    }
    else if [attrikey] == "virtru:data:owner" {
      mutate {
        replace => {
          "event.idm.read_only_udm.src.user.user_display_name" => "%{attributelabel.value}"
        }
        on_error => "user_display_name_invalid"
      }
    }
    else if [attrikey] =~ "virtru:data:org:(.*?):group" {
      mutate {
        merge => {
          "target.group.email_addresses" => "attributelabel.value"
        }
        on_error => "attrilabel_invalid"
      }
    }
    else {
      mutate {
        replace => {
          "attri_label.key" => "%{attributelabel.key}"
          "attri_label.value" => "%{attributelabel.value}"
        }
        on_error => "attri_label_invalid"
      }
      if ![attri_label_invalid] {
        mutate {
          merge => {
            "target.resource.attribute.labels" => "attri_label"
          }
          on_error => "no_attri_label"
        }
      }
    }
  }
  if [action][type] != "" {
    mutate {
      replace => {
        "action_label.value" => "%{action.type}"
        "action_label.key" => "action_type"
      }
      on_error => "no_action_type"
    }
    if ![no_action_type] {
      mutate {
        merge => {
          "security_result.detection_fields" => "action_label"
        }
        on_error => "action_type_merge_failed"
      }
    }
  }
  if [action][result] != "" {
    mutate {
      replace => {
        "action_result_label.value" => "%{action.result}"
        "action_result_label.key" => "action_result"
      }
      on_error => "no_action_result"
    }
    if ![no_action_result] {
      mutate {
        merge => {
          "security_result.detection_fields" => "action_result_label"
        }
        on_error => "action_result_merge_failed"
      }
    }
  }
  if [owner][orgId] != "" {
    mutate {
      replace => {
        "orgId_label.key" => "owner_orgId"
        "orgId_label.value.string_value" => "%{owner.orgId}"
      }
      on_error => "owner_orgId_invalid"
    }
    if ![owner_orgId_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "orgId_label"
        }
        on_error => "owner_orgId_merge_failed"
      }
    }
  }
  if [actor][id] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{actor.id}"
      }
      on_error => "actor_id_invalid"
    }
    if [actor][id] =~ "^.+@.+$" {
      mutate {
        merge => {
          "principal.user.email_addresses" => "actor.id"
        }
        on_error => "no_actor_email"
      }
      if ![no_actor_email] {
        mutate {
          replace => {
            "has_user" => "true"
          }
        }
      }
    }
  }
  for actorattributes in actor.attributes.attributes {
    mutate {
        replace => {
          "actor_attri_label" => ""
        }
    }
    if [actorattributes][key] =~ "virtru:user:access:org:(.*?):group" {
      mutate {
        merge => {
          "principal.group.email_addresses" => "actorattributes.value"
        }
        on_error => "no_actor_attributes"
      }
    }
    else {
      mutate {
        convert => {
          "actorattributes.value" => "string"
        }
        on_error => "actor_attributes_value_invalid"
      }
      mutate {
        replace => {
          "actor_attri_label.key" => "%{actorattributes.key}"
          "actor_attri_label.value" => "%{actorattributes.value}"
        }
        on_error => "actor_attri_label_invalid"
      }
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "actor_attri_label"
        }
        on_error => "merge_failed"
      }
    }
  }
  if [clientInfo][requestIp] != "" {
    mutate {
      merge => {
        "principal.ip" => "clientInfo.requestIp"
        "principal.asset.ip" => "clientInfo.requestIp"
      }
      on_error => "clientInfo_requestIp_error"
    }
    if ![clientInfo_requestIp_error] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
    if [clientInfo][platform] != "" {
      mutate{
        replace => {
          "platform_label.key" => "clientInfo_platform"
          "platform_label.value.string_value" => "%{clientInfo.platform}"
        }
        on_error => "clientInfo_platform_invalid"
      }
      mutate{
        merge => {
          "event.idm.read_only_udm.additional.fields" => "platform_label"
        }
        on_error => "clientInfo_platform_merge_failed"
      }
    }
  }
  if [clientInfo][userAgent] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{clientInfo.userAgent}"
      }
      on_error => "clientInfo_userAgent_error"
    }
    mutate {
      convert => {
        "clientInfo.userAgent" => "parseduseragent"
      }
      on_error => "clientInfo_userAgent_convert_error"
    }
    mutate {
      rename => {
        "clientInfo.userAgent" => "network.http.parsed_user_agent"
      }
    }
  }
  if [timestamp] != "" {
    date {
      match => ["timestamp","ISO8601","yyyy-MM-ddTHH:mm:ss.SSZ"]
      target => "metadata.event_timestamp"
      on_error => "no_event_received_time"
    }
  }
  if [eventMetaData][auditDataType] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{eventMetaData.auditDataType}"
      }
      on_error => "eventMetaData_auditDataType_invalid"
    }
  }
  if [eventMetaData][auditRecordId] != "" {
    mutate{
      replace => {
        "audit_RecordId.value.string_value" => "%{eventMetaData.auditRecordId}"
        "audit_RecordId.key" => "auditRecordId"
      }
      on_error => "audit_RecordId_invalid"
    }
    if ![audit_RecordId_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "audit_RecordId"
        }
        on_error => "audit_RecordId_merge_failed"
      }
    }
  }
  if [eventMetaData][auditRecordType] != "" {
    mutate{
      replace => {
        "audit_RecordType.value.string_value" => "%{eventMetaData.auditRecordType}"
        "audit_RecordType.key" => "auditRecordType"
      }
      on_error => "audit_RecordType_invalid"
    }
    if ![audit_RecordType_invalid] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "audit_RecordType"
        }
        on_error => "audit_RecordType_merge_failed"
      }
    }
  }
  mutate{
    replace =>{
      "metadata.vendor_name" => "virtru"
      "metadata.product_name" => "virtru encrytion"
    }
  }
  if [eventMetaData][auditDataType] =~ "EMAIL" {
    mutate {
      replace => {
        "metadata.event_type" => "EMAIL_TRANSACTION"
      }
    }
  }
  else if [eventMetaData][auditDataType] =~ "FILE" and [has_target_file] == "true" and [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "FILE_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
