# Product: Ipswitch SFTP
# Category: Data Transfer
# Supported Format: SYSLOG+KV, JSON
# Reference: https://docs.ipswitch.com/WS_FTP_Server61/Help/index.htm?logging_server_events.htm?toc.htm
# Last Updated: 2025-05-14
# Copyright 2022 Chronicle LLC

filter {
  mutate {
    replace => {
      "doc.absfile" => ""
      "doc.cmd" => ""
      "doc.description" => ""
      "doc.filesize" => ""
      "doc.host" => ""
      "doc.params" => ""
      "doc.service" => ""
      "doc.user" => ""
      "host.hostname" => ""
      "host.mac.0" => ""
      "host.os.build" => ""
      "host.os.kernel" => ""
      "host.os.platform" => ""
      "src_ip" => ""
      "dst_ip" => ""
      "about" => ""
      "program" => ""
      "event_message" => ""
      "logstash.irm_region" => ""
      "logstash.irm_site" => ""
      "logstash.irm_environment" => ""
      "logstash.process.hostname" => ""
      "syslog_host" => ""
      "username" => ""
      "geoip_src.longitude" => ""
      "event_type" => "GENERIC_EVENT"
      "geoip_src.latitude" => ""
      "syslog_severity" => ""
      "hostname" => ""
      "tags" => ""
      "logstash.ingest.hostname" => ""
      "logstash.collect.hostname" => ""
      "intermediary" => ""
      "time" => ""
      "user_id" => ""
      "kv_data1" => ""
      "kv_data2" => ""
      "has_principal" => "false"
      "has_user" => "false"
      "has_target" => "false"
      "Host" => ""
      "SessionID" => ""
      "Listener" => ""
      "listener_ip" => ""
      "listener_port" => ""
      "Client" => ""
      "client_ip" => ""
      "client_port" => ""
      "Command" => ""
      "description" => ""
      "User" => ""
      "channel" => ""
      "target_user" => ""
      "target_host" => ""
    }
  }

  if [message] !~ "host.:{" {
    mutate {
      gsub => ["message", "\"host\"", "\"hostname\""]
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json_format"
  }

  mutate {
    rename => {
      "@timestamp" => "original_timestamp"
    }
    on_error => "timestamp_not_present"
  }
  if ![not_json_format] {
    date {
      match => ["original_timestamp", "RFC3339", "ISO8601"]
      on_error => "timestamp_not_present"
    }

    if [src_ip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "src_ip"
        }
        on_error => "src_ip_not_present"
      }
    }

    if [doc][user] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{doc.user}"
        }
        on_error => "user_not_present"
      }
    } else if [username] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{username}"
        }
        on_error => "username_not_present"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.city" => "%{geoip_src.city_name}"
      }
      on_error => "city_name_not_present"
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.principal.location.country_or_region" => "%{geoip_src.country_name}"
      }
      on_error => "country_name_not_present"
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.principal.port" => "%{src_port}"
      }
      on_error => "src_port_not_present"
    }

    if ![src_port_not_present] {
      mutate {
        convert => {
          "event.idm.read_only_udm.principal.port" => "integer"
        }
        on_error => "src_port_not_present"
      }
    }

    if [geoip_src][latitude] != "" {
      mutate {
        rename => {
          "geoip_src.latitude" => "event.idm.read_only_udm.principal.location.region_latitude"
        }
        on_error => "latitude_not_present"
      }
    }
    if [geoip_src][longitude] != "" {
      mutate {
        rename => {
          "geoip_src.longitude" => "event.idm.read_only_udm.principal.location.region_longitude"
        }
        on_error => "longitude_not_present"
      }
    }

    if [doc][host] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{doc.host}"
          "event.idm.read_only_udm.observer.hostname" => "%{doc.host}"
        }
        on_error => "host_not_present"
      }
    } else if [hostname] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{hostname}"
        }
        on_error => "hostname_not_present"
      }
    }

    if [doc][service] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.application" => "%{doc.service}"
        }
        on_error => "service_not_present"
      }
    } else if [program] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.application" => "%{program}"
        }
        on_error => "program_not_present"
      }
    }

    if [event_message] != "" {
      mutate {
        replace => {
          "doc.description" => "%{event_message}"
        }
        on_error => "event_message_not_present"
      }
    }

    if [doc][absfile] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.file.full_path" => "%{doc.absfile}"
        }
        on_error => "absfile_not_present"
      }
    }
    else if [doc][description] =~ "^/" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.file.full_path" => "%{doc.description}"
        }
        on_error => "description_not_present"
      }
    }
    else if [doc][description] =~ "^Translated " {
      grok {
        match => {
          "doc.description" => "^Translated '%{DATA:_absfile}'"
        }
        on_error => "absfile_not_present"
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.file.full_path" => "%{_absfile}"
        }
        on_error => "absfile_not_present"
      }
    }

    if [doc][filesize] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.process.file.size" => "%{doc.filesize}"
        }
        convert => {
          "event.idm.read_only_udm.principal.process.file.size" => "uinteger"
        }
        on_error => "filesize_not_present"
      }
    }

    mutate {
      replace => {
        "doc.cmd" => "%{command}"
      }
      on_error => "command_not_present"
    }

    mutate {
      replace => {
        "doc.params" => "%{parameters}"
      }
      on_error => "parameters_not_found"
    }

    if [doc][cmd] != "" {
      mutate {
        gsub => ["doc.cmd", "\\s+$", ""]
      }
      if [doc][service] in ["FTP", "SFTP", "channel"] or [program] in ["FTP", "SFTP", "channel"] {
        if [doc][params] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.network.ftp.command" => "%{doc.cmd} %{doc.params}"
            }
            on_error => "ftp_command_not_present"
          }
        } else {
          mutate {
            replace => {
              "event.idm.read_only_udm.network.ftp.command" => "%{doc.cmd}"
            }
            on_error => "ftp_command_not_present"
          }
        }
      } else {
        mutate {
          replace => {
            "event.idm.read_only_udm.principal.process.command_line" => "%{doc.cmd} %{doc.params}"
          }
          on_error => "command_not_present"
        }
      }
    }

    if [dst_ip] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "dst_ip"
        }
        on_error => "dst_ip_not_present"
      }
    }

    if [logstash][collect][hostname] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.observer.ip" => "logstash.collect.hostname"
        }
        on_error => "logstash_collect_hostname_not_present"
      }
    }

    if [host][mac][0] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.mac" => "host.mac.0"
        }
        on_error => "mac_not_present"
      }
    }

    if [host][os][kernel] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.platform_version" => "%{host.os.kernel}"
        }
        on_error => "kernel_not_present"
      }
    }

    if [host][os][build] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.platform_patch_level" => "%{host.os.build}"
        }
        on_error => "build_not_present"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.target.port" => "%{dst_port}"
      }
      on_error => "dst_port_not_present"
    }

    if ![dst_port_not_present] {
      mutate {
        convert => {
          "event.idm.read_only_udm.target.port" => "integer"
        }
        on_error => "dst_port_not_present"
      }
    }

    if [host][hostname] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "%{host.hostname}"
        }
        on_error => "hostname_not_present"
      }
    } else if [syslog_host] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.observer.hostname" => "%{syslog_host}"
        }
        on_error => "syslog_host_not_present"
      }
    }

    if [host][os][platform] =~ "(?i)windows" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.platform" => "WINDOWS"
        }
        on_error => "platform_not_present"
      }
    }
    else if [host][os][platform] =~ "(?i)Linux" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.platform" => "LINUX"
        }
        on_error => "platform_not_present"
      }
    }
    else if [host][os][platform] =~ "(?i)Mac" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.platform" => "MAC"
        }
        on_error => "platform_not_present"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{filename}"
      }
      on_error => "file_not_found"
    }

    mutate {
      replace => {
      "event.idm.read_only_udm.target.file.size" => "%{filesize_bytes}"
      }
      on_error => "file_size_not_found"
    }

    if ![file_size_not_found] {
      mutate {
        convert => {
          "event.idm.read_only_udm.target.file.size" => "uinteger"
        }
        on_error => "file_size_not_found"
      }
    }

    if [logstash][ingest][hostname] != "" {
      mutate {
        replace => {
          "intermediary.hostname" => "%{logstash.ingest.hostname}"
        }
        on_error => "ingest_hostname_not_present"
      }
    }

    if [tags] != "" {
      mutate {
        replace => {
          "tag_labels.key" => "tags"
        }
        on_error => "tags_not_present"
      }

      for tag in tags {
        mutate {
          replace => {
            "tag_value_array" => ""
          }
          on_error => "tag_not_present"
        }
        mutate {
          replace => {
            "tag_value_array.string_value" => "%{tag}"
          }
          merge => {
            "tag_labels.value.list_value.values" => "tag_value_array"
          }
          on_error => "tag_not_present"
        }
      }

      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "tag_labels"
        }
        on_error => "no_tags_found"
      }
    }

    if [logstash][irm_region] != "" {
      mutate {
        replace => {
          "irm_region_label.key" => "irm_region"
          "irm_region_label.value.string_value" => "%{logstash.irm_region}"
        }
        on_error => "irm_region_not_present"
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "irm_region_label"
        }
        on_error => "irm_region_not_present"
      }
    }

    if [logstash][irm_site] != "" {
      mutate {
        replace => {
          "irm_site_label.key" => "irm_site"
          "irm_site_label.value.string_value" => "%{logstash.irm_site}"
        }
        on_error => "irm_site_not_present"
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "irm_site_label"
        }
        on_error => "irm_site_not_present"
      }
    }

    if [logstash][irm_environment] != "" {
      mutate {
        replace => {
          "irm_environment_label.key" => "irm_environment"
          "irm_environment_label.value.string_value" => "%{logstash.irm_environment}"
        }
        on_error => "irm_environment_not_present"
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "irm_environment_label"
        }
        on_error => "irm_environment_not_present"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.url_back_to_product" => "%{log.file.path}"
      }
      on_error => "file_path_not_present"
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{session_id}"
      }
      on_error => "session_id_not_present"
    }

    if [doc][service] in ["FTP", "SFTP", "channel"] or [program] in ["FTP", "SFTP", "channel"] {
      if ([src_ip] != "" or [hostname] != "" or [doc][host] != "") and ([dst_ip] != "" or [host][hostname] != "" ) {
        mutate {
          replace => {
            "event_type" => "NETWORK_FTP"
          }
        }
      }
    }
    else if [doc][service] == "SSH" or [program] == "SSH" and ([dst_ip] != "" or [host][hostname] != "") {
      if [doc][description] =~ "(?i)(Connection established|Authentication)" {
        mutate {
          replace => {
            "event_type" => "USER_LOGIN"
          }
        }
      }
      else if [doc][description] =~ "(?i)close" and ([dst_ip] != "" or [host][hostname] != "") {
        mutate {
          replace => {
            "event_type" => "USER_LOGOUT"
          }
        }
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.extensions.auth.type" => "MACHINE"
        }
        on_error => "auth_type_not_present"
      }
    }

    if [event_type] =~ "GENERIC_" and [src_ip] != "" and [dst_ip] != "" {
      mutate {
        replace => {
          "event_type" => "NETWORK_UNCATEGORIZED"
        }
      }
    }

    if [doc][description] != "" and [doc][description] !~ "^(/|SFTP subsystem|SSH Transport agreed)" {
      mutate {
        replace => {
          "sec_result.description" => "%{doc.description}"
        }
      }
    }

    if [syslog_severity] != "" {
      if [syslog_severity] =~ "(?i)(error|warning)" {
        mutate {
          replace => {
            "sec_result.severity" => "HIGH"
          }
          on_error => "severity_not_present"
        }
      }
      else if [syslog_severity] =~ "(?i)notice" {
        mutate {
          replace => {
            "sec_result.severity" => "MEDIUM"
          }
          on_error => "severity_not_present"
        }
      }
      else if [syslog_severity] =~ "(?i)(information|info)" {
        mutate {
          replace => {
            "sec_result.severity" => "LOW"
          }
          on_error => "severity_not_present"
        }
      }
      mutate {
        replace => {
          "sec_result.severity_details" => "%{syslog_severity}"
        }
        on_error => "severity_not_present"
      }
    }

    mutate {
      replace => {
        "sec_result_action" => "ALLOW"
      }
      on_error => "sec_result_action_not_present"
    }

    mutate {
      merge => {
        "sec_result.action" => "sec_result_action"
      }
      on_error => "sec_result_action_not_present"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.ip_protocol" => "TCP"
      }
      on_error => "ip_protocol_not_present"
    }
  }
  else {
    mutate {
      gsub => ["message","\\r\\n",""]
    }
    mutate {
      gsub => ["message","\\n",""]
    }
    grok {
      match => {
        "message" => ["<%{INT}>%{SYSLOGTIMESTAMP:time} %{DATA:hostname} %{DATA:channel}: %{DATA:description}\\s+(:\\s+%{DATA:user_id})?<%{DATA:kv_data1}>(<%{GREEDYDATA:kv_data2}>)?"]
      }
      on_error => "invalid_grok_format"
      overwrite => ["time","hostname","user_id", "kv_data1", "kv_data2", "description","channel"]
    }
    kv {
      source => "kv_data1"
      field_split => ","
      value_split => "="
      on_error => "kv_fail"
    }
    kv {
      source => "kv_data2"
      field_split => ","
      value_split => "="
      on_error => "kv_fail"
    }
    if [time] != "" {
      date {
        match => ["time", "MMM d HH:mm:ss"]
        rebase => true
        target => "event.idm.read_only_udm.metadata.event_timestamp"
        on_error => "timestamp_not_present"
      }
    }
    if [hostname] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{hostname}"
          "event.idm.read_only_udm.principal.asset.hostname" => "%{hostname}"
        }
        on_error => "hostname_not_present"
      }
      if ![hostname_not_present] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    if [description] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.description" => "%{description}"
        }
        on_error => "description_not_present"
      }
    }
    if [user_id] != "" {
      grok {
        match => {
          "user_id" => ["%{DATA:target_user}\\@%{GREEDYDATA:target_host}"]
        }
        on_error => "user_id_not_present"
        overwrite => ["target_user", "target_host"]
      }
      if [target_user] != "" {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.user.userid" => "%{target_user}"
          }
          on_error => "user_id_not_present"
        }
      }
      if [target_host] != "" {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.hostname" => "%{target_host}"
            "event.idm.read_only_udm.target.asset.hostname" => "%{target_host}"
          }
          on_error => "target_host_not_present"
        }
        if ![target_host_not_present] {
          mutate {
            replace => {
              "has_target" => "true"
            }
          }
        }
      }
    }
    if [Host] != "" {
      mutate {
        replace => {
          "intermediary.hostname" => "%{Host}"
        }
        on_error => "host_not_present"
      }
    }
    if [SessionID] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.session_id" => "%{SessionID}"
        }
        on_error => "session_id_not_present"
      }
    }
    if [Listener] != "" {
      grok {
        match => {
          "Listener" => ["%{IP:listener_ip}:%{INT:listener_port}"]
        }
        on_error => "listener_not_present"
        overwrite => ["listener_ip", "listener_port"]
      }
      if ![listener_not_present] {
        if [listener_ip] != "" {
          mutate {
            merge => {
              "event.idm.read_only_udm.target.ip" => "listener_ip"
              "event.idm.read_only_udm.target.asset.ip" => "listener_ip"
            }
            on_error => "listener_ip_not_present"
          }
          if ![listener_ip_not_present] {
            mutate {
              replace => {
                "has_target" => "true"
              }
            }
          }
        }
        if [listener_port] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.target.port" => "%{listener_port}"
            }
            on_error => "listener_port_not_present"
          }
          mutate {
            convert => {
              "event.idm.read_only_udm.target.port" => "integer"
            }
            on_error => "listener_port_not_integer"
          }
        }
      }
    }
    if [Client] != "" {
      grok {
        match => {
          "Client" => ["%{IP:client_ip}:%{INT:client_port}"]
        }
        on_error => "client_not_present"
        overwrite => ["client_ip", "client_port"]
      }
      if ![client_not_present] {
        if [client_ip] != "" {
          mutate {
            merge => {
              "event.idm.read_only_udm.principal.ip" => "client_ip"
              "event.idm.read_only_udm.principal.asset.ip" => "client_ip"
            }
            on_error => "client_ip_not_present"
          }
          if ![client_ip_not_present] {
            mutate {
              replace => {
                "has_principal" => "true"
              }
            }
          }
        }
        if [client_port] != "" {
          mutate {
            replace => {
              "event.idm.read_only_udm.principal.port" => "%{client_port}"
            }
            on_error => "client_port_not_present"
          }
          mutate {
            convert => {
              "event.idm.read_only_udm.principal.port" => "integer"
            }
            on_error => "client_port_not_integer"
          }
        }
      }
    }
    if [User] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.userid" => "%{User}"
        }
        on_error => "user_not_present"
      }
      if ![user_not_present] {
        mutate {
          replace => {
            "has_user" => "true"
          }
        }
      }
    }
    if [Command] != "" {
      mutate {
        replace => {
          "command_label.value.string_value" => "%{Command}"
        }
        on_error => "command_not_present"
      }
      if ![command_not_present] {
        mutate {
          replace => {
            "command_label.key" => "command"
          }
          on_error => "command_key_not_present"
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "command_label"
          }
          on_error => "merge_command_fail"
        }
      }
    }
    if [channel] =~ "SSH" {
      mutate {
        replace => {
          "event.idm.read_only_udm.network.application_protocol" => "SSH"
        }
        on_error => "application_protocol_not_present"
      }
    }
    if [has_principal] == "true" and [has_target] == "true" and [channel] =~ "SSH" {
      mutate {
        replace => {
          "event_type" => "NETWORK_CONNECTION"
        }
      }
    }
    else if [has_principal] == "true" and [has_user] == "false" {
      mutate {
        replace => {
          "event_type" => "STATUS_UPDATE"
        }
      }
    }
    else if [has_user] == "true" {
      mutate {
        replace => {
          "event_type" => "USER_UNCATEGORIZED"
        }
      }
    }
  }
  mutate {
    merge => {
      "event.idm.read_only_udm.security_result" => "sec_result"
    }
    on_error => "sec_result_not_present"
  }

  if [intermediary] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.intermediary" => "intermediary"
      }
      on_error => "intermediary_not_present"
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "IPSWITCH"
      "event.idm.read_only_udm.metadata.product_name" => "SFTP"
      "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
    }
  }
  if [not_json_format] and [invalid_grok_format] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
