# Product: HILLSTONE_NGFW
# Category: Application server logs
# Supported Format: SYSLOG + KV
# Reference: N/A
# Last Updated: 2025-02-04
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "principal" => ""
      "metadata" => ""
      "additional" => ""
      "target" => ""
      "security_result" => ""
      "network" => ""
      "has_principal" => "false"
      "has_user" => "false"
      "timestamp" => ""
      "id" => ""
      "session_id" => ""
      "src_ip" => ""
      "src_port" => ""
      "ethernet_src" => ""
      "dst_ip" => ""
      "dst_port" => ""
      "ethernet_dst" => ""
      "kv_data" => ""
      "kv_data1" => ""
      "session_status" => ""
      "zone_val" => ""
      "start_time" =>""
      "close_time" => ""
      "state" => ""
      "Protocol" => ""
      "vr" => ""
      "policy" => ""
      "user" => ""
      "host" => ""
      "mac_address" => ""
      "send_packets" => ""
      "send_bytes" => ""
      "receive_packets" => ""
      "receive_bytes" => ""
      "desc" => ""
      "has_target" => "false"
    }
  }
  mutate {
    gsub => ["message","\n\x00",""]
  }

  mutate {
    gsub => ["message","□□",""]
  }
  grok {
    match => {
      "message" => [ "<%{INT}>%{TIMESTAMP_ISO8601:timestamp} %{DATA:id}\\(root\\) %{DATA:session_id} %{DATA:product_event} SESSION: %{IPV4:src_ip}:%{IPORHOST:src_port}\\(%{DATA:ethernet_src}\\)-.%{IPV4:dst_ip}:%{IPORHOST:dst_port}\\(%{DATA:ethernet_dst}\\), %{GREEDYDATA:kv_data}, mac %{DATA:mac_address}, %{GREEDYDATA:kv_data1}, zone %{DATA:zone_val}, start time %{TIMESTAMP_ISO8601:start_time}, close time %{TIMESTAMP_ISO8601:close_time}, session %{DATA:session_status}, %{GREEDYDATA:state}",
      "<%{INT}>%{TIMESTAMP_ISO8601:timestamp} %{DATA:id}\\(root\\) %{DATA:session_id} %{DATA:product_event} SESSION: %{IPV4:src_ip}:%{IPORHOST:src_port}\\(%{DATA:ethernet_src}\\)-.%{IPV4:dst_ip}:%{IPORHOST:dst_port}\\(%{DATA:ethernet_dst}\\), %{GREEDYDATA:kv_data}, mac %{DATA:mac_address}, zone %{DATA:zone_val}, session %{GREEDYDATA:session_status}"
      "<%{INT}>%{TIMESTAMP_ISO8601:timestamp} %{DATA:id}\\(root\\) %{DATA:session_id} %{DATA:product_event}: %{GREEDYDATA:desc}"
    ]
    }
    overwrite => ["timestamp","id","session_id", "product_event", "src_ip", "src_port", "ethernet_src", "dst_ip", "dst_port", "ethernet_dst", "kv_data", "mac_address", "zone_val", "kv_data1" ,"start_time", "session_status","close_time", "state","desc"]
    on_error => "grok_failure"
  }
  if [desc] != "" {
    grok {
      match => {
        "desc" => ["ARP entry %{IPV4:src_ip} %{MAC:mac_address} %{GREEDYDATA}"]
      }
      overwrite => ["src_ip","mac_address"]
      on_error => "grok_failure"
    }
    mutate{
      replace => {
        "metadata.description" => "%{desc}"
      }
      on_error => "no_desc"
    }
  }
  mutate {
    gsub => ["kv_data","APP/Protocol","Protocol"]
  }

  mutate {
    gsub => ["kv_data",", ",","]
  }
  mutate {
    gsub => ["kv_data"," ","#"]
  }

  kv {
    source => "kv_data"
    field_split => ","
    value_split => "#"
    on_error => "no_kv_data"
  }

  mutate {
    gsub => ["kv_data1","send packets","send_packets"]
  }
  mutate {
    gsub => ["kv_data1","send bytes","send_bytes"]
  }
  mutate {
    gsub => ["kv_data1","receive packets","receive_packets"]
  }
  mutate {
    gsub => ["kv_data1","receive bytes","receive_bytes"]
  }
  mutate {
    gsub => ["kv_data1","APP/Protocol","Protocol"]
  }
  mutate {
    gsub => ["kv_data1",", ",","]
  }
  mutate {
    gsub => ["kv_data1"," ","#"]
  }
  kv {
    source => "kv_data1"
    field_split => ","
    value_split => "#"
    on_error => "no_kv_data1"
  }

  if [id] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{id}"
        "has_user" => "true"
      }
      on_error => "no_id"
    }
  }

  if [session_id] != "" {
    mutate {
      replace => {
        "network.session_id" => "%{session_id}"
      }
      on_error => "no_session_id"
    }
  }

  if [src_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "src_ip"
        "principal.asset.ip" => "src_ip"
      }
      on_error => "no_src_ip"
    }
    if ![no_src_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [src_port] != "" {
    mutate {
      replace => {
        "principal.port" => "%{src_port}"
      }
      on_error => "no_src_port"
    }
    mutate {
      convert => {
        "principal.port" => "integer"
      }
      on_error => "no_src_port"
    }
  }

  if [ethernet_src] != "" {
    mutate {
      replace => {
        "ethernet_src_label.key" => "ethernet_src"
        "ethernet_src_label.value" => "%{ethernet_src}"
      }
      on_error => "no_ethernet_src"
    }
    if ![no_ethernet_src] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "ethernet_src_label"
        }
        on_error => "no_ethernet_src_label"
      }
    }
  }

  if [ethernet_dst] != "" {
    mutate {
      replace => {
        "ethernet_dst_label.key" => "ethernet_dst"
        "ethernet_dst_label.value" => "%{ethernet_dst}"
      }
      on_error => "no_ethernet_dst"
    }
    if ![no_ethernet_dst] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "ethernet_dst_label"
        }
        on_error => "no_ethernet_dst_label"
      }
    }
  }

  if [dst_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "dst_ip"
        "target.asset.ip" => "dst_ip"
      }
      on_error => "no_dst_ip"
    }
    if ![no_dst_ip] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }

  if [dst_port] != "" {
    mutate {
      replace => {
        "target.port" => "%{dst_port}"
      }
      on_error => "no_dst_port"
    }
    mutate {
      convert => {
        "target.port" => "integer"
      }
      on_error => "no_dst_port"
    }
  }

  if [zone_val] != "" {
    mutate {
      replace => {
        "principal.cloud.availability_zone" => "%{zone_val}"
      }
      on_error => "no_zone_val"
    }
  }

  if [start_time] != "" {
    mutate {
      replace => {
        "start_time_label.key" => "start_time"
        "start_time_label.value.string_value" => "%{start_time}"
      }
      on_error => "no_start_time"
    }
    if ![no_start_time] {
      mutate {
        merge => {
          "additional.fields" => "start_time_label"
        }
        on_error => "no_start_time_label"
      }
    }
  }

  if [close_time] != "" {
    mutate {
      replace => {
        "close_time_label.key" => "close_time"
        "close_time_label.value.string_value" => "%{close_time}"
      }
      on_error => "no_close_time"
    }
    if ![no_close_time] {
      mutate {
        merge => {
          "additional.fields" => "close_time_label"
        }
        on_error => "no_close_time_label"
      }
    }
  }

  if [state] != "" {
    mutate {
      replace => {
        "state_label.key" => "state"
        "state_label.value.string_value" => "%{state}"
      }
      on_error => "no_state"
    }
    if ![no_state] {
      mutate {
        merge => {
          "additional.fields" => "state_label"
        }
        on_error => "no_state_label"
      }
    }
  }

  grok {
    match => {
      "Protocol" => [ "%{DATA}/%{GREEDYDATA:Protocol}"]
    }
    overwrite => ["Protocol"]
    on_error => "grok_failure"
  }
  if [Protocol] != "" {
    mutate {
      uppercase => ["Protocol"]
      on_error => "already_converted"
    }
    mutate {
      rename => {
        "Protocol" => "protocol_number_src"
      }
    }
    # This file contains the ip protocol convertor
# Document:
#   - https://www.iana.org/assignments/protocol-numbers/protocol-numbers.xhtml

# Interface:
# protocol_number_src (required): number with the value which represents the protocol
# ip_protocol_out: string that is either empty or contains ip protocol
#                  compatible to IpProtocol enum in udm.proto

mutate {
  replace => {
    "ip_protocol_out" => "UNKNOWN_IP_PROTOCOL"
  }
}


if [protocol_number_src] in [ 1, "ICMP", "ICMPV6", 58 ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ICMP"
    }
  }
} else if [protocol_number_src] in [ 2, "IGMP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "IGMP"
    }
  }
} else if [protocol_number_src] in [ 6, "TCP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "TCP"
    }
  }
} else if [protocol_number_src] in [ 17, "UDP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "UDP"
    }
  }
} else if [protocol_number_src] in [ 41, "IP6IN4" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "IP6IN4"
    }
  }
} else if [protocol_number_src] in [ 47, "GRE" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "GRE"
    }
  }
} else if [protocol_number_src] in [ 50, "ESP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ESP"
    }
  }
} else if [protocol_number_src] in [ 88, "EIGRP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "EIGRP"
    }
  }
}  else if [protocol_number_src] in [ 97, "ETHERIP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "ETHERIP"
    }
  }
} else if [protocol_number_src] in [ 103, "PIM" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "PIM"
    }
  }
} else if [protocol_number_src] in [ 112, "VRRP" ] {
  mutate {
    replace => {
      "ip_protocol_out" => "VRRP"
    }
  }
}

    mutate {
      rename => {
        "ip_protocol_out" => "network.ip_protocol"
      }
    }
  }
  if [vr] != "" {
    mutate {
      replace => {
        "vr_label.key" => "vr"
        "vr_label.value.string_value" => "%{vr}"
      }
      on_error => "no_vr"
    }
    mutate {
      merge => {
        "additional.fields" => "vr_label"
      }
      on_error => "no_vr"
    }
  }
  if [send_packets] != "" {
    mutate {
      replace => {
        "network.sent_packets" => "%{send_packets}"
      }
      on_error => "no_send_packets"
    }
    mutate {
      convert => {
        "network.sent_packets" => "integer"
      }
      on_error => "no_send_packets"
    }
  }
  if [send_bytes] != "" {
    mutate {
      replace => {
        "network.sent_bytes" => "%{send_bytes}"
      }
      on_error => "no_send_bytes"
    }
    mutate {
      convert => {
        "network.sent_bytes" => "uinteger"
      }
      on_error => "no_send_bytes"
    }
  }
  if [receive_packets] != "" {
    mutate {
      replace => {
        "network.received_packets" => "%{receive_packets}"
      }
      on_error => "no_receive_packets"
    }
    mutate {
      convert => {
        "network.received_packets" => "integer"
      }
      on_error => "no_receive_packets"
    }
  }
  if [receive_bytes] != "" {
    mutate {
      replace => {
        "network.received_bytes" => "%{receive_bytes}"
      }
      on_error => "no_receive_bytes"
    }
    mutate {
      convert => {
        "network.received_bytes" => "uinteger"
      }
      on_error => "no_receive_bytes"
    }
  }
  if [policy] != "" {
    mutate {
      replace => {
        "target.resource.type" => "POLICY"
        "target.resource.name" => "%{policy}"
      }
      on_error => "no_policy"
    }
  }

  if [user] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{user}"
        "has_user" => "true"
      }
      on_error => "no_user"
    }
  }

  if [host] not in ["","-"] {
    mutate {
      replace => {
        "principal.hostname" => "%{host}"
        "principal.asset.hostname" => "%{host}"
        "has_user" => "true"
      }
      on_error => "no_host"
    }
  }

  mutate {
    gsub => ["mac_address","\\.",""]
  }
  mutate {
    gsub => [ "mac_address", "([a-f0-9]{2})([a-f0-9]{2})([a-f0-9]{2})([a-f0-9]{2})([a-f0-9]{2})([a-f0-9]{2})", "\${1}:\${2}:\${3}:\${4}:\${5}:\${6}" ]
    on_error => "no_mac_address"
  }

  if [mac_address] != "" {
    mutate {
      merge => {
        "principal.mac" => "mac_address"
      }
      on_error => "no_mac_address"
    }
    if ![no_mac_address] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  mutate {
    replace => {
      "metadata.vendor_name" => "HILLSTONE_NGFW"
      "metadata.product_name" => "HILLSTONE_NGFW"
    }
  }

  if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "NETWORK_CONNECTION"
      }
      on_error => "no_principal_target"
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
      on_error => "no_principal"
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
      on_error => "no_user"
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
      on_error => "no_event_type"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_sec_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
