# Product: TINTRI
# Category: Data Security
# Supported Format: syslog
# Reference: N/A
# Last Updated: 2024-09-17
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "syslog_pri" => ""
      "event_timestamp" => ""
      "hostname" => ""
      "component" => ""
      "thread" => ""
      "logger" => ""
      "log_level" => ""
      "user_event" => ""
      "log_id" => ""
      "id" => ""
      "description" => ""
      "client_type" => ""
      "user_id"  => ""
      "request_path" => ""
      "status" => ""
      "client_ip" => ""
      "http_method" => ""
      "user_login" => "false"
      "user_logout" => "false"
      "has_principal" => "false"
      "has_user" => "false"
      "component_label" => ""
      "thread_label" => ""
      "logger_label" => ""
      "principal" => ""
      "metadata" => ""
      "security_result" => ""
      "target" => ""
      "extensions" => ""
     }
  }
  grok {
    match => {
      "message" => "\\<%{INT:syslog_pri}\\>%{SYSLOGTIMESTAMP:event_timestamp}%{SPACE}%{HOSTNAME:hostname} %{WORD:component}: \\[%{DATA:thread},%{DATA:logger}\\] %{WORD:log_level} : USER:%{DATA:user_event}:%{DATA:log_id}: \\[%{NUMBER:id}\\] %{GREEDYDATA:description}"
    }
    overwrite => ["syslog_pri","event_timestamp","hostname","component","thread","logger","log_level","user_event","log_id","id","description"]
    on_error => "grok_failed"
  }
  if [description] =~ "Client type|logged in|logout|Client ID|login|logged out" {
    grok {
      match => {
        "description" => [
          "Client type \\'%{DATA:client_type}\\'%{GREEDYDATA}",
          "User \\'%{DATA:user_id}\\'%{GREEDYDATA}",
          "Client ID \\'%{DATA:user_id}\\'%{GREEDYDATA}",
          "User login \\[%{WORD:http_method}%{SPACE}%{URIPATH:request_path}\\]%{SPACE}%{WORD}%{SPACE}\\(%{WORD:status}\\)%{DATA}client IP%{SPACE}\\(%{IP:client_ip}\\)%{GREEDYDATA}"
        ]
      }
      overwrite => ["user_id","client_type","request_path","status","client_ip","http_method"]
      on_error => "grok_parse_failed"
    }
  }
  if [description] =~ "logged in|login" {
    mutate {
      replace => {
        "user_login" => "true"
        "extensions.auth.type" => "MACHINE"
      }
    }
  }
  if [description] =~ "logged out|logout" {
    mutate {
      replace => {
        "user_logout" => "true"
        "extensions.auth.type" => "MACHINE"
      }
    }
  }
  if [event_timestamp] != "" {
    date {
      match => ["event_timestamp","MMM dd HH:mm:ss "]
      target => "metadata.event_timestamp"
      on_error => "invalid_timestamp"
    }
  }
  if [hostname] != "" {
    mutate {
      replace => {
        "principal.asset.hostname" => "%{hostname}"
        "principal.hostname" => "%{hostname}"
        "has_principal" => "true"
      }
    }
  }
  if [component] != "" {
    mutate {
      replace => {
        "component_label.key" => "component"
        "component_label.value" => "%{component}"
      }
      on_error => "no_component"
    }
    if ![no_component] {
      mutate {
        merge => {
          "security_result.detection_fields" => "component_label"
        }
        on_error => "component_label_merge_failed"
      }
    }
  }
  if [thread] != "" {
    mutate {
      replace => {
        "thread_label.key" => "thread"
        "thread_label.value" => "%{thread}"
      }
      on_error => "no_thread"
    }
    if ![no_thread] {
      mutate {
        merge => {
          "security_result.detection_fields" => "thread_label"
        }
        on_error => "thread_label_merge_failed"
      }
    }
  }
  if [logger] != "" {
    mutate {
      replace => {
        "logger_label.key" => "logger"
        "logger_label.value" => "%{logger}"
      }
      on_error => "no_logger"
    }
    if ![no_logger] {
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "logger_label"
        }
        on_error => "logger_label_merge_failed"
      }
    }
  }
  if [log_level] =~ "(?i)(DEBUG|INFO|AUDIT|NOTICE)" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
      on_error => "no_severity"
    }
  }
  else if [log_level] =~ "(?i)ERROR" {
    mutate {
      replace => {
        "security_result.severity" => "ERROR"
      }
      on_error => "no_severity"
    }
  }
  else if [log_level] =~ "(?i)(WARNING|WARN)" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
      on_error => "no_severity"
    }
  }
  if [user_event] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{user_event}"
      }
      on_error => "no_user_event"
    }
  }
  if [log_id] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{log_id}"
      }
      on_error => "no_log_id"
    }
  }
  if [id] != "" {
    mutate {
      convert => {
        "id" => "string"
      }
      on_error => "id_conversion_failed"
    }
    if ![id_conversion_failed] {
      mutate {
        replace => {
          "principal.process.pid" => "%{id}"
        }
        on_error => "no_id"
      }
    }
  }
  if [description] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{description}"
      }
      on_error => "no_description"
    }
  }
  if [client_type] != "" {
    mutate {
      replace => {
        "client_type_label.key" => "client_type"
        "client_type_label.value" => "%{client_type}"
      }
      on_error => "no_client_type"
    }
    if ![no_client_type] {
      mutate {
        merge => {
          "security_result.detection_fields" => "client_type_label"
        }
        on_error => "client_type_label_merge_failed"
      }
    }
  }
  if [user_id] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{user_id}"
        "has_user" => "true"
      }
      on_error => "no_user_id"
    }
  }
  if [request_path] != "" {
    mutate {
      replace => {
        "target.url" => "%{request_path}"
        "has_user" => "true"
      }
      on_error => "no_request_path"
    }
  }
  if [http_method] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{http_method}"
      }
      on_error => "no_http_method"
    }
  }
  if [status] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{status}"
      }
      on_error => "no_status"
    }
  }
  if [client_ip] != "" {
    mutate {
      merge => {
        "principal.asset.ip" => "client_ip"
        "principal.ip" => "client_ip"
      }
      on_error => "no_client_ip"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }
  if [has_principal] == "true" and [has_user] == "true" and [user_login] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_LOGIN"
      }
    }
  }
  else if [has_principal] == "true" and [has_user] == "true" and [user_logout] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_LOGOUT"
      }
    }
  }
  else if [has_principal] == "true" and [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "Tintri"
      "event.idm.read_only_udm.metadata.vendor_name" => "Tintri"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

