# Product: UBIKA_WAAP
# Category: WAF
# Supported Format: SYSLOG
# References: NA
# Last Updated: 2024-06-03
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "event_type" => ""
      "principal_host" => ""
      "ts" => ""
      "src_ip" => ""
      "dst_ip" => ""
      "method" => ""
      "date_time" => ""
      "target_url" => ""
      "protocol" => ""
      "response_code" => ""
      "summary" => ""
      "version" => ""
      "target_host" => ""
      "user_agent" => ""
      "security_result" => ""
      "pid" => ""
      "kv_data" => ""
      "kv_data2" => ""
      "gateway" => ""
      "tmpl" => ""
      "service" => ""
      "about" => ""
      "client_id" => ""
      "id" => ""
      "scope" => ""
      "response_type" => ""
      "redirect_uri" => ""
      "code_challenge" => ""
      "code_challenge_method" => ""
      "redirect" => ""
      "ticket" => ""
      "limit" => ""
      "idCP" => ""
      "state" => ""
      "type" => ""
    }
  }

  grok {
    match => {
      "message" => ["<%{INT}>%{INT}\\s+%{TIMESTAMP_ISO8601:ts}\\s+%{HOSTNAME:principal_host}%{GREEDYDATA:message_details}"]
    }
    overwrite => ["principal_host","ts"]
    on_error => "grok_failure"
  }

  if [grok_failure] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }

  if [message_details] != "" {
    mutate {
      gsub => ["message_details", "\\r\\n", ""]
    }
  }

  grok {
    match => {
      "message_details" => [
      '%{DATA}:\\s+-\\s+-\\s+-\\s+-\\s+%{IP:src_ip}\\s+%{IP:dst_ip}\\s+-\\s+\\[%{GREEDYDATA:date_time}\\]\\s+\\"%{DATA:method}\\s+%{DATA:target_url}\\s+%{WORD:protocol}/%{DATA}\\s+%{INT:response_code}\\s+-\\s+\\"\\-\\"\\s+\\"%{DATA:version}\\"\\s+%{GREEDYDATA:summary}',
      '%{DATA}:\\s+-\\s+-\\s+-\\s+-\\s+%{IP:src_ip}\\s+%{IP:dst_ip}\\s+-\\s+\\[%{GREEDYDATA:date_time}\\]\\s+\\"%{DATA:method}\\s+%{DATA:target_url}\\s+%{WORD:protocol}/%{DATA}\\s+%{INT:response_code}\\s+-\\s+\\"\\-\\"',
      '%{DATA}:\\s+-\\s+-\\s+-\\s%{DATA:target_host}\\?%{GREEDYDATA:kv_data}\\s+%{IP:src_ip}\\s+%{IP:dst_ip}\\s+-\\s+\\[%{DATA:date_time}\\]\\s+\\"%{WORD:method}\\s+%{DATA:target_url}\\?%{GREEDYDATA:kv_data2}\\s+%{WORD:protocol}/%{DATA}\\"\\s+%{INT:response_code}\\s+%{INT:pid}\\s+%{GREEDYDATA:user_agent}\\s+\\"%{DATA:version}\\"\\s+%{GREEDYDATA:summary}',
      '%{DATA}:\\s+-\\s+-\\s+-\\s%{DATA:target_host}\\?%{GREEDYDATA:kv_data}\\s+%{IP:src_ip}\\s+%{IP:dst_ip}\\s+-\\s+\\[%{DATA:date_time}\\]\\s+\\"%{WORD:method}\\s+%{DATA:target_url}\\?%{GREEDYDATA:kv_data2}\\s+%{WORD:protocol}/%{DATA}\\"\\s+%{INT:response_code}\\s+%{GREEDYDATA:user_agent}\\s+\\"%{DATA:version}\\"\\s+%{GREEDYDATA:summary}',
      '%{DATA}:\\s+-\\s+-\\s+-\\s%{DATA:target_host}\\s+%{IP:src_ip}\\s+%{IP:dst_ip}\\s+-\\s+\\[%{DATA:date_time}\\]\\s+\\"%{WORD:method}\\s+%{DATA:target_url}\\s+%{WORD:protocol}/%{DATA}\\"\\s+%{INT:response_code}\\s+%{INT:pid}\\s+%{GREEDYDATA:user_agent}\\s+\\"%{DATA:version}\\"\\s+%{GREEDYDATA:summary}',
      '%{DATA}:\\s+-\\s+-\\s+-\\s%{DATA:target_host}\\s+%{IP:src_ip}\\s+%{IP:dst_ip}\\s+-\\s+\\[%{DATA:date_time}\\]\\s+\\"%{WORD:method}\\s+%{DATA:target_url}\\s+%{WORD:protocol}/%{DATA}\\"\\s+%{INT:response_code}\\s+-\\s+\\"%{GREEDYDATA:user_agent}\\s+\\"%{DATA:version}\\"\\s+%{GREEDYDATA:summary}']
    }
    overwrite => ["target_host","src_ip","dst_ip","date_time","method","target_url","protocol","response_code","version","summary","user_agent","pid","kv_data","kv_data2"]
    on_error => "msg_details_grok_error"
  }

  mutate {
    gsub => ["summary",'\"',""]
  }

  date {
    match => ["ts", "MMM d HH:mm:ss" ]
    rebase => true
    on_error => "date_format_failure"
  }

  if [principal_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{principal_host}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{principal_host}"
      }
      on_error => "no_principal_hostname"
    }
  }

  if [target_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{target_host}"
        "event.idm.read_only_udm.target.asset.hostname" => "%{target_host}"
      }
      on_error => "target_hostname_invalid"
    }
  }

  if [src_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "src_ip"
        "event.idm.read_only_udm.principal.asset.ip" => "src_ip"
      }
      on_error => "invalid_src_ip"
    }
  }

  if [dst_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "dst_ip"
        "event.idm.read_only_udm.target.asset.ip" => "dst_ip"
      }
      on_error => "invalid_dst_ip"
    }
  }

  if [date_time] != "" {
    date {
      match => ["date_time", "yyyy/MM/dd HH:mm:ss Z"]
      on_error => "no_datetime_match_found"
    }
  }

  if [method] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{method}"
      }
      on_error => "invalid_method"
    }
  }

  if [target_url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.url" => "%{target_url}"
      }
      on_error => "no_target_url"
    }
  }

  if [protocol] == "HTTP" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "%{protocol}"
      }
      on_error => "invalid_protocol"
    }
  }

  if [response_code] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.response_code" => "%{response_code}"
      }
      on_error => "invalid_response_code"
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.network.http.response_code" => "integer"
      }
      on_error => "http_response_code_conversion_failure"
    }
  }

  if [version] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.tls.version" => "%{version}"
      }
      on_error => "invalid_version"
    }
  }

  if [summary] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{summary}"
      }
      on_error => "summary_not_present"
    }
  }

  if [user_agent] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" => "%{user_agent}"
      }
      on_error => "user_agent_empty"
    }
  }

  if [pid] != "" {
    mutate {
      replace => {
       "event.idm.read_only_udm.target.process.pid" => "%{pid}"
      }
      on_error => "no_pid_found"
    }
  }

  if [kv_data] != "" and [kv_data2] != "" {
    kv {
      source => "kv_data"
      field_split => "&"
      value_split => "="
      on_error => "kv1_fail"
    }

    kv {
      source => "kv_data2"
      field_split => "&"
      value_split => "="
      on_error => "kv2_fail"
    }

    if [gateway] != "" {
      mutate {
        replace => {
          "gateway_label.key" => "Gateway"
          "gateway_label.value" => "%{gateway}"
        }
        on_error => "no_gateway"
      }
      if ![no_gateway] {
        mutate {
          merge => {
            "about.resource.attribute.labels" => "gateway_label"
          }
          on_error => "no_gateway_label"
        }
      }
    }

    if [service] != "" {
      mutate {
        replace => {
          "service_label.key" => "Service"
          "service_label.value" => "%{service}"
        }
        on_error => "no_service"
      }
      if ![no_service] {
        mutate {
          merge => {
            "security_result.detection_fields" => "service_label"
          }
          on_error => "no_service_label"
        }
      }
    }

    if [tmpl] != "" {
      mutate {
        replace => {
          "tmpl_label.key" => "tmpl"
          "tmpl_label.value" => "%{tmpl}"
        }
        on_error => "no_tmpl"
      }
      if ![no_tmpl] {
        mutate {
          merge => {
            "security_result.detection_fields" => "tmpl_label"
          }
          on_error => "no_tmpl_label"
        }
      }
    }

    if [client_id] != "" {
      mutate {
        replace => {
          "client_label.key" => "ClientID"
          "client_label.value" => "%{client_id}"
        }
        on_error => "no_client"
      }
      if ![no_client] {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.labels" => "client_label"
          }
          on_error => "no_client_label"
        }
      }
    }

    if [id] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.user.product_object_id" => "%{id}"
        }
        on_error => "id_not_found"
      }
    }

    if [scope] != "" {
      mutate {
        replace => {
          "scope_label.key" => "Scope"
          "scope_label.value.string_value" => "%{scope}"
        }
        on_error => "no_scope"
      }
      if ![no_scope] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "scope_label"
          }
          on_error => "no_scope_label"
        }
      }
    }

    if [response_type] != "" {
      mutate {
        replace => {
          "response_type_label.key" => "ResponseType"
          "response_type_label.value" => "%{response_type}"
        }
        on_error => "no_response_type"
      }
      if ![no_response_type] {
        mutate {
          merge => {
            "about.resource.attribute.labels" => "response_type_label"
          }
          on_error => "no_response_type_label"
        }
      }
    }

    if [redirect_uri] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.url" => "%{redirect_uri}"
        }
        on_error => "no_redirect_uri"
      }
    }

    if [code_challenge] != "" {
      mutate {
        replace => {
          "code_challenge_label.key" => "Code_Challenge"
          "code_challenge_label.value.string_value" => "%{code_challenge}"
        }
        on_error => "no_code_challenge"
      }
      if ![no_code_challenge] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "code_challenge_label"
          }
          on_error => "no_code_challenge_label"
        }
      }
    }

    if [code_challenge_method] != "" {
      mutate {
        replace => {
          "code_challenge_method_label.key" => "Code_Challenge_Method"
          "code_challenge_method_label.value.string_value" => "%{code_challenge_method}"
        }
        on_error => "no_code_challenge_method"
      }
      if ![no_code_challenge_method] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "code_challenge_method_label"
          }
          on_error => "no_code_challenge_method_label"
        }
      }
    }

    if [redirect] != "" {
      mutate {
        replace => {
          "redirect_label.key" => "redirect"
          "redirect_label.value" => "%{redirect}"
        }
        on_error => "no_redirect"
      }
      if ![no_redirect] {
        mutate {
          merge => {
            "security_result.detection_fields" => "redirect_label"
          }
          on_error => "no_redirect_label"
        }
      }
    }

    if [ticket] != "" {
      mutate {
        replace => {
          "ticket_label.key" => "Ticket"
          "ticket_label.value.string_value" => "%{ticket}"
        }
        on_error => "no_ticket"
      }
      if ![no_ticket] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "ticket_label"
          }
          on_error => "no_ticket_label"
        }
      }
    }

    if [limit] != "" {
      mutate {
        replace => {
          "limit_label.key" => "Limit"
          "limit_label.value" => "%{limit}"
        }
        on_error => "no_limit"
      }
      if ![no_limit] {
        mutate {
          merge => {
            "about.resource.attribute.labels" => "limit_label"
          }
          on_error => "no_limit_label"
        }
      }
    }

    if [idCP] != "" {
      mutate {
        replace => {
          "idcp_label.key" => "idCP"
          "idcp_label.value" => "%{idCP}"
        }
        on_error => "no_idcp"
      }
      if ![no_idcp] {
        mutate {
          merge => {
            "security_result.detection_fields" => "idcp_label"
          }
          on_error => "no_idcp_label"
        }
      }
    }

    if [state] != "" {
      mutate {
        replace => {
          "state_label.key" => "State"
          "state_label.value" => "%{state}"
        }
        on_error => "no_state"
      }
      if ![no_state] {
        mutate {
          merge => {
            "about.resource.attribute.labels" => "state_label"
          }
          on_error => "no_state_label"
        }
      }
    }

    if [type] != "" {
      mutate {
        replace => {
          "type_label.key" => "Type"
          "type_label.value" => "%{type}"
        }
        on_error => "no_type"
      }
      if ![no_type] {
        mutate {
          merge => {
            "security_result.detection_fields" => "type_label"
          }
          on_error => "no_type_label"
        }
      }
    }
  }

  if [src_ip] != "" and ([dst_ip] != "" || [target_host] != "") {
    mutate {
      replace => {
        "event_type" => "NETWORK_HTTP"
      }
    }
  }
  else if [src_ip] != "" and ([dst_ip] == "" || [target_host] == "") {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      }
      on_error => "invalid_event_type"
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "UBIKA_WAAP"
      "event.idm.read_only_udm.metadata.product_name" => "UBIKA_WAAP"
    }
  }

  if [about] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.about" => "about"
      }
      on_error => "about_empty"
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "invalid_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}

