# Product: Manage Engine Reporter Plus
# Category: SaaS Application
# Supported Format: JSON
# Reference: See below
# Last Updated: 2022-08-29
# Copyright 2022 Chronicle LLC


# Additional references:
# https://www.manageengine.com/products/exchange-reports/?helpdoc
# https://download.manageengine.com/products/exchange-reports/exchange-server-reporting-help.pdf

filter {
  mutate {
    replace => {
      "host" => ""
      "msg.CreationTime" => ""
      "msg.OriginatingServer" => ""
      "msg.MailboxOwnerUPN" => ""
      "msg.Version" => ""
      "msg.ClientVersion" => ""
      "msg.Client" => ""
      "msg.ClientInfoString" => ""
      "msg.ClientIP" => ""
      "msg.Id" => ""
      "msg.Operation" => ""
      "msg.UserId" => ""
      "msg.UserType" => ""
      "msg.OrganizationName" => ""
      "msg.OrganizationId" => ""
      "msg.MailboxOwnerSid" => ""
      "msg.LogonUserSid" => ""
      "msg.ResultStatus" => ""
      "msg.DestFolder" => ""
      "msg.Folder" => ""
      "msg.ClientProcessName" => ""
      "msg.AffectedItems" => ""
      "msg.RecordType" => ""
      "msg.MailboxGuid" => ""
      "msg.UserKey" => ""
      "ClientIP" => ""
      "clientPort" => ""
      "security_result_action" => ""
      "security_result" => ""
      "event_type" => ""
      "filePath" => ""
      "parentFilePath" => ""
    }
  }

  mutate {
    gsub => ["message", "\"message\"", "\"msg\"" ]
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_valid_json"
  }

  if [not_valid_json] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }

  if [msg][OriginatingServer] != "" {
    grok {
      match => {
        "msg.OriginatingServer" => "(?P<originatingServer>.*?) \\((.*?)\\).*"
      }
      on_error => "originating_server_parsing_failed"
    }

    if ![originating_server_parsing_failed] {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{originatingServer}"
        }
      }
    }
    else  {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{msg.OriginatingServer}"
        }
      }
    }
  }

  if [msg][ClientIP] != "" {
    grok {
      match => {
        "msg.ClientIP" => [
          "\\[%{IP:clientIP}\\]:%{INT:clientPort}",
          "%{IP:clientIP}(:|-)%{INT:clientPort}",
          "%{IP:clientIP}%.*?",
          "%{IP:clientIP}",
        ]
      }
      overwrite => ["clientPort", "clientIP"]
    }
    if [clientPort] != "" {
      mutate {
        convert => {
          "clientPort" => "integer"
        }
      }
      mutate {
        rename => {
          "clientPort" => "event.idm.read_only_udm.principal.port"
        }
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "clientIP"
      }
    }
  }

  if [msg][UserId] != "" {
    if [msg][UserId] =~ "(^.*@.*$)" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.user.email_addresses" => "msg.UserId"
        }
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{msg.UserId}"
      }
    }
  }

  if [msg][UserKey] != "" {
    mutate {
      replace => {
        "user_key_label.key" => "UserKey"
        "user_key_label.value" => "%{msg.UserKey}"
      }
    }

    mutate {
      merge => {
        "event.idm.read_only_udm.principal.user.attribute.labels" => "user_key_label"
      }
    }
  }

  if [msg][MailboxOwnerSid] != "" {
    mutate {
      rename => {
        "msg.MailboxOwnerSid" => "event.idm.read_only_udm.principal.user.windows_sid"
      }
    }
  }
  else if [msg][LogonUserSid] != "" {
    mutate {
      rename => {
        "msg.LogonUserSid" => "event.idm.read_only_udm.principal.user.windows_sid"
      }
    }
  }

  if [msg][UserType] not in ["", "0"] {
    mutate {
      replace => {
        "roles.name" => "%{msg.UserType}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.user.attribute.roles" => "roles"
      }
    }
  }

  if [msg][ClientProcessName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.application" => "%{msg.ClientProcessName}"
      }
    }
  }

  if [msg][OrganizationId] != "" {
    mutate {
      replace => {
        "organization_id_label.key" => "OrganizationId"
        "organization_id_label.value.string_value" => "%{msg.OrganizationId}"
      }
    }

    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "organization_id_label"
      }
    }
  }

  if [msg][MailboxGuid] != "" {
    mutate {
      replace => {
        "mail_box_guid_label.key" => "MailboxGuid"
        "mail_box_guid_label.value.string_value" => "%{msg.MailboxGuid}"
      }
    }

    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "mail_box_guid_label"
      }
    }
  }

  if [msg][CreationTime] != "" {
    date {
      match => ["msg.CreationTime", "yyyy-MM-dd HH:mm:ss"]
    }
  }

  if [host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{host}"
      }
    }
  }

  if [msg][MailboxOwnerUPN] =~ "(^.*@.*$)" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.user.email_addresses" => "msg.MailboxOwnerUPN"
      }
    }
  }
  else if [msg][MailboxOwnerUPN] =~ ".* .*" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.user_display_name" => "%{msg.MailboxOwnerUPN}"
      }
    }
  }
  else if [msg][MailboxOwnerUPN] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{msg.MailboxOwnerUPN}"
      }
    }
  }

  if [msg][OrganizationName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.administrative_domain" => "%{msg.OrganizationName}"
      }
    }
  }

  if [msg][DestFolder] != "" {
    grok {
      match => {
        "msg.DestFolder" => [
          "@\\{Id=%{DATA:fileId}; Path=%{GREEDYDATA:filePath}\\}"
          "@\\{Id=%{DATA:fileId}\\}"
        ]
      }
      overwrite => [ "filePath" ]
    }

    mutate {
      gsub => ["filePath", "\\\\", ""]
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{fileId}/%{filePath}"
      }
    }
  }

  if [msg][Folder] != "" {
    grok {
      match => {
        "msg.Folder" => [
          "@\\{Id=%{DATA:parentFileId}; Path=%{GREEDYDATA:parentFilePath}\\}"
          "@\\{Id=%{DATA:parentFileId}\\}"
        ]
      }
      overwrite => [ "parentFilePath" ]
    }

    mutate {
      gsub => ["parentFilePath", "\\\\", ""]
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.parent_process.file.full_path" => "%{parentFileId}/%{parentFilePath}"
      }
    }
  }

  if [msg][ClientInfoString] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" => "%{msg.ClientInfoString}"
      }
    }
  }
  else if [msg][Client] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" => "%{msg.Client}"
      }
    }
  }

  if [msg][AffectedItems] != "" {
    mutate {
      replace => {
        "AffectedItems" => "{\"AffectedItems\":%{msg.AffectedItems}}"
      }
    }

    json {
      source => "AffectedItems"
      array_function => "split_columns"
    }

    for item in AffectedItems {
      mutate {
        replace => {
          "email_subject" => "%{item.Subject}"
        }
        on_error => "subject_not_found"
      }

      if ![subject_not_found] {
        mutate {
          merge => {
            "event.idm.read_only_udm.network.email.subject" => "email_subject"
          }
        }
      }
    }
  }

  if [msg][Operation] in [ "SoftDelete", "FolderBind", "HardDelete", "MailItemsAccessed" ] {
    mutate {
      gsub => ["AffectedItems.0.InternetMessageId", "<|>", ""]
    }

    mutate {
      rename => {
        "AffectedItems.0.InternetMessageId" => "event.idm.read_only_udm.network.email.mail_id"
      }
    }

    mutate {
      replace => {
        "event_type" => "EMAIL_UNCATEGORIZED"
      }
    }
  }
  else if [msg][Operation] == "MoveToDeletedItems" or [msg][Operation] == "Move" {
    if [msg][DestFolder] != "" {
      mutate {
        replace => {
          "event_type" => "FILE_UNCATEGORIZED"
        }
      }
    }
  }

  if [msg][RecordType] != "" {
    mutate {
      convert => {
        "msg.RecordType" => "string"
      }
      "on_error" => "record_type_string_conversion_failed"
    }

    mutate {
      replace => {
        "record_type_field.key" => "RecordType"
        "record_type_field.value" => "%{msg.RecordType}"
      }
    }

    mutate {
      merge => {
        "security_result.detection_fields" => "record_type_field"
      }
    }
  }

  if [msg][ResultStatus] =~ "(?i)Succeed" {
    mutate {
      replace => {
        "security_result_action" => "ALLOW"
      }
    }
  }
  else if [msg][ResultStatus] =~ "(?)Fail" {
    mutate {
      replace => {
        "security_result_action" => "BLOCK"
      }
    }
  }

  if [msg][ResultStatus] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{msg.ResultStatus}"
      }
    }
  }

  if [security_result_action] != "" {
    mutate {
      merge => {
        "security_result.action" => "security_result_action"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "Manage Engine Reporter Plus"
      "event.idm.read_only_udm.metadata.product_name" => "Manage Engine"
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
      }
    }
  }
  else if [msg][Operation] == "Update" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [msg][Operation] == "Create" {
    if [msg][MailboxOwnerUPN] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "USER_CREATION"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
        }
      }
    }
  }
  else if [msg][UserId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [msg][ClientIP] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [msg][Id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{msg.Id}"
      }
    }
  }

  if [msg][ClientVersion] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{msg.ClientVersion}"
      }
    }
  }
  else if [msg][Version] != "" {
    mutate {
      convert => {
        "msg.Version" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{msg.Version}"
      }
    }
  }

  if [msg][Operation] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{msg.Operation}"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
