# Product: NETWRIX_STEALTHAUDIT
# Category: N/A
# Supported Format:SYSLOG + KV
# Reference: N/A
# Last Updated: 2025-01-20
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "principal" => ""
      "metadata" => ""
      "additional" => ""
      "target" => ""
      "security_result" => ""
      "network" => ""
      "has_principal" => "false"
      "has_user" => "false"
      "timestamp" => ""
      "host_name" => ""
      "vendor" => ""
      "action" => ""
      "kv_msg" => ""
      "PolicyName" => ""
      "Event_Source" => ""
      "Domain" => ""
      "Server" => ""
      "ServerAddress" => ""
      "Perpetrator" => ""
      "ClientAddress" => ""
      "ModifiedObject" => ""
      "DistinguishedName" => ""
      "ObjectClass" => ""
      "SuccessfulChange" => ""
      "BlockedEvent" => ""
      "AttributeName" => ""
      "Operation" => ""
      "NewAttributeValue" => ""
      "OldAttributeValue" => ""
    }
  }

  mutate {
    gsub => ["message", "\\t", " "]
  }

  grok {
    match => {
      "message" => ["<%{INT}>%{INT} %{SYSLOGTIMESTAMP:timestamp} %{DATA:host_name} %{DATA:vendor} Activity Monitor %{DATA} %{DATA:action} %{DATA} %{GREEDYDATA:kv_msg}"]
    }
    overwrite => ["timestamp","host_name","vendor","action","kv_msg"]
    on_error => "grok_failure"
  }
  if [grok_failure] {
    drop {
      tag => "TAG_UNSPECIFIED"
    }
  }

  mutate {
    gsub => ["kv_msg", "\\\s+([0-9a-zA-Z_.-]+?)=", "#$1="]
  }

  mutate {
    gsub => ["kv_msg", "□", "#"]
  }
  kv {
    source => "kv_msg"
    value_split => "="
    field_split => "#"
    on_error => "kv_failure"
  }


  if [host_name]  != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host_name}"
        "principal.asset.hostname" => "%{host_name}"
        "has_principal" => "true"
      }
      on_error => "no_host_name"
    }
  }

  if [action] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{action}"
      }
      on_error => "no_action"
    }
  }

  if [PolicyName] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{PolicyName}"
      }
      on_error => "no_PolicyName"
    }
  }

  if [Event_Source] != "" {
    mutate {
      replace => {
        "principal.resource.name" => "%{Event_Source}"
      }
      on_error => "no_Event_Source"
    }
  }
  if [Domain] != "" {
    mutate {
      replace => {
        "principal.administrative_domain" => "%{Domain}"
      }
      on_error => "no_Domain"
    }
  }

  if [ClientAddress] != "" {
    grok {
      match => {
        "ClientAddress" => "%{IP:ClientAddress}"
      }
      overwrite => ["ClientAddress"]
      on_error => "not_principal_ip"
    }
    if ![not_principal_ip] {
      mutate {
        merge => {
          "principal.ip" => "ClientAddress"
          "principal.asset.ip" => "ClientAddress"
        }
        on_error => "invalid_ClientAddress"
      }
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }

  if [ModifiedObject] != "" {
    mutate {
      replace => {
        "target.resource.name"  => "%{ModifiedObject}"
      }
      on_error => "no_ModifiedObject"
    }
  }

  if [DistinguishedName] != "" {
    mutate {
      replace => {
        "target.file.full_path" => "%{DistinguishedName}"
      }
      on_error => "no_DistinguishedName"
    }
  }

  if [ObjectClass] != "" {
    mutate {
      replace => {
        "principal.resource.resource_subtype" => "%{ObjectClass}"
      }
      on_error => "no_ObjectClass"
    }
  }

  if [SuccessfulChange] != "" {
    mutate {
      replace => {
        "SuccessfulChange_label.key" => "SuccessfulChange"
        "SuccessfulChange_label.value.string_value" => "%{SuccessfulChange}"
      }
      on_error => "no_SuccessfulChange"
    }
    if ![no_SuccessfulChange] {
      mutate {
        merge => {
          "additional.fields" => "SuccessfulChange_label"
        }
        on_error => "no_SuccessfulChange"
      }
    }
  }

  if [BlockedEvent] != "" {
    mutate {
      replace => {
        "BlockedEvent_label.key" => "BlockedEvent"
        "BlockedEvent_label.value.string_value" => "%{BlockedEvent}"
      }
      on_error => "no_BlockedEvent"
    }
    if ![no_BlockedEvent] {
      mutate {
        merge => {
          "additional.fields" => "BlockedEvent_label"
        }
        on_error => "no_BlockedEvent"
      }
    }
  }

  if [AttributeName] != "" {
    mutate {
      replace => {
        "AttributeName_label.key" => "AttributeName"
        "AttributeName_label.value.string_value" => "%{AttributeName}"
      }
      on_error => "no_AttributeName"
    }
    if ![no_AttributeName] {
      mutate {
        merge => {
          "additional.fields" => "AttributeName_label"
        }
        on_error => "no_AttributeName"
      }
    }
  }

  if [NewAttributeValue]  != "" {
    mutate {
      replace => {
        "principal.file.full_path" => "%{NewAttributeValue}"
      }
      on_error => "no_NewAttributeValue"
    }
  }

  if [OldAttributeValue] != "" {
    mutate {
      replace => {
        "OldAttributeValue_label.value.string_value" => "%{OldAttributeValue}"
        "OldAttributeValue_label.key" => "OldAttributeValue"
      }
      on_error => "no_OldAttributeValue"
    }
    if ![no_OldAttributeValue] {
      mutate {
        merge => {
          "additional.fields" => "OldAttributeValue_label"
        }
        on_error => "no_OldAttributeValue"
      }
    }
  }

  if [ServerAddress] != "" {
    mutate {
      merge => {
        "target.ip" => "%{ServerAddress}"
        "target.asset.ip" => "%{ServerAddress}"
      }
      on_error => "no_ServerAddress"
    }
    mutate {
      replace => {
        "has_target" => "true"
     }
      on_error => "no_ServerAddress"
    }
  }

  if [Perpetrator] != "" {
    grok {
      match => {
        "Perpetrator" => ["INT\\\\%{GREEDYDATA:Perpetrator}"]
      }
      overwrite => ["Perpetrator"]
      on_error => "Perpetrator_grok_failure"
    }
    mutate {
      replace => {
        "principal.user.userid" => "%{Perpetrator}"
        "has_user" => "true"
      }
      on_error => "no_Perpetrator"
    }
  }

  if [DistinguishedName] != "" and [has_principal] == "true" and [Operation] == "Read" {
    mutate {
      replace => {
        "metadata.event_type" => "FILE_READ"
      }
      on_error => "no_Operation"
    }
  }
  else if [DistinguishedName] != "" and [has_principal] == "true" and [Operation] == "Create" {
    mutate {
      replace => {
        "metadata.event_type" => "FILE_CREATION"
      }
      on_error => "no_Operation"
    }
  }
  else if [DistinguishedName] != "" and [has_principal] == "true" and [Operation] == "Delete" {
    mutate {
      replace => {
        "metadata.event_type" => "FILE_DELETION"
      }
      on_error => "no_Operation"
    }
  }
  else if [DistinguishedName] != "" and [has_principal] == "true" and [Operation] == "Rename" {
    mutate {
      replace => {
        "metadata.event_type" => "FILE_MODIFICATION"
      }
      on_error => "no_Operation"
    }
  }
  else if [DistinguishedName] != "" and [has_principal] == "true" and [Operation] == "Update" {
    mutate {
      replace => {
        "metadata.event_type" => "FILE_MODIFICATION"
      }
      on_error => "no_Operation"
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
      on_error => "no_principal"
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
      on_error => "no_user"
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
      on_error => "no_event_type"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_sec_result"
    }
  }
  mutate {
    replace => {
      "metadata.vendor_name" => "NETWRIX_STEALTHAUDIT"
      "metadata.product_name" => "NETWRIX_STEALTHAUDIT"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
