# Product: TERADATA DB
# Category: Database log types
# Supported Format: SYSLOGgcert
# Reference: N/A
# Last Updated: 2025-06-17
# Copyright 2025 Google SecOps

filter {
  # Initialize variables
  mutate {
    replace => {
      "ts" => ""
      "host_name" => ""
      "profile_name" => ""
      "proc_id" => ""
      "collect_timestamp" => ""
      "user_id" => ""
      "user_name" => ""
      "default_database" => ""
      "session_id" => ""
      "logon_date_time" => ""
      "logon_source" => ""
      "app_id" => ""
      "client_id" => ""
      "client_addr" => ""
      "error_code" => ""
      "error_text" => ""
      "statement_type" => ""
      "statement_group" => ""
      "query_text" => ""
      "request_mode" => ""
      "tt_granularity" => ""
      "csv_data" => ""
      "logonSource" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "security_result" => ""
      "has_principal" => ""
      "has_target_resource" => ""
      "has_principal_user" => ""
      "statementtype_value_label" => ""
      "Production" => ""
      "protocol_label" => ""
      "protocol" => ""
      "remote_hostname" => ""
      "remote_hostname_label" => ""
      "logon_details" => ""
      "logon_details_label" => ""
      "port" => ""
      "connection_id" => ""
      "connection_id_label" => ""
      "cid" => ""
      "cid_label" => ""
      "jdbc_driver_info" => ""
      "jdbc_driver_info_label" => ""
      "profile_name_label" => ""
      "port_label" => ""
    }
  }
  mutate {
    gsub => [
      "message", '\"\\|\"', "|"
    ]
    on_error => "gsub_failure"
  }
  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:ts}\\s+%{HOSTNAME:host_name} (%{DATA:profile_name})?\\|%{INT:proc_id}\\|%{TIMESTAMP_ISO8601:collect_timestamp}\\|%{INT:user_id}\\|%{DATA:user_name}\\|%{DATA:default_database}\\|%{INT:session_id}\\|%{TIMESTAMP_ISO8601:logon_date_time}\\|%{DATA}\\s+%{DATA:logon_source}\\|%{DATA:app_id}\\s+\\|%{DATA:client_id}\\s+\\|%{IP:client_addr}\\s+\\|%{INT:error_code}\\|%{DATA:error_text}\\|%{DATA:statement_type}\\s+\\|%{DATA:statement_group}\\|%{DATA:query_text}\\|%{DATA:request_mode}\\s+\\|%{GREEDYDATA:tt_granularity}",
        "%{DATA:Production}\\|%{TIMESTAMP_ISO8601:collect_timestamp}\\|%{DATA:user_id}\\|%{DATA:user_name}\\|%{DATA:default_database}\\|%{DATA:session_id}\\|%{TIMESTAMP_ISO8601:logon_date_time}\\|%{DATA:logon_source}\\|%{DATA:app_id}\\|%{DATA:client_id}\\|%{IP:client_addr}\\s+\\|%{DATA:error_code}\\|%{DATA:error_text}\\|%{DATA:statement_type}\\|%{DATA:statement_group}\\|%{DATA:query_text}\\|%{DATA:request_mode}\\|%{GREEDYDATA:tt_granularity}",
        "%{DATA:Production}\\|%{TIMESTAMP_ISO8601:collect_timestamp}\\|%{DATA:user_id}\\|%{DATA:user_name}\\|%{DATA:default_database}\\|%{DATA:session_id}\\|%{TIMESTAMP_ISO8601:logon_date_time}\\|%{DATA:logon_source}\\|%{DATA:app_id}\\|%{DATA:client_id}\\|%{DATA:client_addr}\\s+\\|%{DATA:error_code}\\|%{DATA:error_text}\\|%{DATA:statement_type}\\|%{DATA:statement_group}\\|%{DATA:query_text}\\|%{DATA:request_mode}\\|%{GREEDYDATA:tt_granularity}",
      ]
    }
    overwrite => ["proc_id", "collect_timestamp", "user_id", "user_name", "default_database", "session_id", "logon_date_time", "logon_source", "app_id", "client_id", "client_addr", "error_code", "error_text", "statement_type", "statement_group", "query_text", "request_mode", "tt_granularity", "host_name", "profile_name", "ts", "Production"]
    on_error => "grok_failure"
  }
  if [user_id] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{user_id}"
      }
      on_error => "user_id_failure"
    }
    if ![user_id_failure] {
      mutate {
        replace => {
          "has_principal_user" => "true"
        }
        on_error => "has_principal_failure"
      }
    }
  }
  if [user_name] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{user_name}"
      }
      on_error => "user_name_failure"
    }
  }
  if [logon_source] != "" {
    mutate {
      replace => {
        "target.resource.parent" => "%{logon_source}"
      }
      on_error => "logon_source_failure"
    }
    if ![logon_source_failure] {
      mutate {
        replace => {
          "has_target_resource" => "true"
        }
        on_error => "has_target_failure"
      }
    }
  }
  if [app_id] != "" {
    mutate {
      replace => {
        "target.asset.product_object_id" => "%{app_id}"
      }
      on_error => "app_id_failure"
    }
  }
  if [client_id] != "" {
    mutate {
      replace => {
        "target.asset.asset_id" => "CLIENT_ID:%{client_id}"
      }
      on_error => "client_id_failure"
    }
  }
  if [error_code] not in ["", "null", "NULL", "0"] {
    mutate {
      replace => {
        "network.http.response_code" => "%{error_code}"
      }
      on_error => "error_code_failure"
    }
    if ![error_code_failure] {
      mutate {
        convert => {
          "network.http.response_code" => "integer"
        }
        on_error => "error_code_failure"
      }
    }
  }
  if [statement_type] != "" {
    mutate {
      replace => {
        "statementtype_value_label.key" => "statement_type_value"
        "statementtype_value_label.value" => "%{statement_type}"
      }
      on_error => "statement_type_failure"
    }
    if ![statement_type_failure] {
      mutate {
        merge => {
          "security_result.about.labels" => "statementtype_value_label"
        }
        on_error => "statement_type_failure"
      }
    }
  }
  if [statement_group] != "" {
    mutate {
      replace => {
        "principal.user.groupid" => "%{statement_group}"
      }
      on_error => "statement_group_failure"
    }
  }
  if [request_mode] != "" {
    mutate {
      replace => {
        "target.resource.resource_subtype" => "%{request_mode}"
      }
      on_error => "request_mode_failure"
    }
    if ![request_mode_failure] {
      mutate {
        replace => {
          "has_target_resource" => "true"
        }
        on_error => "has_target_failure"
      }
    }
  }
  if [tt_granularity] != "" {
    mutate {
      replace => {
        "target.resource.product_object_id" => "%{tt_granularity}"
      }
      on_error => "tt_granularity_failure"
    }
    if ![tt_granularity_failure] {
      mutate {
        replace => {
          "has_target_resource" => "true"
        }
        on_error => "has_target_failure"
      }
    }
  }
  if [logon_date_time] != "" {
    date {
      match => ["logon_date_time", "ISO8601", "yyyy-MM-dd HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "logon_date_time_failure"
    }
  }
  if [collect_timestamp] != "" {
    date {
      match => ["collect_timestamp","RFC3339", "UNIX_MS", "UNIX", "ISO8601", "yyyy-MM-dd HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.collected_timestamp"
      on_error => "collect_timestamp_failure"
    }
  }
  if [Production] != "" {
    grok {
      match => {
        "Production" => [
          "%{DATA}%{TIME}\\s+%{DATA:host_name}\\s+\\|%{GREEDYDATA:proc_id}",
          "%{DATA}%{TIME}\\s+%{DATA:host_name}\\s+%{DATA:profile_name}\\|%{GREEDYDATA:proc_id}",
          "%{DATA}%{TIME}\\s+%{DATA:host_name}\\s+%{GREEDYDATA:proc_id}"
        ]
      }
      overwrite => ["host_name","proc_id", "profile_name"]
      on_error => "production_grok_failure"
    }
  }
  if [profile_name] != "" {
    mutate {
      replace => {
        "profile_name_label.key" => "profile_name_value"
        "profile_name_label.value" => "%{profile_name}"
      }
      on_error => "profile_name_failure"
    }
    if ![profile_name_failure] {
      mutate {
        merge => {
          "target.resource.attribute.labels" => "profile_name_label"
        }
        on_error => "profile_name_failure"
      }
      if ![profile_name_failure] {
        mutate {
          replace => {
            "has_target_resource" => "true"
          }
          on_error => "has_target_failure"
        }
      }
    }
  }
  if [proc_id] != "" {
    mutate {
      replace => {
        "target.resource.id" => "%{proc_id}"
      }
      on_error => "proc_id_failure"
    }
    if ![proc_id_failure] {
      mutate {
        replace => {
          "has_target_resource" => "true"
        }
        on_error => "has_target_failure"
      }
    }
  }
  if [client_addr] != "" {
    grok {
      match => {
        "client_addr" => [
          "%{IP:client_addr}"
        ]
      }
      overwrite => ["client_addr"]
      on_error => "client_addr_grok_failure"
    }
    if ![client_addr_grok_failure] {
      mutate {
        merge => {
          "principal.ip" => "client_addr"
          "principal.asset.ip" => "client_addr"
        }
        on_error => "client_addr_failure"
      }
      if ![client_addr_failure] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
          on_error => "has_principal_failure"
        }
      }
    }
  }
  if [collect_timestamp] != "" {
    mutate {
      replace => {
        "collect_timestamp_label.key" => "collect_timestamp"
        "collect_timestamp_label.value.string_value" => "%{collect_timestamp}"
      }
      on_error => "collect_timestamp_failure"
    }
    if ![collect_timestamp_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "collect_timestamp_label"
        }
        on_error => "collect_timestamp_failure"
      }
    }
  }
  if [default_database] != "" {
    mutate {
      replace => {
        "target.resource.name" => "%{default_database}"
        "target.resource.resource_type" => "DATABASE"
      }
      on_error => "default_database_failure"
    }
    if ![default_database_failure] {
      mutate {
        replace => {
          "has_target_resource" => "true"
        }
        on_error => "has_target_failure"
      }
    }
  }
  if [error_code] != "" {
    mutate {
      replace => {
        "error_code_label.key" => "error_code"
        "error_code_label.value" => "%{error_code}"
      }
      on_error => "error_code_failure"
    }
    if ![error_code_failure] {
      mutate {
        merge => {
          "security_result.detection_fields" => "error_code_label"
        }
        on_error => "error_code_failure"
      }
    }
  }
  if [error_text] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{error_text}"
      }
      on_error => "error_text_failure"
    }
  }
  if [host_name] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host_name}"
        "principal.asset.hostname" => "%{host_name}"
      }
      on_error => "host_name_failure"
    }
    if ![host_name_failure] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
        on_error => "has_principal_failure"
      }
    }
  }
  if [logon_date_time] != "" {
    mutate {
      replace => {
        "logon_date_time_label.key" => "logon_date_time"
        "logon_date_time_label.value.string_value" => "%{logon_date_time}"
      }
      on_error => "logon_date_time_failure"
    }
    if ![logon_date_time_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "logon_date_time_label"
        }
        on_error => "logon_date_time_failure"
      }
    }
  }
  if [logon_source] != "" {
    grok {
      match => {
        "logon_source" => [
          "%{GREEDYDATA:logonSource}LSS\\s+"
        ]
      }
      overwrite => ["logonSource"]
      on_error => "logon_source_grok_failure"
    }
    mutate {
      replace => {
        "logon_source_label.key" => "logon_source"
        "logon_source_label.value.string_value" => "%{logonSource}LSS"
      }
      on_error => "logon_source_failure"
    }
    if ![logon_source_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "logon_source_label"
        }
        on_error => "logon_source_failure"
      }
    }
  }
  if [logon_source] != "" {
    grok {
      match => {
        "logon_source" => [
          "(%{DATA:protocol})\\s+%{DATA}\\s+%{IP}\\s+%{DATA:remote_hostname}\\s+%{INT:port}\\s+%{DATA}\\s+%{DATA}\\s+%{GREEDYDATA:logon_details}",
          "%{DATA:connection_id}\\s+%{IP}\\s+%{DATA};%{DATA:remote_hostname}/%{IP}:%{INT:port}\\s+CID=%{DATA:cid}\\s+%{DATA}\\s+%{DATA:jdbc_driver_info}\\s+%{GREEDYDATA:logon_details}"
        ]
      }
      overwrite => ["protocol", "remote_hostname", "port", "logon_details", "connection_id", "cid", "jdbc_driver_info"]
      on_error => "logon_source_grok_failure"
    }
  }
  if [protocol] != "" {
    mutate {
      replace => {
        "protocol_label.key" => "protocol_value"
        "protocol_label.value.string_value" => "%{protocol}"
      }
      on_error => "protocol_failure"
    }
    if ![protocol_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "protocol_label"
        }
        on_error => "protocol_failure"
      }
    }
  }
  if [remote_hostname] != "" {
    mutate {
      replace => {
        "remote_hostname_label.key" => "remote_hostname_value"
        "remote_hostname_label.value.string_value" => "%{remote_hostname}"
      }
      on_error => "remote_hostname_failure"
    }
    if ![remote_hostname_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "remote_hostname_label"
        }
        on_error => "remote_hostname_failure"
      }
    }
  }
  if [logon_details] != "" {
    mutate {
      replace => {
        "logon_details_label.key" => "logon_details_value"
        "logon_details_label.value.string_value" => "%{logon_details}"
      }
      on_error => "logon_details_failure"
    }
    if ![logon_details_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "logon_details_label"
        }
        on_error => "logon_details_failure"
      }
    }
  }
  if [port] != "" {
    mutate {
      replace => {
        "port_label.key" => "teradata_port"
        "port_label.value.string_value" => "%{port}"
      }
      on_error => "port_failure"
    }
    if ![port_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "port_label"
        }
        on_error => "port_failure"
      }
    }
  }
  if [connection_id] != "" {
    mutate {
      replace => {
        "connection_id_label.key" => "connection_id_value"
        "connection_id_label.value.string_value" => "%{connection_id}"
      }
      on_error => "connection_id_failure"
    }
    if ![connection_id_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "connection_id_label"
        }
        on_error => "connection_id_failure"
      }
    }
  }
  if [cid] != "" {
    mutate {
      replace => {
        "cid_label.key" => "cid_value"
        "cid_label.value.string_value" => "%{cid}"
      }
      on_error => "cid_failure"
    }
    if ![cid_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "cid_label"
        }
        on_error => "cid_failure"
      }
    }
  }
  if [jdbc_driver_info] != "" {
    mutate {
      replace => {
        "jdbc_driver_info_label.key" => "jdbc_driver_info_value"
        "jdbc_driver_info_label.value.string_value" => "%{jdbc_driver_info}"
      }
      on_error => "jdbc_driver_info_failure"
    }
    if ![jdbc_driver_info_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "jdbc_driver_info_label"
        }
        on_error => "jdbc_driver_info_failure"
      }
    }
  }
  if [query_text] != "" {
    mutate {
      replace => {
        "target.process.command_line" => "%{query_text}"
      }
      on_error => "query_text_failure"
    }
  }
  if [request_mode] != "" {
    mutate {
      replace => {
        "request_mode_label.key" => "request_mode"
        "request_mode_label.value.string_value" => "%{request_mode}"
      }
      on_error => "request_mode_failure"
    }
    if ![request_mode_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "request_mode_label"
        }
        on_error => "request_mode_failure"
      }
    }
  }
  if [session_id] != "" {
    mutate {
      replace => {
        "network.session_id" => "%{session_id}"
      }
      on_error => "session_id_failure"
    }
  }
  if [statement_group] != "" {
    mutate {
      replace => {
        "statement_group_label.key" => "statement_group"
        "statement_group_label.value.string_value" => "%{statement_group}"
      }
      on_error => "statement_group_failure"
    }
    if ![statement_group_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "statement_group_label"
        }
        on_error => "statement_group_failure"
      }
    }
  }
  if [statement_type] != "" {
    mutate {
      replace => {
        "statement_type_label.key" => "statement_type"
        "statement_type_label.value.string_value" => "%{statement_type}"
      }
      on_error => "statement_type_failure"
    }
    if ![statement_type_failure] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "statement_type_label"
        }
        on_error => "statement_type_failure"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "TERADATA"
      "event.idm.read_only_udm.metadata.product_name" => "TERADATA_DB"
    }
  }
  date {
    match => ["ts", "MMM  d HH:mm:ss", "MMM  dd HH:mm:ss", "SYSLOGTIMESTAMP", "RFC3339", "UNIX", "ISO8601", "UNIX_MS"]
    rebase => true
    on_error => "date_failure"
  }
  if [has_principal] == "true" and [has_principal_user] == "true" and [has_target_resource] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_RESOURCE_ACCESS"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
      on_error => "principal_failure"
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
      on_error => "target_failure"
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
      on_error => "network_failure"
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_failure"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
