# Product:THREATLOCKER
# Category:THREATLOCKER
# Supported Format:JSON
# Reference:N/A
# Last Updated:2023-06-18
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "fp" => ""
      "pyid" => ""
      "u" => ""
      "a" => ""
      "h" => ""
      "pn" => ""
      "sn" => ""
      "dt" => ""
      "at" => ""
      "s" => ""
      "pid" => ""
      "rf" => ""
      "p" => ""
      "ap" => ""
      "e" => ""
      "organizationId" => ""
      "computerId" => ""
      "hostname" => ""
      "mo" => ""
      "n" => ""
      "s256" => ""
      "rp" => ""
      "mid" => ""
      "dan" => ""
      "security_result" => ""
      "action" => ""
      "outcome" => ""
      "src_ip" => ""
      "dest_ip" => ""
      "dest_port" => ""
      "ip_protocol" => ""
      "dest_host" => ""
      "domain" => ""
    }
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_in_json"
  }

  date {
    match => ["t","yyyy-MM-ddTHH:mm:ss"]
  }

  if [at] == "network" {
    grok {
      match => {
        "fp" => [
          "Src: %{IP:src_ip}; Dest: (\\[)?%{IP:dest_ip}(\\])?:%{INT:dest_port}"
          "%{DATA:dest_host}\\(%{IP:dest_ip}\\):%{INT:dest_port}"
          "(\\[)?%{IP:dest_ip}(\\])?:%{INT:dest_port}"
        ]
      }
      overwrite => ["src_ip", "dest_host", "dest_ip", "dest_port"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [at] in ["execute", "install", "newprocess"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.file.full_path" => "%{fp}"
      }
    }
  }
  else if [at] in ["write", "read", "delete", "move"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{fp}"
      }
    }
  }
  else if [at] == ["registry"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.registry.registry_key" => "%{fp}"
      }
    }
  }

  if [src_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "src_ip"
      }
    }
  }

  if [dest_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "dest_ip"
      }
    }
  }

  if [dest_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{dest_host}"
      }
    }
  }

  if [dest_port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.port" => "%{dest_port}"
      }
      convert => {
        "event.idm.read_only_udm.target.port" => "integer"
      }
    }
  }

  if [pyid] != "" {
    mutate {
      replace => {
        "security_result.rule_id" => "%{pyid}"
      }
    }
  }

  if [u] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.user_display_name" => "%{u}"
      }
    }
    grok {
      match => {
        "u" => [
          "%{DATA:domain}\\\\%{GREEDYDATA:u}"
        ]
      }
      on_error => "not_match"
      overwrite => ["u", "domain"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{u}"
      }
    }
  }

  if [a] == 1 {
    mutate {
      replace => {
        "action" => "ALLOW"
      }
    }
  }
  else if [a] == 2 {
    mutate {
      replace => {
        "action" => "BLOCK"
      }
    }
  }
  else if [a] == 3 {
    mutate {
      replace => {
        "action" => "CHALLENGE"
      }
    }
  }
  else if [a] == 4 {
    mutate {
      replace => {
        "action" => "ALLOW_WITH_MODIFICATION"
      }
    }
  }
  else if [a] == 5 {
    mutate {
      replace => {
        "action" => "UNKNOWN_ACTION"
      }
    }
  }
  else if [a] == 6 {
    mutate {
      replace => {
        "action" => "QUARANTINE"
      }
    }
  }

  if [action] != "" {
    mutate {
      merge => {
        "security_result.action" => "action"
      }
    }
  }

  if [p] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{p}"
      }
    }
  }

  if [hostname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{hostname}"
      }
    }
  }

  if [pn] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.file.full_path" => "%{pn}"
      }
    }
  }

  if [n] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{n}"
      }
    }
  }

  if [h] != "" {
    mutate {
      lowercase => ["h"]
    }
  }

  if [h] =~ "^[0-9a-f]+$" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.sha1" => "%{h}"
      }
    }
  }

  if [sn] =~ "Tcp" {
    mutate {
      replace => {
        "ip_protocol" => "TCP"
      }
    }
  }

  if [ip_protocol] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.ip_protocol" => "%{ip_protocol}"
      }
    }
  }

  if [dt] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.category" => "%{dt}"
      }
    }
  }

  if [at] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{at}"
      }
    }
  }

  mutate {
    convert => {
      "mo" => "string"
    }
  }

  if [mo] == "true" {
    mutate {
      replace => {
        "outcome.key" => "Monitor mode status"
        "outcome.value" => "monitor mode on"
      }
    }
  }
  else if [mo] == "false" {
    mutate {
      replace => {
        "outcome.key" => "Monitor mode status"
        "outcome.value" => "monitor mode off"
      }
    }
  }

  if [outcome] != "" {
    mutate {
      merge => {
        "security_result.outcomes" => "outcome"
      }
    }
  }

  if [s] not in ["", 0] {
    mutate {
      convert => {
        "s" => "string"
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.size" => "%{s}"
      }
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.target.file.size" => "uinteger"
      }
    }
  }

  if [pid] != "" {
    mutate {
      convert => {
        "pid" => "string"
      }
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.pid" => "%{pid}"
      }
    }
  }

  if [p] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{p}"
      }
    }
  }

  if [ap] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.application" => "%{ap}"
      }
    }
  }

  if [e] != "" {
    mutate {
      convert => {
        "e" => "string"
      }
    }
    mutate {
      replace => {
        "encryption_status_label.key" => "Encryption Status"
        "encryption_status_label.value" => "%{e}"
      }
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "encryption_status_label"
      }
    }
  }

  if [mid] != "" {
    mutate {
      replace => {
        "maintenanceId_label.key" => "Maintenance Id"
        "maintenanceId_label.value" => "%{mid}"
      }
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "maintenanceId_label"
      }
    }
  }

 if [rf] != "" {
    mutate {
      convert => {
        "rf" => "string"
      }
    }
    mutate {
      replace => {
        "ringfence_label.key" => "Ring Fence"
        "ringfence_label.value" => "%{rf}"
      }
    }
    mutate {
      merge => {
        "security_result.about.resource.attribute.labels" => "ringfence_label"
      }
    }
  }

  if [organizationId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.resource.id" => "%{organizationId}"
      }
    }
  }

  if [computerId] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.asset.asset_id" => "ComputerId: %{computerId}"
      }
    }
  }

  if [s256] != "" {
    mutate {
      lowercase => ["s256"]
    }
  }

  if [s256] =~ "^[0-9a-f]+$" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.sha256" => "%{s256}"
        "event.idm.read_only_udm.target.process.file.sha256" => "%{s256}"
      }
    }
  }

  if [rp] {
    mutate {
      replace => {
        "_auth_mechanism" => "REMOTE"
      }
      merge => {
        "event.idm.read_only_udm.extensions.auth.mechanism"  => "_auth_mechanism"
      }
    }
  }

  if [dan] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.application" => "%{dan}"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [src_ip] != "" and [dest_ip] != "" and [ip_protocol] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [fp] != "" and [pn] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "PROCESS_UNCATEGORIZED"
      }
    }
  }
  if [at] == "network" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  if [at] in ["execute", "install"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "PROCESS_LAUNCH"
      }
    }
  }
  else if [at] == "newprocess" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "PROCESS_OPEN"
      }
    }
  }
  else if [at] == "write" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "FILE_MODIFICATION"
      }
    }
  }
  else if [at] == "read" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "FILE_READ"
      }
    }
  }
  else if [at] == "delete" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "FILE_DELETION"
      }
    }
  }
  else if [at] == "move" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "FILE_MODIFICATION"
      }
    }
  }
  else if [at] == "registry" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "REGISTRY_UNCATEGORIZED"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "THREATLOCKER"
      "event.idm.read_only_udm.metadata.vendor_name" => "THREATLOCKER"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
