# Product: HADOOP
# Category: open-source software
# Supported Format: SYSLOG + KV
# Reference: https://hadoop.apache.org/
# Last Updated: 2026-02-23
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "action" => ""
      "access" => ""
      "agentHost" => ""
      "allowed" => ""
      "auth_type" => ""
      "call" => ""
      "call_context" => ""
      "cliIP" => ""
      "cluster_name" => ""
      "day" => ""
      "description" => ""
      "dhost" => ""
      "driver" => ""
      "dst" => ""
      "dstport" => ""
      "enforcer" => ""
      "event_count" => ""
      "event_dur_ms" => ""
      "evtTime" => ""
      "fname" => ""
      "hours" => ""
      "id" => ""
      "json_data" => ""
      "log_data" => ""
      "logType" => ""
      "method" => ""
      "minutes" => ""
      "month" => ""
      "observer" => ""
      "perm" => ""
      "policy" => ""
      "product" => ""
      "product_event" => ""
      "proto" => ""
      "reason" => ""
      "repo" => ""
      "resType" => ""
      "result" => ""
      "reqUser" => ""
      "resource" => ""
      "Retry" => ""
      "seq_num" => ""
      "shost" => ""
      "src" => ""
      "seconds" => ""
      "severity" => ""
      "security_result" => ""
      "srcport" => ""
      "summary" => ""
      "suser" => ""
      "tags" => ""
      "thread" => ""
      "url" => ""
      "vendor" => ""
      "version" => ""
      "year" => ""
      "ip" => ""
      "ugi" => ""
      "tip" => ""
      "cmd" => ""
      "has_target" => "false"
      "kv_data" => ""
      "principal_network_domain" => ""
      "timestamp_details" => ""
      "collection_time_details" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "[<]%{INT}[>]%{WORD:month} %{INT:day} %{INT:hours}:%{INT:minutes}:%{INT:seconds} %{DATA:observer} (?P<product>%{DATA}-%{DATA})-%{DATA:vendor}: %{INT}-%{INT}-%{INT} %{INT}:%{INT}:%{INT},%{INT} %{DATA:severity} [[]%{DATA:thread}[]]: %{DATA:product_event} \\(%{DATA:summary}\\) - %{GREEDYDATA:description}"
        "[<]%{INT}[>]%{WORD:month} %{INT:day} %{INT:hours}:%{INT:minutes}:%{INT:seconds} %{DATA:observer} (?P<product>%{DATA}-%{DATA})-%{DATA:vendor}: %{INT}-%{INT}-%{INT} %{INT}:%{INT}:%{INT},%{INT} %{DATA:severity} [[]%{DATA:product_event}: %{DATA:thread}[]]: ql.Driver \\(%{DATA:driver}\\) - %{GREEDYDATA:description}"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds}\\s+%{DATA:observer}\\s+(?P<product>%{DATA}-%{DATA})-%{DATA:vendor}:\\s+%{INT}-%{INT}-%{INT}\\s+%{INT}:%{INT}:%{INT},%{INT}\\s+%{DATA:severity}\\s\\s%{DATA:product_event} [(]%{DATA}[.]%{DATA}[)] - %{DATA}: %{GREEDYDATA:json_data}"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds}\\s+%{DATA:observer}\\s+(?P<product>%{DATA}-%{DATA})-%{DATA:vendor}:\\s+%{INT}-%{INT}-%{INT}\\s+%{INT}:%{INT}:%{INT},%{INT}\\s+%{DATA:severity}\\s\\s%{DATA:product_event}\\s+[(]%{DATA}[.]%{DATA}[)]\\s+%{GREEDYDATA:description}"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds}\\s+%{DATA:observer}\\s+(?P<product>%{DATA}-%{DATA})-%{DATA:vendor}:\\s+%{INT}-%{INT}-%{INT}\\s+%{INT}:%{INT}:%{INT},%{INT}\\s+%{DATA:severity}\\s\\s%{DATA:product_event}\\s+%{GREEDYDATA:description}"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds}\\s+%{DATA:observer}\\s+(?P<product>%{DATA}-%{DATA})-%{DATA:vendor}:\\s+%{INT}-%{INT}-%{INT}\\s+%{INT}:%{INT}:%{INT},%{INT}\\s+%{DATA:severity}\\s%{DATA:product_event}:\\s+%{GREEDYDATA:log_data}(\\s+)?"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds} %{DATA:observer} (?P<product>%{DATA}-%{DATA})-%{DATA:vendor}: \\[%{INT}/%{DATA}/%{INT}\\s+%{INT}:%{INT}:%{INT} %{DATA}\\] %{DATA:product_event}\\s+%{DATA:severity}\\s+%{IPORHOST:src} %{DATA:suser} - \"%{DATA:method} %{GREEDYDATA:url}" #"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds} %{DATA:observer} (?P<product>%{DATA}-%{DATA})-%{DATA:vendor}:\\s+at %{DATA:url}\\(%{DATA:description}\\)"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds}\\s+%{DATA:observer}\\s+(?P<product>%{DATA}-%{DATA})-%{DATA:vendor}:\\s+%{INT}-%{INT}-%{INT}\\s+%{INT}:%{INT}:%{INT},%{INT}\\s+%{DATA:severity}\\s\\s%{GREEDYDATA:description}"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds}\\s+%{DATA:observer}\\s+(?P<product>%{DATA}-%{DATA})-%{DATA:vendor}:\\s+%{INT}-%{INT}-%{INT}\\s+%{INT}:%{INT}:%{INT},%{INT}\\s+%{DATA:severity}\\s%{DATA:product_event} [(]%{DATA}[.]%{DATA}[)] - %{GREEDYDATA:description}"
        "[<]%{INT}[>]%{WORD:month} %{INT:day} %{INT:hours}:%{INT:minutes}:%{INT:seconds} %{DATA:observer} (?P<product>%{DATA}-%{DATA})-%{DATA:vendor}: %{TIMESTAMP_ISO8601}\\s+%{DATA:severity} \\[.*\\] %{DATA:product_event}: ugi=%{DATA:ugi}\\tip=%{IP:tip}\\tcmd=%{GREEDYDATA:cmd}"
        "[<]%{INT}[>]%{WORD:month} %{INT:day} %{INT:hours}:%{INT:minutes}:%{INT:seconds} %{DATA:observer} (?P<product>%{DATA}-%{DATA})-%{DATA:vendor}: %{TIMESTAMP_ISO8601}\\s+%{DATA:severity} \\[.*\\] %{DATA:product_event}: %{GREEDYDATA:description}"
        "<%{INT}>(?:%{TIMESTAMP_ISO8601:timestamp_details}|%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds})\\s+%{DATA:observer}\\s+%{DATA:vendor}\\s+%{TIMESTAMP_ISO8601:collection_time_details},%{INT}\\s+%{DATA:severity}\\s+%{DATA:product_event}:\\s+%{GREEDYDATA:kv_data}"
        "[<]%{INT}[>]%{WORD:month}\\s+%{INT:day}\\s+%{INT:hours}:%{INT:minutes}:%{INT:seconds}\\s+%{DATA:observer}\\s+(?P<product>%{DATA}-%{DATA})-%{DATA:vendor}:%{GREEDYDATA:description}"
      ]
    }
    overwrite => ["collection_time_details","timestamp_details","kv_data","log_data", "day", "description", "driver", "hours", "method", "minutes", "month", "product", "product_event", "observer", "seconds", "severity", "src", "summary", "suser", "thread", "url", "vendor", "version", "year", "json_data", "ugi", "tip", "cmd" ]
    on_error => "error_grok00"
  }

  if [error_grok00] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }
  mutate {
    gsub => ["kv_data","\\t","#"]
  }
  kv {
    source => "kv_data"
    field_split => "#"
    value_split => "="
    on_error => "error_kv_data"
  }
# Default Event Data
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "%{vendor}"
      "event.idm.read_only_udm.metadata.product_name" => "%{product}"
      "event.idm.read_only_udm.metadata.product_version" => "%{version}"
      "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
    }
  }
# Set Time
  if [year] != "" {
    mutate {
      replace => {
        "mydate" => "%{month} %{day} %{year} %{hours}:%{minutes}:%{seconds}"
      }
      on_error => "no_year"
    }
    if ![no_year] {
      date {
        match => [
          "mydate",
          "ISO8601",
          "UNIX",
          "UNIX_MS",
          "TAI64N",
          "MMM dd yyyy HH:mm:ss",
          "MMM d yyyy HH:mm:ss",
          "MM dd yyyy HH:mm:ss",
          "MM d yyyy HH:mm:ss",
          "M dd yyyy HH:mm:ss",
          "M d yyyy HH:mm:ss"
        ]
      }
    }
  }
  else if [timestamp_details] != "" {
    date {
      match => [ "timestamp_details", "yyyy-MM-ddTHH:mm:ssZZ" ]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "error_date_parse"
    }
  }
  else {
    mutate {
      replace => {
        "mydate" => "%{month} %{day} %{hours}:%{minutes}:%{seconds}"
      }
      on_error => "no_date"
    }
    if ![no_date] {
      date {
        match => [
          "mydate",
          "ISO8601",
          "UNIX",
          "UNIX_MS",
          "TAI64N",
          "MMM dd HH:mm:ss",
          "MMM d HH:mm:ss",
          "MM dd HH:mm:ss",
          "MM d HH:mm:ss",
        ]
        rebase => true
      }
    }
  }
  if [collection_time_details] != "" {
    date {
      match => [ "collection_time_details", "yyyy-MM-dd HH:mm:ss" ]
      target => "event.idm.read_only_udm.metadata.collected_timestamp"
      on_error => "collection_time_details_date_parse_error"
    }
  }
# Json Data
  if [json_data] != "" {
    json {
      source => "json_data"
      array_function => "split_columns"
      on_error => "json_error"
    }
    if [json_error] {
      mutate {
        replace => {
          "description" => "%{json_data}"
        }
      }
    }
    else {
      mutate {
        replace => {
          "src" => "%{cliIP}"
          "suser" => "%{reqUser}"
          "fname" => "%{resource}"
        }
      }
    }
  }
  if ([log_data] != "" and [log_data] =~ "·") or [kv_data] != "" {

    mutate {
      gsub => ["log_data","·","#"]
    }
    kv {
      source => "log_data"
      field_split => "#"
      value_split => "="
    }
    mutate {
      replace => {
        "fname" => "%{src}"
      }
    }
    if [ip] != "" {
      mutate {
        gsub => ["ip","/",""]
      }
      mutate {
        replace => {
          "src" => "%{ip}"
        }
      }
    }

    if [ugi] != "" {
      grok {
        match => {
          "ugi" => [
            "%{DATA:suser}@%{DATA:principal_network_domain}\\s+\\(auth:%{WORD:auth_type}\\)"
            "%{DATA:suser}@.*auth:%{WORD:auth_type}"
          ]
        }
        overwrite => ["suser", "auth_type", "principal_network_domain"]
        on_error => "ugi_grok_error"
      }
    }
    if [principal_network_domain] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.asset.network_domain" => "%{principal_network_domain}"
        }
        on_error => "principal_network_domain_replace_error"
      }
    }
  }
  else {
    if [ugi] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "%{ugi}"
        }
      }
    }
  }
# Grok allowed Data
  grok {
    match => {
      "log_data" => [
        "allowed=%{DATA:allowed}(\\s+)(\\w+)="
      ]
    }
    overwrite => ["allowed"]
    on_error => "error_grok01"
  }

# Grok ugi Data
  grok {
    match => {
      "log_data" => [
        "ugi=%{DATA:suser}(\\s+)%{DATA:auth_type}(\\s+)(\\w+)="
      ]
    }
    overwrite => ["suser", "auth_type"]
    on_error => "error_grok02"
  }
# Grok Domain
  if [suser] =~ "@" {
    grok {
      match => {
        "suser" => [
          "%{DATA:suser}@%{DATA:domain}\\z"
        ]
      }
      overwrite => ["suser", "domain"]
      on_error => "error_grok03"
    }
  }
# Grok src Data
  grok {
    match => {
      "log_data" => [
        "ip=/%{DATA:src}(\\s+)(\\w+)="
      ]
    }
    overwrite => ["src"]
    on_error => "error_grok04"
  }
# Grok cmd Data
  grok {
    match => {
      "log_data" => [
        "cmd=%{DATA:product_event}(\\s+)(\\w+)="
      ]
    }
    overwrite => ["product_event"]
    on_error => "error_grok05"
  }

# Grok dst Data
  grok {
    match => {
      "message" => [
        "dst=%{DATA:dst}(\\s+)(\\w+)="
        "to server: %{DATA:dhost}/%{DATA:dst}:%{INT:dstport}."
        "to connect to /%{DATA:dst}:%{INT:dstport} "
        "connected to /%{DATA:dst}:%{INT:dstport} "
        "server at %{DATA:dhost}/%{DATA:dst}:%{INT:dstport}"
      ]
    }
    overwrite => ["dst", "dhost" ,"dstport" ]
    on_error => "error_grok06"
  }

  if [product_event] == "rename" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{dst}"
      }
    }
  }
# Grok cmd Data
  grok {
    match => {
      "log_data" => [
        "src=%{DATA:fname}(\\s+)(\\w+)="
      ]
    }
    overwrite => ["fname"]
    on_error => "error_grok07"
  }
# Grok perm Data
  grok {
    match => {
      "message" => [
        "perm=%{DATA:perm}(\\s+)(\\w+)="
      ]
    }
    overwrite => ["perm"]
    on_error => "error_grok08"
  }
# Grok proto Data
  grok {
    match => {
      "message" => [
        "proto=%{DATA:proto}(\\s+)(\\w+)="
        "proto=%{DATA:proto}(\\s+)"
        "proto=%{DATA:proto}\\z"
      ]
    }
    overwrite => ["proto"]
    on_error => "error_grok09"
  }
# Grok callerContext Data
  grok {
    match => {
      "message" => [
        "callerContext=%{DATA:call_context}(\\s+)(\\w+)="
        "callerContext=%{DATA:call_context}\\z"
        "callerContext=%{DATA:call_context}"
        "callerContext=%{GREEDYDATA:call_context}"
      ]
    }
    overwrite => ["call_context"]
    on_error => "error_grok10"
  }
# Grok completefile Data
  grok {
    match => {
      "message" => [
        "completeFile:\\s+%{DATA:fname}(\\s+)"
      ]
    }
    overwrite => ["fname"]
    on_error => "error_grok11"
  }
# Grok completefile Data
  grok {
    match => {
      "message" => [
        "from\\s%{DATA:src}:%{INT:srcport}\\s"
        "from\\s%{DATA:src}\\s"
      ]
    }
    overwrite => ["src", "shost", "srcport"]
    on_error => "error_grok12"
  }

# Grok Call Data
  grok {
    match => {
      "message" => [
        "Call#%{DATA:call}\\s"
      ]
    }
    overwrite => ["call" ]
    on_error => "error_grok13"
  }
# Grok Retry Data
  grok {
    match => {
      "message" => [
        "Retry#%{DATA:Retry}\\s"
      ]
    }
    overwrite => ["Retry" ]
    on_error => "error_grok14"
  }
# Grok suser Data
  grok {
    match => {
      "message" => [
        "Authorization successful for %{DATA:suser}\\s+"
      ]
    }
    overwrite => ["suser" ]
    on_error => "error_grok15"
  }
# cluster_name Field
  if [cluster_name] != "" {
    mutate {
      replace => {
        "dst" => "%{cluster_name}"
      }
    }
  }
# tags Field
  if [tags] != "" {
    mutate {
      replace => {
        "additional_tags.key" => "tags"
        "additional_tags.value.string_value" => "%{tags}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_tags"
      }
    }
  }
# event_count Field
  if [event_count] != "" {
    mutate {
      convert => {
        "event_count" => "string"
      }
    }
    mutate {
      replace => {
        "additional_event_count.key" => "event_count"
        "additional_event_count.value.string_value" => "%{event_count}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_event_count"
      }
    }
  }
# seq_num Field
  if [seq_num] != "" {
    mutate {
      convert => {
        "seq_num" => "string"
      }
    }
    mutate {
      replace => {
        "additional_seq_num.key" => "seq_num"
        "additional_seq_num.value.string_value" => "%{seq_num}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_seq_num"
      }
    }
  }
# id Field
  if [id] != "" {
    mutate {
      replace => {
        "additional_id.key" => "id"
        "additional_id.value.string_value" => "%{id}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_id"
      }
    }
  }
# logType Field
  if [logType] != "" {
    mutate {
      replace => {
        "additional_logType.key" => "logType"
        "additional_logType.value.string_value" => "%{logType}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_logType"
      }
    }
  }
# enforcer Field
  if [enforcer] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{enforcer}"
      }
    }
  }
# reason Field
  if [reason] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{reason}"
      }
    }
  }
# policy Field
  if [policy] != "" {
    mutate {
      convert => {
        "policy" => "string"
      }
    }
    mutate {
      replace => {
        "security_result.rule_id" => "%{policy}"
      }
    }
  }
# result Field
  if [result] != "" {
    mutate {
      convert => {
        "result" => "string"
      }
    }
    mutate {
      replace => {
        "additional_result.key" => "result"
        "additional_result.value.string_value" => "%{result}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_result"
      }
    }
  }
# action Field
  if [action] != "" {
    mutate {
      replace => {
        "additional_action.key" => "action"
        "additional_action.value.string_value" => "%{action}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_action"
      }
    }
  }
# resType Field
  if [resType] != "" {
    mutate {
      replace => {
        "additional_resType.key" => "resType"
        "additional_resType.value.string_value" => "%{resType}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_resType"
      }
    }
  }
# access Field
  if [access] != "" {
    mutate {
      replace => {
        "additional_access.key" => "access"
        "additional_access.value.string_value" => "%{access}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_access"
      }
    }
  }
# evtTime Field
  if [evtTime] != "" {
    mutate {
      replace => {
        "additional_evtTime.key" => "evtTime"
        "additional_evtTime.value.string_value" => "%{evtTime}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_evtTime"
      }
    }
  }
# repo Field
  if [repo] != "" {
    mutate {
      replace => {
        "additional_repo.key" => "repo"
        "additional_repo.value.string_value" => "%{repo}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_repo"
      }
    }
  }
# Retry Field
  if [Retry] != "" {
    mutate {
      replace => {
        "additional_Retry.key" => "Retry#"
        "additional_Retry.value.string_value" => "%{Retry}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_Retry"
      }
    }
  }
# driver Field
  if [driver] != "" {
    mutate {
      replace => {
        "additional_driver.key" => "driver"
        "additional_driver.value.string_value" => "%{driver}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_driver"
      }
    }
  }
# call Field
  if [call] != "" {
    mutate {
      replace => {
        "additional_call.key" => "Call#"
        "additional_call.value.string_value" => "%{call}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_call"
      }
    }
  }
# Source Port UDM Field
  if [srcport] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.port" => "%{srcport}"
      }
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.principal.port" => "integer"
      }
    }
  }
# Source Port UDM Field
  if [dstport] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.port" => "%{dstport}"
      }
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.target.port" => "integer"
      }
    }
  }
# Description UDM Field
  if [description] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{description}"
      }
    }
  }
# auth_type Field
  if [auth_type] != "" {
    mutate {
      gsub => ["auth_type","\\(auth:",""]
    }
     mutate {
      gsub => ["auth_type","\\)",""]
    }
    mutate {
      replace => {
        "additional_auth_type.key" => "auth_type"
        "additional_auth_type.value.string_value" => "%{auth_type}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_auth_type"
      }
    }
  }
# callerContext Field
  if [call_context] != "" {
    mutate {
      replace => {
        "additional_callerContext.key" => "callerContext"
        "additional_callerContext.value.string_value" => "%{call_context}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_callerContext"
      }
    }
  }
# proto Field
  if [proto] != "" and [proto] !~ "webhdfs" {
    mutate {
      uppercase => ["proto"]
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "%{proto}"
      }
    }
  }
# perm Field
  if [perm] != "" {
    mutate {
      replace => {
        "additional_perm.key" => "perm"
        "additional_perm.value.string_value" => "%{perm}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_perm"
      }
    }
  }
# thread Field
  if [thread] != "" {
    mutate {
      replace => {
        "additional_thread.key" => "thread"
        "additional_thread.value.string_value" => "%{thread}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_thread"
      }
    }
  }
# File Name UDM Field
  if [fname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.src.file.full_path" => "%{fname}"
      }
    }
  }
# Source UDM Field
  if [src] != "" {
    grok {
      match => {
        "src" => "%{IP:src}"
      }
      overwrite => ["src"]
      on_error => "src_not_ip"
    }
    if [src_not_ip] {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{src}"
        }
      }
    }
    else {
      mutate {
         merge => {
          "event.idm.read_only_udm.principal.ip" => "src"
          "event.idm.read_only_udm.observer.ip" => "src"
        }
      }
    }
  }
# Destination UDM Field
  if [dst] != "" {
    grok {
      match => {
        "dst" => "%{IP:dst}"
      }
      overwrite => ["dst"]
      on_error => "dst_not_ip"
    }
    if [dst_not_ip] {
      if [dst] =~ "/user" {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.file.full_path" => "%{dst}"
          }
        }
      }
      else if [dst] not in ["NULL", "null", ""] {
        mutate {
          replace => {
            "event.idm.read_only_udm.target.hostname" => "%{dst}"
            "has_target" => "true"
          }
          on_error => "dst_replace_error"
        }
      }
    }
    else {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "dst"
        }
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
# Destination Host UDM Field
  if [dhost] != [dst] and [dhost] != "" {
    grok {
      match => {
        "dhost" => "%{IP:dhost}"
      }
      overwrite => ["dhost"]
      on_error => "dhost_not_ip"
    }
    if [dhost_not_ip] {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "%{dhost}"
          "has_target" => "true"
        }
      }
    }
    else {
      mutate {
         merge => {
          "event.idm.read_only_udm.target.ip" => "dhost"
        }
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
# Source Host UDM Field
  if [shost] != [src] and [shost] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{shost}"
      }
    }
  }
# method Field
  if [method] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{method}"
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
    if [dst] == "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "NULL"
          "has_target" => "true"
        }
      }
    }
  }
# url Field
  if [url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.url" => "%{url}"
      }
    }
  }
  # tip field
  if [tip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "tip"
      }
      replace => {
          "has_target" => "true"
      }
    }
  }

  # cmd field
  if [cmd] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.command_line" => "%{cmd}"
      }
    }
  }
# Source User UDM Field
  if [suser] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{suser}"
      }
    }
  }
# Summary Field
  if [summary] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{summary}"
      }
    }
  }
# Observer Data
  grok {
    match => {
      "observer" => "%{IP:test_ip}"
    }
    on_error => "not_ip"
  }
  if [not_ip] {
    mutate {
      replace => {
        "event.idm.read_only_udm.observer.hostname" => "%{observer}"
        "event.idm.read_only_udm.principal.hostname" => "%{observer}"
      }
    }
  }
  else {
    mutate {
       merge => {
        "event.idm.read_only_udm.observer.ip" => "observer"
        "event.idm.read_only_udm.principal.ip" => "observer"
      }
    }
  }
# Set Action
  if [allowed] == "false" or [product_event] =~ "Fail" {
    mutate {
      replace => {
        "security_action" => "BLOCK"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "security_action"
      }
    }
  }
  else if [allowed] == "true" {
    mutate {
      replace => {
        "security_action" => "ALLOW"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "security_action"
      }
    }
  }

# Severity Level
  if [severity] in ["INFO", "Info", "info"] {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"

      }
    }
  }
  else if [severity] in ["Low", "low", "LOW" ] {
    mutate {
      replace => {
        "security_result.severity" => "LOW"

      }
    }
  }
  else if [severity] in ["error", "Error", "WARN", "Warn" ] {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"

      }
    }
  }
  else if [severity] in ["High","high", "HIGH"] {
    mutate {
      replace => {
        "security_result.severity" => "HIGH"
        "security_result.alert_state" => "ALERTING"
      }
    }
  }
  else if [severity] in ["Critical","critical", "CRITICAL"] {
    mutate {
      replace => {
        "security_result.severity" => "CRITICAL"
        "security_result.alert_state" => "ALERTING"
      }
    }
  }
# Product Event Field
  if [product_event] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{product_event}"
      }
    }
  }
# Merge Security Results
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  if [has_target] == "false" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
# Generate Event
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
