# Product: SHAREPOINT
# Category: Collaboration log types
# Supported Format: SYSLOG,CSV,JSON
# Reference: NA
# Last Updated: 2025-03-15
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "database" => ""
      "SamAccountName" => ""
      "UserName" => ""
      "UserEmail" => ""
      "Occurred" => ""
      "ItemType" => ""
      "EventType" => ""
      "Directory" => ""
      "Leaf" => ""
      "EventData" => ""
      "fields" => ""
      "Created" => ""
      "LastModified" => ""
      "SecGroupName" => ""
      "SecSamAccountName" => ""
      "SecUserName" => ""
      "SecUserEmail" => ""
      "SecUserRole" => ""
      "SecUserURL" => ""
      "query" => ""
      "has_user" => "false"
      "has_principal" => "false"
      "has_principal_process" => "false"
      "has_target" => "false"
      "has_target_resource" => "false"
      "has_security_result" => "false"
      "security_result" => ""
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "grok_not_found" => ""
      "EventReceivedTime" => ""
      "SourceModuleName" => ""
      "SourceModuleType" => ""
      "EventTime" => ""
    }
  }
  grok {
    match => {
      "message" => [
        '\\\"%{DATA:database}\\\",\\\"%{DATA:SamAccountName}\\",\\\"%{DATA:UserName}\\\",\\\"%{DATA:UserEmail}\\\",\\\"%{DATA}\\\",\\\"%{DATA:ItemType}\\\",\\\"%{DATA:EventType}\\\",\\\"%{DATA:Directory}\\\",\\\"%{DATA:Leaf}\\\",\\\"%{DATA}<%{DATA:fields}>\\\",\\\"%{DATA:Created}\\\",\\\"%{DATA:LastModified}\\\",\\\"%{DATA:SecGroupName}\\\",\\"\\",\\\"%{DATA:SecSamAccountName}\\\",\\\"%{DATA:SecUserName}\\\",\\\"%{DATA:SecUserEmail}\\\",\\\"%{DATA:SecUserRole}\\\",\\\"%{DATA:SecUserURL}\\\"',
        '\\\"%{DATA:database}\\\",\\\"%{DATA:SamAccountName}\\\",\\\"%{DATA:UserName}\\\",\\\"%{DATA:UserEmail}\\\",\\\"%{MONTHNUM}/%{MONTHDAY}/%{YEAR} %{TIME} PM\\\",\\\"%{DATA:ItemType}\\\",\\\"%{DATA:EventType}\\\",\\\"%{DATA:Directory}\\\",\\\"%{DATA:Leaf}\\\",\\\"query=%{DATA:query}\;constraint=%{DATA} site:\\\"%{DATA:SecUserURL}\\\"%{DATA}\\\",\\\"%{DATA:Created}\\\",\\\"%{DATA:LastModified}\\\",\\\"%{DATA:SecGroupName}\\\",\\\"%{DATA:SecSamAccountName}\\\",\\\"%{DATA:SecUserName}\\\",\\\"%{DATA:SecUserEmail}\\\",\\\"%{DATA:SecUserRole}\\\",\\\"%{DATA:SecUserURL}\\\",\\\"\\\"'
      ]
    }
    on_error => "grok_not_found"
    overwrite => ["database", "SamAccountName", "UserName", "UserEmail", "ItemType", "EventType", "Directory", "Leaf", "EventData", "Created", "LastModified", "SecGroupName", "SecSamAccountName", "SecUserName", "SecUserEmail", "SecUserRole", "SecUserURL", "query","fields"]
  }
  if [grok_not_found] {
    mutate {
      gsub => ["message","\\\\",""]
    }
    csv {
      source => "message"
      separator => ","
      on_error => "not_csv"
    }
    mutate {
      replace => {
        "database" => "%{column1}"
        "SamAccountName" => "%{column2}"
        "UserName" => "%{column3}"
        "UserEmail" => "%{column4}"
        "Occurred" => "%{column5}"
        "ItemType" => "%{column6}"
        "EventType" => "%{column7}"
        "Directory" => "%{column8}"
        "Leaf" => "%{column9}"
        "EventData" => "%{column10}"
        "Created" => "%{column11}"
        "LastModified" => "%{column12}"
        "SecGroupName" => "%{column13}"
        "SecSamAccountName" => "%{column14}"
        "SecUserName" => "%{column15}"
        "SecUserEmail" => "%{column16}"
        "SecUserRole" => "%{column17}"
        "SecUserURL" => "%{column18}"
      }
      on_error => "csv_not_found"
    }
    if [not_csv] or [grok_not_found] {
      mutate {
        gsub => ["message","\\\\",""]
      }
      json {
        source => "message"
        array_function => "split_columns"
        on_error => "not_json"
      }
    }
  }

  if [database] != "" {
    mutate {
      merge => {
        "principal.process.file.names" => "database"
      }
      on_error => "database_not_found"
    }
    if ![database_not_found] {
      mutate {
        replace => {
          "has_principal_process" => "true"
        }
      }
    }
  }
  if [SamAccountName] != "" {
    mutate {
      gsub => ["SamAccountName","\\\\",","]
    }
    mutate {
      replace => {
        "principal.hostname" => "%{SamAccountName}"
        "principal.asset.hostname" => "%{SamAccountName}"
        "has_principal" => "true"
      }
      on_error => "sam_account_name_not_found"
    }
  }
  if [UserName] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{UserName}"
        "has_user" => "true"
      }
      on_error => "user_name_not_found"
    }
  }
  if [UserEmail] != "" and [UserEmail] =~ "^.+@.+$" {
    mutate {
      merge => {
        "principal.user.email_addresses" => "UserEmail"
      }
      on_error => "user_email_not_found"
    }
    if ![user_email_not_found] {
      mutate {
        replace => {
          "has_user" => "true"
        }
      }
    }
  }
  if [Occurred] != "" {
    date {
      match => ["Occurred", "MM/dd/yyyy HH:mm:ss A","MM/dd/yyyy HH:mm:ss a","M/d/yyyy HH:mm:ss A"]
      on_error => "occurred_not_found"
    }
  }
  if [ItemType] != "" {
    mutate {
      replace => {
        "target.resource.type" => "%{ItemType}"
        "has_target_resource" => "true"
      }
      on_error => "item_type_not_found"
    }
  }
  if [EventType] != "" {
    mutate {
      replace => {
        "security_result.description" => "%{EventType}"
        "has_security_result" => "true"
      }
      on_error => "event_type_not_found"
    }
  }
  if [Directory] != "" {
    mutate {
      replace => {
        "target.file.full_path" => "%{Directory}"
        "has_target" => "true"
      }
      on_error => "directory_not_found"
    }
  }
  if [Leaf] != ""{
    mutate {
      merge => {
       "target.file.names" => "Leaf"
      }
      on_error => "leaf_not_found"
    }
    if ![leaf_not_found] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [EventData] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{EventData}"
      }
      on_error => "event_data_not_found"
    }
  }
  if [Created] != "" {
    mutate {
      replace => {
        "Created_label.key" => "Created"
        "Created_label.value" => "%{Created}"
      }
      on_error => "created_not_found"
    }
    if ![created_not_found] {
      mutate {
        merge => {
          "principal.asset.attribute.labels" => "Created_label"
        }
        on_error => "created_not_found"
      }
    }
  }
  if [LastModified] != "" {
    mutate {
      replace => {
        "last_modified.key" => "Last Modified"
        "last_modified.value" => "%{LastModified}"
      }
      merge => {
        "principal.asset.attribute.labels" => "last_modified"
      }
      on_error => "last_modified_not_found"
    }
  }
  if [SecGroupName] != "" {
    mutate {
      merge => {
        "target.user.group_identifiers" => "SecGroupName"
      }
      on_error => "sec_group_name_not_found"
    }
  }
  if [SecSamAccountName] != "" {
    mutate {
      replace => {
        "target.user.userid" => "%{SecSamAccountName}"
      }
      on_error => "user_name_not_found"
    }
  }
  if [SecUserName] != "" {
    mutate {
      replace => {
        "target.user.user_display_name" => "%{SecUserName}"
      }
      on_error => "user_name_not_found"
    }
  }
  if [SecUserEmail] != "" and [SecUserEmail] =~ "^.+@.+$"{
    mutate {
      merge => {
        "target.user.email_addresses" => "SecUserEmail"
      }
      on_error => "user_email_not_found"
    }
    if ![user_email_not_found] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [SecUserRole] != "" {
    mutate {
      replace => {
        "role.name" => "%{SecUserRole}"
      }
    }
    mutate {
      merge => {
        "target.user.attribute.roles" => "role"
      }
      on_error => "sec_user_role_not_found"
    }
  }
  if [SecUserURL] != "" {
    mutate {
      replace => {
        "target.url" => "%{SecUserURL}"
      }
      on_error => "sec_user_url_not_found"
    }
  }
  if [SourceModuleName] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_version" => "%{SourceModuleName}"
      }
      on_error => "source_module_name_not_found"
    }
  }
  if [SourceModuleType] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{SourceModuleType}"
      }
    }
  }
  if [has_principal] == "true" and ([has_target_resource] == "true" or [has_target] == "true"){
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_RESOURCE_ACCESS"
      }
    }
  } else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "SHAREPOINT"
      "event.idm.read_only_udm.metadata.product_name" => "SHAREPOINT"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
