# Product: BROADCOM_CA_PAM
# Category:NA
# Supported Format: SYSLOG
# Reference:NA
# Last Updated:2024-11-08
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "network" => ""
      "security_result" => ""
      "host"=>""
      "pid"=>""
      "kvdata"=>""
      "extensions"=>""
      "User" => ""
      "UserGroup" => ""
      "Details" => ""
      "NatIP" => ""
      "Transaction" => ""
      "Address" => ""
      "DeviceName" => ""
      "Service_App" => ""
      "TargetAccount" => ""
      "has_principal" => "false"
      "Port" => ""
      "access_protocol" => ""
      "xml_data" => ""
      "bm_id" => ""
      "bm_cd" => ""
      "bm_cu" => ""
      "bm_ud" => ""
      "bm_uu" => ""
      "bm_ha" => ""
      "ta_id" => ""
      "un" => ""
      "cd" => ""
      "ca" => ""
      "cb" => ""
      "um" => ""
      "as" => ""
      "pv" => ""
      "cat" => ""
      "skid" => ""
      "uoid" => ""
      "lv" => ""
      "lw" => ""
      "pvp" => ""
      "at_na" => ""
      "at_ob_id" => ""
      "at_ob_cl" => ""
      "c_cw_m_at_bm_id" => ""
      "c_cw_m_at_bm_cd" => ""
      "c_cw_m_at_bm_cu" => ""
      "c_cw_m_at_bm_ud" => ""
      "c_cw_m_at_bm_uu" => ""
      "c_cw_m_at_bm_ha" => ""
      "c_cw_m_at_at_na" => ""
      "has_user" => "false"

    }
  }
  grok {
    match => {
      "message" => [
        "%{TIMESTAMP_ISO8601} %{TIMESTAMP_ISO8601} %{HOSTNAME:host} <%{INT}>%{DATA}\\[%{INT:pid}\\]: (created = %{TIMESTAMP_ISO8601} )?%{GREEDYDATA:kvdata}",
        "%{TIMESTAMP_ISO8601} %{TIMESTAMP_ISO8601} %{DATA} %{INT} %{TIMESTAMP_ISO8601} %{HOSTNAME:host} %{DATA} %{DATA} %{DATA} %{DATA} (?P<xml_data>%{GREEDYDATA})",
        "<%{INT}>%{MONTH}\\s+%{MONTHDAY} %{TIME} %{HOSTNAME:host} (<%{INT}>)?%{DATA}\\[%{INT:pid}\\]: (created = %{TIMESTAMP_ISO8601} )?%{GREEDYDATA:kvdata}",
        "<%{INT}>%{MONTH}\\s+%{MONTHDAY} %{TIME} %{DATA} %{INT} %{TIMESTAMP_ISO8601} %{HOSTNAME:host} %{DATA} %{DATA} %{DATA} %{DATA} (?P<xml_data>%{GREEDYDATA})"
      ]
    }
    overwrite => ["host","pid","kvdata","xml_data"]
    on_error => "pattern_not_matched"
  }
  if [xml_data] != "" {
    xml {
      source => "xml_data"
      xpath => {
        "/c.cw.m.ac/bm.id" => "bm_id"
        "/c.cw.m.ac/bm.cd" => "bm_cd"
        "/c.cw.m.ac/bm.cu" => "bm_cu"
        "/c.cw.m.ac/bm.ud" => "bm_ud"
        "/c.cw.m.ac/bm.uu" => "bm_uu"
        "/c.cw.m.ac/bm.ha" => "bm_ha"
        "/c.cw.m.ac/ta.id" => "ta_id"
        "/c.cw.m.ac/un" => "un"
        "/c.cw.m.ac/cd" => "cd"
        "/c.cw.m.ac/ca" => "ca"
        "/c.cw.m.ac/cb" => "cb"
        "/c.cw.m.ac/um" => "um"
        "/c.cw.m.ac/as" => "as"
        "/c.cw.m.ac/pv" => "pv"
        "/c.cw.m.ac/cat" => "cat"
        "/c.cw.m.ac/skid" => "skid"
        "/c.cw.m.ac/uoid" => "uoid"
        "/c.cw.m.ac/lv" => "lv"
        "/c.cw.m.ac/lw" => "lw"
        "/c.cw.m.ac/pvp" => "pvp"
      }
      on_error => "no_xml_data"
    }
    if [bm_id] != "" {
      mutate {
        replace => {
          "bm_id_label.key" => "bm_id"
          "bm_id_label.value" => "%{bm_id}"
        }
        on_error => "no_bm_id"
      }
      if ![no_bm_id] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "bm_id_label"
          }
          on_error => "no_bm_id_label"
        }
      }
    }
    if [bm_cd] != "" {
      mutate {
        replace => {
          "bm_cd_label.key" => "bm_cd"
          "bm_cd_label.value" => "%{bm_cd}"
        }
        on_error => "no_bm_cd"
      }
      if ![no_bm_cd] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "bm_cd_label"
          }
          on_error => "no_bm_cd_label"
        }
      }
    }
    if [bm_cu] != "" {
      mutate {
        replace => {
          "bm_cu_label.key" => "bm_cu"
          "bm_cu_label.value" => "%{bm_cu}"
        }
        on_error => "no_bm_cu"
      }
      if ![no_bm_cu] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "bm_cu_label"
          }
          on_error => "no_bm_cu_label"
        }
      }
    }
    if [bm_ud] != "" {
      mutate {
        replace => {
          "bm_ud_label.key" => "bm_ud"
          "bm_ud_label.value" => "%{bm_ud}"
        }
        on_error => "no_bm_ud"
      }
      if ![no_bm_ud] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "bm_ud_label"
          }
          on_error => "no_bm_ud_label"
        }
      }
    }
    if [bm_uu] != "" {
      mutate {
        replace => {
          "bm_uu_label.key" => "bm_uu"
          "bm_uu_label.value" => "%{bm_uu}"
        }
        on_error => "no_bm_uu"
      }
      if ![no_bm_uu] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "bm_uu_label"
          }
          on_error => "no_bm_uu_label"
        }
      }
    }
    if [bm_ha] != "" {
      mutate {
        replace => {
          "bm_ha_label.key" => "bm_ha"
          "bm_ha_label.value" => "%{bm_ha}"
        }
        on_error => "no_bm_ha"
      }
      if ![no_bm_ha] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "bm_ha_label"
          }
          on_error => "no_bm_ha_label"
        }
      }
    }
    if [ta_id] != "" {
      mutate {
        replace => {
          "ta_id_label.key" => "ta_id"
          "ta_id_label.value" => "%{ta_id}"
        }
        on_error => "no_ta_id"
      }
      if ![no_ta_id] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "ta_id_label"
          }
          on_error => "no_ta_id_label"
        }
      }
    }
    if [un] != "" {
      mutate {
        replace => {
          "un_label.key" => "un"
          "un_label.value" => "%{un}"
        }
        on_error => "no_un"
      }
      if ![no_un] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "un_label"
          }
          on_error => "no_un_label"
        }
      }
    }
    if [cd] != "" {
      mutate {
        replace => {
          "cd_label.key" => "cd"
          "cd_label.value" => "%{cd}"
        }
        on_error => "no_cd"
      }
      if ![no_cd] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "cd_label"
          }
          on_error => "no_cd_label"
        }
      }
    }
    if [ca] != "" {
      mutate {
        replace => {
          "ca_label.key" => "ca"
          "ca_label.value" => "%{ca}"
        }
        on_error => "no_ca"
      }
      if ![no_ca] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "ca_label"
          }
          on_error => "no_ca_label"
        }
      }
    }
    if [cb] != "" {
      mutate {
        replace => {
          "cb_label.key" => "cb"
          "cb_label.value" => "%{cb}"
        }
        on_error => "no_cb"
      }
      if ![no_cb] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "cb_label"
          }
          on_error => "no_cb_label"
        }
      }
    }
    if [um] != "" {
      mutate {
        replace => {
          "um_label.key" => "um"
          "um_label.value" => "%{um}"
        }
        on_error => "no_um"
      }
      if ![no_um] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "um_label"
          }
          on_error => "no_um_label"
        }
      }
    }
    if [as] != "" {
      mutate {
        replace => {
          "as_label.key" => "as"
          "as_label.value" => "%{as}"
        }
        on_error => "no_as"
      }
      if ![no_as] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "as_label"
          }
          on_error => "no_as_label"
        }
      }
    }
    if [pv] != "" {
      mutate {
        replace => {
          "pv_label.key" => "pv"
          "pv_label.value" => "%{pv}"
        }
        on_error => "no_pv"
      }
      if ![no_pv] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "pv_label"
          }
          on_error => "no_pv_label"
        }
      }
    }
    if [cat] != "" {
      mutate {
        replace => {
          "cat_label.key" => "cat"
          "cat_label.value" => "%{cat}"
        }
        on_error => "no_cat"
      }
      if ![no_cat] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "cat_label"
          }
          on_error => "no_cat_label"
        }
      }
    }
    if [skid] != "" {
      mutate {
        replace => {
          "skid_label.key" => "skid"
          "skid_label.value" => "%{skid}"
        }
        on_error => "no_skid"
      }
      if ![no_skid] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "skid_label"
          }
          on_error => "no_skid_label"
        }
      }
    }
    if [uoid] != "" {
      mutate {
        replace => {
          "uoid_label.key" => "uoid"
          "uoid_label.value" => "%{uoid}"
        }
        on_error => "no_uoid"
      }
      if ![no_uoid] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "uoid_label"
          }
          on_error => "no_uoid_label"
        }
      }
    }
    if [lv] != "" {
      mutate {
        replace => {
          "lv_label.key" => "lv"
          "lv_label.value" => "%{lv}"
        }
        on_error => "no_lv"
      }
      if ![no_lv] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "lv_label"
          }
          on_error => "no_lv_label"
        }
      }
    }
    if [lw] != "" {
      mutate {
        replace => {
          "lw_label.key" => "lw"
          "lw_label.value" => "%{lw}"
        }
        on_error => "no_lw"
      }
      if ![no_lw] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "lw_label"
          }
          on_error => "no_lw_label"
        }
      }
    }
    if [pvp] != "" {
      mutate {
        replace => {
          "pvp_label.key" => "pvp"
          "pvp_label.value" => "%{pvp}"
        }
        on_error => "no_pvp"
      }
      if ![no_pvp] {
        mutate {
          merge => {
            "sec_res.detection_fields" => "pvp_label"
          }
          on_error => "no_pvp_label"
        }
      }
    }
    for index, _ in xml(message,/c.cw.m.ac/bm.at.li/c.cw.m.at){
      mutate {
        replace => {
          "sec_res" => ""
          "c_cw_m_at_bm_id" => ""
          "c_cw_m_at_bm_cd" => ""
          "c_cw_m_at_bm_cu" => ""
          "c_cw_m_at_bm_ud" => ""
          "c_cw_m_at_bm_uu" => ""
          "c_cw_m_at_bm_ha" => ""
          "c_cw_m_at_at_na" => ""
          "at_ob_id" => ""
          "at_ob_cl" => ""
        }
      }
      xml {
        source => "message"
        xpath => {
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/bm.id" => "c_cw_m_at_bm_id"
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/bm.cd" => "c_cw_m_at_bm_cd"
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/bm.cu" => "c_cw_m_at_bm_cu"
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/bm.ud" => "c_cw_m_at_bm_ud"
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/bm.uu" => "c_cw_m_at_bm_uu"
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/bm.ha" => "c_cw_m_at_bm_ha"
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/at.na" => "c_cw_m_at_at_na"
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/at.ob.id" => "at_ob_id"
          "/c.cw.m.ac/bm.at.li/c.cw.m.at[%{index}]/at.ob.cl" => "at_ob_cl"
        }
        on_error => "no_xml_data"
      }

      if [c_cw_m_at_bm_id] != "" {
        mutate {
          replace => {
            "bm_id_label.key" => "bm_id"
            "bm_id_label.value" => "%{c_cw_m_at_bm_id}"
          }
          on_error => "no_bm_id"
        }
        if ![no_bm_id] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "bm_id_label"
            }
            on_error => "no_bm_id_label"
          }
        }
      }
      if [c_cw_m_at_bm_cd] != "" {
        mutate {
          replace => {
            "bm_cd_label.key" => "bm_cd"
            "bm_cd_label.value" => "%{c_cw_m_at_bm_cd}"
          }
          on_error => "no_bm_cd"
        }
        if ![no_bm_cd] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "bm_cd_label"
              }
            on_error => "no_bm_cd_label"
          }
        }
      }
      if [c_cw_m_at_bm_cu] != "" {
        mutate {
          replace => {
            "bm_cu_label.key" => "bm_cu"
            "bm_cu_label.value" => "%{c_cw_m_at_bm_cu}"
          }
          on_error => "no_bm_cu"
        }
        if ![no_bm_cu] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "bm_cu_label"
              }
            on_error => "no_bm_cu_label"
          }
        }
      }
      if [c_cw_m_at_bm_ud] != "" {
        mutate {
          replace => {
            "bm_ud_label.key" => "bm_ud"
            "bm_ud_label.value" => "%{c_cw_m_at_bm_ud}"
          }
          on_error => "no_bm_ud"
        }
        if ![no_bm_ud] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "bm_ud_label"
            }
            on_error => "no_bm_ud_label"
          }
        }
      }
      if [c_cw_m_at_bm_uu] != "" {
        mutate {
          replace => {
            "bm_uu_label.key" => "bm_uu"
            "bm_uu_label.value" => "%{c_cw_m_at_bm_uu}"
          }
          on_error => "no_bm_uu"
        }
        if ![no_bm_uu] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "bm_uu_label"
            }
            on_error => "no_bm_uu_label"
          }
        }
      }
      if [c_cw_m_at_bm_ha] != "" {
        mutate {
          replace => {
            "bm_ha_label.key" => "bm_ha"
            "bm_ha_label.value" => "%{c_cw_m_at_bm_ha}"
          }
          on_error => "no_bm_ha"
        }
        if ![no_bm_ha] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "bm_ha_label"
            }
            on_error => "no_bm_ha_label"
          }
        }
      }
      if [c_cw_m_at_at_na] != "" {
        mutate {
          replace => {
            "at_na_label.key" => "at_na"
            "at_na_label.value" => "%{c_cw_m_at_at_na}"
          }
          on_error => "no_at_na"
        }
        if ![no_at_na] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "at_na_label"
              }
            on_error => "no_at_na_label"
          }
        }
      }
      if [at_ob_id] != "" {
        mutate {
          replace => {
            "at_ob_id_label.key" => "at_ob_id"
            "at_ob_id_label.value" => "%{at_ob_id}"
          }
          on_error => "no_at_ob_id"
        }
        if ![no_at_ob_id] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "at_ob_id_label"
              }
            on_error => "no_at_ob_id_label"
          }
        }
      }
      if [at_ob_cl] != "" {
        mutate {
          replace => {
            "at_ob_cl_label.key" => "at_ob_cl"
            "at_ob_cl_label.value" => "%{at_ob_cl}"
          }
          on_error => "no_at_ob_cl"
        }
        if ![no_at_ob_cl] {
          mutate {
            merge => {
              "sec_res.detection_fields" => "at_ob_cl_label"
            }
            on_error => "no_at_ob_cl_label"
          }
        }
      }

      if [sec_res] != "" {
        mutate {
          merge => {
            "event.idm.read_only_udm.security_result" => "sec_res"
          }
          on_error => "no_sec_res"
        }
      }
    }
  }



  if [pid] != "" {
    mutate {
      replace => {
        "principal.process.pid" => "%{pid}"
      }
      on_error => "no_pid"
    }
  }
  if [kvdata] != "" {
    mutate {
      gsub => ["kvdata","target","log_target"]
    }
    mutate {
      gsub => ["kvdata", ", ", "#"]
    }
    mutate {
      gsub => ["kvdata", "#([0-9a-zA-Z_.-]+?)=", ",$2="]
    }
    mutate {
      gsub => ["kvdata","User Group","UserGroup"]
    }
    mutate {
      gsub => ["kvdata","Nat/Proxy IP","NatIP"]
    }
    mutate {
      gsub => ["kvdata","Device Name","DeviceName"]
    }
    mutate {
      gsub => ["kvdata","Service/App","Service_App"]
    }
    mutate {
      gsub => ["kvdata","Target Account","TargetAccount"]
    }
    kv {
      source => "kvdata"
      value_split => ":"
      field_split => "#"
      on_error => "kv_failed"
    }
  }

  if [Details] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{Details}"
      }
      on_error => "no_details"
    }
  }
  if [host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host}"
        "principal.asset.hostname" => "%{host}"
        "has_principal" => "true"
      }
      on_error => "no_host"
    }
  }
  if [NatIP] != "" {
    mutate {
      merge => {
        "principal.nat_ip" => "NatIP"
      }
      on_error => "no_NatIP"
    }
  }
  if [Transaction] != "" {
    mutate {
      replace => {
        "detection_fields.key" => "Transaction"
        "detection_fields.value" => "%{Transaction}"
      }
      on_error => "no_Transaction"
    }
    if ![no_Transaction] {
      mutate {
        merge => {
          "security_result.detection_fields" => "detection_fields"
        }
        on_error => "no_Transaction"
      }
    }
  }
  if [Address] not in ["","--","- -"] {
    mutate {
      replace => {
        "target.hostname" => "%{Address}"
        "target.asset.hostname" => "%{Address}"
      }
      on_error => "no_Address"
    }
  }
  if [DeviceName] not in ["","--","- -"] {
    mutate {
      replace => {
        "principal.resource.name" => "%{DeviceName}"
      }
      on_error => "no_DeviceName"
    }
  }
  if [User] != "" {
    mutate  {
      replace => {
        "principal.user.userid" => "%{User}"
        "has_user" => "true"
      }
      on_error => "no_User"
    }
  } 
  if [UserGroup] not in ["","--"] {
    mutate {
      replace => {
        "UserGroup_label.key" => "UserGroup"
        "UserGroup_label.value.string_value" => "%{UserGroup}"
      }
          on_error => "UserGroup_not_present"
    }
    if ![UserGroup_not_present] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "UserGroup_label"
        }
        on_error => "UserGroup_merge_not_valid"
      }
    }
  }
  if [Service_App] not in ["","--","- -"] {
    mutate {
      replace => {
        "target.application" => "%{Service_App}"
      }
      on_error => "no_Service_App"
    }
  }
  if [Port] not in ["","- -","-"] {
    mutate {
      replace => {
        "principal.port" => "%{Port}"
      }
      on_error => "no_Port"
    }
    mutate {
      convert => {
        "principal.port" => "integer"
      }
      on_error => "no_Port"
    }
  }
  if [access_protocol] != "" {
    mutate {
      replace => {
        "metadata.access_protocol" => "%{access_protocol}"
      }
      on_error => "no_access_protocol"
    }
  }
  mutate {
    replace => {
      "metadata.product_name" => "Broadcom CA Pam"
      "metadata.vendor_name" => "Broadcom"
    }
  }
  if [has_principal] == "true" and  [Details] =~ "scan completed"{
    mutate {
      replace => {
        "metadata.event_type" => "SCAN_UNCATEGORIZED"
      }
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "no_security_result"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
